{
  "description": "ChecksMate is a game where you play chess, but all of your pieces were scattered across the multiworld.\nYou win when you checkmate the opposing king!",
  "game": "ChecksMate",
  "github": "https://github.com/chesslogic/chessv",
  "license": "GPL-3.0",
  "manifest_fields": [],
  "versions": {
    "v0.0": {
      "created_at": "2023-12-03T07:59:01Z",
      "description": "This client is intended to be used in the alpha test of the ChecksMate randomizer.\r\n\r\n- Fix an issue on first-time startup involving a crash on concurrent file reads.\r\n- Fix an issue when placing many pawns for settings that exclude one type of pawn, where the setting would be ignored for pawns after the second rank (usually the first 8 pawns).\r\n- Prevent invalid OptionSet generation for fairy_chess_pieces.\r\n  - This is reflected in a bug report in core: https://discord.com/channels/731205301247803413/1180659103316586537/1180659103316586537\r\n- Reintroduce the default \"archipelago.gg:\" text in the server field when no previous connection was recorded (e.g. on first-time startup).",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.0/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "09d63684319abc17314a67aa857efa27d4705e873eb62dea16efd451cb0d7727",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.0",
      "size": 48366,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.0",
      "title": "Client v0.0",
      "version_simple": "0.0",
      "world_version": "0.0"
    },
    "v0.1": {
      "created_at": "2023-12-05T00:00:34Z",
      "description": "That one lasted about as long as expected.\r\n\r\n- Fix for a crash when a major piece limit is surpassed before their upgrades are found.\r\n- Now excludes pawns and pockets outside of player army.\r\n- \"Bring to front\" with APMW button on MainForm.\r\n  - Emphasizes some minor issues with log history (when you close and reopen the form a lot). If you break the GUI, send reports on specifics of whether the underlying connection breaks.\r\n- Fix to prevent player from checking locations by using a non-APMW game.\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v0.0...v0.1",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.1/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "378cc92534cb93f78592b6f40be001523223991a07e7f5bc1a9a37de0164953b",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.1",
      "size": 48755,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.1",
      "title": "Client v0.1",
      "version_simple": "0.1",
      "world_version": "0.1"
    },
    "v0.2": {
      "created_at": "2023-12-15T23:32:36Z",
      "description": "This version lowers the barrier to entry and provides a basic logic.\r\n\r\n- Rename \"Bongcloud opening\" items to specific instructions, like \"King to A File\".\r\n- Improve locked_items, which now specifies a minimum (potentially added at the end), rather than forces a total into the pool.\r\n  - Be advised that this still does not affect the interaction between `locked_items` and `starting_inventory`.\r\n- Fix severe logic bug where rules were replaced rather than amended.\r\n- Fix generator bug which added a larger amount of material than intended.\r\n- Increase generator's perspective of value of minor pieces, which will occasionally slightly reduce the material value in the pool.\r\n- Slightly reduce the potency of Herald custom piece.",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "811c09c41b9080bdbdd1e49dbf79d3a93410ad059ba9c864444ce8f3d05fc119",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2",
      "size": 54175,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2",
      "title": "Client v0.2",
      "version_simple": "0.2",
      "world_version": "0.2"
    },
    "v0.2.10": {
      "created_at": "2024-08-17T03:29:59Z",
      "description": "A few new Locations, a few very obvious pieces of cleanup and some technical improvements too.\r\n\r\n- Breaking change: Rename some dated Options related to Fairy Pieces.\r\n- Support Item Link by adding requested filler items.\r\n  - Note that choosing Progressive Pocket Range as your item link filler may cause pocket pawns placed directly onto the 8th rank to fail to promote. (A \"piece drop\" is not a promotion-worthy move.)\r\n- Add 4 new survival time Locations.\r\n- Display current Pocket Gems while in Super Mode.\r\n- Minor tweaks to difficulty curve of some midgame locations in Super Mode or involving pawn sequences.\r\n\r\nThere's a known issue, which I believe involves the AI trying really hard to believe it can capture your King and getting stuck in a thought spiral that crashes the system. I have a vague idea of what to do about it, but curating AI decisions has historically proven difficult, as has stack management.\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v0.2.9...v0.2.10",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2.10/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "18449d8c72aed00d158b61fdc37c5e5b4abcbb2586b3de879dad5fc482467324",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2.10",
      "size": 94526,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2.10",
      "title": "Client 0.2.10",
      "version_simple": "0.2.10",
      "world_version": "0.2.10"
    },
    "v0.2.11": {
      "created_at": "2024-11-06T15:37:19Z",
      "description": "Provides some client-side options to improve player agency. Fixes for generator crashes and aberrant CPU moves.\r\n\r\n- Feat: Difficulty drop-down. You may play on a lower AI difficulty before acquiring the item.\r\n  - Note that this reduces the AI level of play relative to earned difficulty, not base difficulty.\r\n- Feat: Player may temporarily disable the big board after acquiring the enabling item.\r\n  - This allows the player to go back to acquire capture-related checks which may be difficult to execute on the big board.\r\n  - While unintended, this is allowed while using the Super goal.\r\n- Fix: \"Super\" goal now functions. (Places \"Super-Size Me!\" item in your starting inventory.)\r\n- Feat: Difficulty tweaks involving midgame \"4+\", \"Of Each\", and \"Pawn\" series.\r\n- Feat: Generator support for Python 3.8.\r\n- Fix: CPU no longer castles its queen on the big board. Instead, castling is scaled and uses the king.\r\n- Fix: Pocket piece placement prevention placated. Now allows drops of small pieces irrespective of pocket piece order.\r\n- Fix: Generator no longer infinite loops nor crashes due to limit-related settings.\r\n\r\n![YUfsmxo 1](https://github.com/user-attachments/assets/88af2e8b-9048-40e7-9f81-18fe6bdb7516)",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2.11/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "f61dd93dc64189c3249c7b26f3676424fbce806e56074a611b39308448bed7b8",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2.11",
      "size": 121005,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2.11",
      "title": "Client 0.2.11",
      "version_simple": "0.2.11",
      "world_version": "0.2.11"
    },
    "v0.2.12": {
      "created_at": "2024-12-23T17:12:15Z",
      "description": "Refactor. Support DeathLink.\r\n\r\n- Feature: DeathLink. Add client setting to disable DeathLink.\r\n  - DeathLink is toggled on in slot data by the generator. This allows the client to know whether to turn on DeathLink.\r\n  - DeathLink can be disabled by the client in the settings area. This setting cannot be enabled if it was not set in generation.\r\n- Rebalance locations.\r\n  - Generator reflects client's ability to disable super mode. The difficulty curve will be steeper for most locations.\r\n    - Known bug: Capture Everything is much more difficult than intended. Other locations should be affected normally.\r\n  - Improved location difficulty scaling. Certain series and pieces have a more appropriate scaling, ensuring they are easier to access.\r\n- Full support for Universal Tracker. Now counts the number of queen upgrades you actually have, which can differ from the internal max.\r\n  - This should improve visibility of whether castling is accessible.\r\n- Fix client crash on having too many precollected items.\r\n  - Known bug: The generator (both CollectionState and ItemPool) still doesn't count material properly when an item exceeds the maximum quantity.\r\n  - Warning: Don't force more king promotions or consuls into the pool than the game natively supports. They will never work, and it will just make things harder for you.\r\n- Fix early removal of the Queen upgrade in some circumstances. You'll see a different distribution of pieces and pawns in the future!\r\n- Fix a conceivable rare infinite loop if you do something really weird with your major piece limit and queen piece limit. I don't know if you can even directly tinker with this property this way outside of tests, but it's some kind of a fix.\r\n- Technical: Enormous refactor of the generator. It's likely that this introduced some bugs. However, this supports an incredible amount of unit tests. The individual unit tests and the default world tests are passing. Please report any issues you experience.\r\n\r\nHappy Holidays. There's no secret Santa piece, nor does the client support Gifting - but what's this? My friend died? Where's the receipt?\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v0.2.11...v0.2.12",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2.12/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "cda66394cae0309634e57e73a36098159414d3b18434c36b1f0694737dea9714",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2.12",
      "size": 162498,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2.12",
      "title": "Client 0.2.12",
      "version_simple": "0.2.12",
      "world_version": "0.2.12"
    },
    "v0.2.13": {
      "created_at": "2024-12-23T17:12:15Z",
      "description": "Generator-only bugfix. Fully compatible with the v0.2.12 client, there are no other changes.\r\n\r\n- Fix an issue where the length of itempool doesn't match the length of locations if the user disables pocket pieces completely.\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v0.2.11...v0.2.13",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2.13/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "25a9f44d033361aef8b5469df83bea607d2ec8e894ad444fca8b2249214b3ce4",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2.13",
      "size": 162544,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2.13",
      "title": "Non-Client 0.2.13",
      "version_simple": "0.2.13",
      "world_version": "0.2.13"
    },
    "v0.2.14": {
      "created_at": "2025-02-27T01:48:49Z",
      "description": "Behold content.\r\n\r\n- New fairy pawn: Checkers, what a classic! They can even capture by hopping over the edge of the board.\r\n- New army type: Petal, how beautiful! See the template for documentation on their behaviour.\r\n- New pawn generation: Sergeants and material rounding! If you have way too many pawns, or especially weak pieces, you'll get compensated.\r\n- Enhance AI evaluation of fairy pawn boards.\r\n- Fix location handling for en passant captures.\r\n- Fix pocket related crashes, mostly when more are forced into the pool (locked items or item cheat).\r\n  - Fix when player has too many pockets.\r\n  - Fix when seed isn't populated after too many pockets are forced into the pool.\r\n  - Allow players to get more pockets if they get more pockets beyond pocket limit.\r\n- Fixes on small board after acquiring big board.\r\n  - Fix locations for captures.\r\n  - Fix King offset.\r\n- Fix for very large quantities of pieces. (This only happens on returning to the small board or with forced items)\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v0.2.12...v0.2.14",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2.14/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "cac6e729a1d29e064e533004ae098627ddf673c9d9425e653f48948b84a261c3",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2.14",
      "size": 175850,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2.14",
      "title": "Client 0.2.14",
      "version_simple": "0.2.14",
      "world_version": "0.2.14"
    },
    "v0.2.2": {
      "created_at": "2023-12-17T19:50:02Z",
      "description": "This is a golden beta release. Feel free to use this apworld in private testing without direct developer oversight.\r\n\r\n- Fix a major logic issue. Spheres are now accessible in the proper order.\r\n  - See: https://discord.com/channels/731205301247803413/1191248462273064960/1191602798752694312\r\n- Allow the user to connect using a separate slot name within a given room without restarting the client.\r\n\r\nThis is fully reverse-compatible with 0.2 releases.\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v0.2...v0.2.2",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2.2/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "665cf6610926d8366c674fde0370317383a3e8c9c6b1ab0d8404625678c37be9",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2.2",
      "size": 53870,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2.2",
      "title": "Client v0.2.2",
      "version_simple": "0.2.2",
      "world_version": "0.2.2"
    },
    "v0.2.3": {
      "created_at": "2023-12-17T19:50:02Z",
      "description": "See Client 0.2.2 for a copy of the ChessV C# client.\r\n\r\n* Performance improvements during generation, reducing the time it should take to create a new room using this apworld.\r\n* Increase logic restrictions on some midgame rules like Capture 7 Pawns, creating a more gradual slope of item distribution.\r\n* Lay groundwork for improved Universal Tracker support. Worlds generated using this file should be future-compatible with certain planned updates providing UT support for castling.\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v0.2.1...v0.2.3",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2.3/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "e8274d4638149cba55f4aa03ad45ae769d830b077832cfa674e4c8ce66335b30",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2.3",
      "size": 53797,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2.3",
      "title": "Client 0.2.3 (apworld only)",
      "version_simple": "0.2.3",
      "world_version": "0.2.3"
    },
    "v0.2.4": {
      "created_at": "2024-03-11T02:43:12Z",
      "description": "This release improves some convenience of play, as well as enables new styles of army distribution.\r\n\r\n * Increase pawn cap from 14 to 32. Also enables increased initial pawn forwardness.\r\n   * Future work will include disabling specific filler items (e.g. \"pocket gems\"), as this adds support for applying more pawn forwardness.\r\n * Board now rotates by default so that the human player is at the bottom of the screen.\r\n   * This means the \"A file\" is now on the right of the screen for the black player. Future work may change the \"King to A File\" location to \"King to A/H File\".\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v0.2.2...v0.2.4",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2.4/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "4c3b43feaad6a759e7e1581b8e260c1b22e260244027cd0372d29b469937e158",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2.4",
      "size": 53801,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2.4",
      "title": "Client 0.2.4",
      "version_simple": "0.2.4",
      "world_version": "0.2.4"
    },
    "v0.2.5": {
      "created_at": "2024-04-30T14:11:01Z",
      "description": "Bug fixes and some debug info. No changes to YAML format.\r\n\r\n * Fix for castled rook captures. When the AI castled its king, we forgot where their rook started. No longer!\r\n * Additional support for pocket_limit=0 in the form of pocket_limit_by_pocket=0 not crashing.\r\n * Display certain catastrophic room-related exceptions in the apmw form log on connect. (There should probably be a better UI around this, but it makes the APMW-ness of the error more overt. Before this change, the game crashes mysteriously on start - but we now know there's an issue on connect.)\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v0.2.4...v0.2.5",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2.5/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "94ee6233a3660aa9354a281835b9b038623b95bfdf5934abf38fd37bb818b72f",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2.5",
      "size": 53810,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2.5",
      "title": "Client 0.2.5",
      "version_simple": "0.2.5",
      "world_version": "0.2.5"
    },
    "v0.2.6": {
      "created_at": "2024-06-16T01:51:46Z",
      "description": "This release contains a new generator apworld and game client. This release is only compatible with 0.5.0+ versions of Archipelago, including 0.5.0RC1.\r\n\r\n- Add 13 new Locations, corresponding to \"Capture Any 2..14\".\r\n  - This counter increments on either a piece OR pawn capture, rather than the min(piece,pawn) functionality of \"Capture 2..7 Of Each\".\r\n  - This was added to support increased Progressive Pawn Forwardness and so to add more filler items to the pool.\r\n- Add a warning in the ChessV client UI that \"YOU ARE IN CHECK\" under appropriate circumstances.\r\n- Add new Difficulty setting. This forces Locations into later spheres, as the player will need more material to retrieve those items.\r\n- Add new FairyChessPieceCollection setting. This is a simplified form of FairyChessPieces, allowing players to select which fairy chess pieces they want to select using a drop-down on UIs where the Collection is not available.\r\n  - This setting defaults to \"FIDE\", and overwrites the existing FairyChessPieces setting unless disabled by setting it to \"Configure\", which allows the FairyChessPieces setting to take precedence.\r\n- Remove Pocket-related filler items from the pool if no Progressive Pocket progression items were added to the item pool.\r\n  - This means the only filler item will be Progressive Pawn Forwardness.\r\n- Fix an issue during generation where chessmen-counting locations were occasionally unreachable under certain Pocket pool conditions.\r\n- Fix an issue with the True Fork locations where the fork would not be counted unless any other piece was also attacked from somewhere to the left of any of those pieces.\r\n- Merge about 200-500 commits from the Archipelago main branch into the generator.\r\n\r\nPlease note that APMW 0.5.0 includes breaking changes, so this apworld will only startup successfully on the beta site (http://archipelago.gg:24242/) until 0.5.0 is fully released.\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v0.2.5...v0.2.6",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2.6/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "8d13adb0a9e00a0a2e3167187af2f944301beef4befc3614530d7f56b1f0320c",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2.6",
      "size": 90725,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2.6",
      "title": "Client 0.2.6",
      "version_simple": "0.2.6",
      "world_version": "0.2.6"
    },
    "v0.2.7": {
      "created_at": "2024-07-03T03:08:07Z",
      "description": "This client adds a new mode and replaces some Location names. Do not connect to old rooms using this client.\r\n\r\n- Replace individual piece locations with their proper name, e.g. \"Capture Piece King's Bishop.\"\r\n- Increase game duration.\r\n- Fix certain pieces overwriting the location of other pieces during game load if extra kings are present.",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.2.7/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "7fe71f791e8b455ecafe0646f4fda1bd3def2888e4459dc673fa1876db9e2e50",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.2.7",
      "size": 93770,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.2.7",
      "title": "Client 0.2.7",
      "version_simple": "0.2.7",
      "world_version": "0.2.7"
    },
    "v0.3.0": {
      "created_at": "2025-05-24T23:02:46Z",
      "description": "This version breaks reverse compatibility with previous lobbies.\r\n\r\n- Breaking change: A useful item was renamed. A workaround is presented below.\r\n- New piece family: Jack. For when the Queen is too important to risk, but you need more power projection than a Rook!\r\n  - These completely fictional pieces are only enabled using the `AsymmetricTrades: jacks` Option, which defaults to `disabled`.\r\n- New feature: Enemy uses Different Armies. Face any of the fairy pieces among the Different Armies using the drop-down on the right!\r\n  - The majority of the pieces offered by early versions of this client were directly inspired by CwDA. I hope this will honor that inspiration.\r\n- Improved usability: \"Difficulty\" drop-down re-labeled to \"AI Intelligence\" drop-down. This should reduce confusion between the useful item received (same effect) and the YAML setting (affects logic).\r\n- Bug fix involving early reachability of Capture Everything during super mode.\r\n- Bug fix involving locked items being overpopulated when initial data structures are partially set.\r\n  - The author speculates that something involving the specification of the option may have been responsible for certain YAMLs seeing an overpopulation of filler items in their multiworld, but we can all be glad it's fixed.\r\n  - It's definitely never going to happen again for sure.\r\n- Bug fix involving jacks and castling. Castling benefits from this fix even without jacks.\r\n\r\nWorkaround: \r\n\r\n- When connecting to old lobbies, please set the \"difficulty\" drop-down to your preferred level of AI intelligence malus.\r\n\r\nOpen and new issues:\r\n\r\n- AI move paralysis crashes the game. While mitigated here and in a previous release, it's surely quite frustrating. Please share the Details drop-down to provide technical information when this happens. The issue doesn't seem to implicate any single feature. A future minor release will add additional debug information if this wave is insufficient.\r\n- Some goals may be impacted by the refactoring involved in the locked items fix. The automated tests don't seem to think anything is wrong... surely it's fine!\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v0.2.14...v0.3.0",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.3.0/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "9b1f5ca48b52d8d0eac2099225174f7073ed6a823d90035669257c5e813312aa",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.3.0",
      "size": 211892,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.3.0",
      "title": "Client 0.3.0",
      "version_simple": "0.3.0",
      "world_version": "0.3.0"
    },
    "v0.3.1": {
      "created_at": "2025-08-12T14:59:18Z",
      "description": "Resolve a breaking change introduced in a non-major version of a dependency.\r\n\r\n- Additional debug details regarding board position during a crash, especially involving piece types of moves under consideration.\r\n- Bug fix for Checkers generating too many moves during heuristic introspection. (Checkers may still be unstable.)\r\n- Bug fix for a long-standing issue involving the definition of the client version provided by the .NET library used to connect to Archipelago.\r\n  - Technically, this is a new feature, wherein the client checks the generator version and might demand that the user update their client.\r\n\r\nThe author advises library authors to obey semantic versioning. A simple heuristic to identify the cause of a breaking change follows.\r\n\r\n- Did something break?\r\n- Can a time of break be identified?\r\n- Did a change occur at that time?\r\n- Whose change was it?",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v0.3.1/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "04dfae6f87e3eaa24692a5dbf488cf5d8387e76f4419720a2248b21ef2b5f18b",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v0.3.1",
      "size": 208473,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v0.3.1",
      "title": "Client 0.3.1",
      "version_simple": "0.3.1",
      "world_version": "0.3.1"
    },
    "v2023.11.06": {
      "created_at": "2023-11-06T01:23:11Z",
      "description": "Prerelease. No crashes recently. Primary new feature is to turn your specific computer into a HE grenade.\r\n\r\n - Support connecting to local servers.",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v2023.11.06/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "2cdd76bae387369e0494d7c4150da8b7d57cdf94e3a71964c3be101742c1a97c",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v2023.11.06",
      "ignore": true,
      "prerelease": true,
      "size": 36973,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v2023.11.06",
      "title": "2023-11-06 Client",
      "version_simple": "2023",
      "world_version": "2023.post11"
    },
    "v2023.11.10": {
      "created_at": "2023-11-10T21:31:41Z",
      "description": "Brand new features means brand new fires. Try now and get 1 free burning video card, at the low price of 1 video card.\r\n\r\n - The Roman King setting adds Progressive Consul to your item pool. When you gain a Consul, you add an extra King piece. You lose when all of your Kings are captured.\r\n - The Fairy King setting adds Progressive King Upgrade to your item pool. When you gain a King Upgrade, your primary King (not Consuls) becomes a Mounted King and gains Knight movement. When you gain both King Upgrades, your primary King becomes a Hyper King and gains Nightrider (Knight slider) and Elephant (2x diagonal leaper) movement.\r\n - Possibly support DeathLink, but that's not really tested. It probably doesn't explode.\r\n - Made True Forks harder, but really True this time. Not only must your piece be safe, but none of the attacked pieces can be protected, or else it's not considered a true fork. (Sacrificial forks should be untouched.)\r\n - Fixed a rare bug involving the AI being really, really stupid and simply not choosing a move. This would end in a draw.",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v2023.11.10/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "d0b820d91140e912b56c127f4d4524028918c6cc70a6c462decc7d846dc5051b",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v2023.11.10",
      "ignore": true,
      "prerelease": true,
      "size": 38125,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v2023.11.10",
      "title": "2023-11-10 Client",
      "version_simple": "2023",
      "world_version": "2023.post11"
    },
    "v2023.11.13": {
      "created_at": "2023-11-13T21:01:27Z",
      "description": "Your family will rue the day you install this pre-release.\r\n\r\nAdded another setting, for people who want the AI to stay around 2000 ELO. I could probably support a more generic \"excluded items\" setting? I'm not sure how to do that, and I think it makes sense to have these as individual settings just because I want to have the mouseover \"quick tip\" on the settings page.\r\n\r\nFixed an issue involving how I load slot data via a certain async handler, which was not really that async.",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v2023.11.13/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "52608930afab63023a5cdbd1d5725d9d7c716da2efa8d93f8985e8065964a819",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v2023.11.13",
      "ignore": true,
      "prerelease": true,
      "size": 39394,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v2023.11.13",
      "title": "2023-11-13 Client",
      "version_simple": "2023",
      "world_version": "2023.post11"
    },
    "v2023.11.16": {
      "created_at": "2023-11-16T17:44:28Z",
      "description": "Injured by shrapnel from a pre-release? Who would download such a thing?\r\n\r\n- Fixed an issue with generation when queens and consuls and multiple major pieces would be generated on a single board.\r\n- Fixed an issue with generation involving many minor pieces on the same rank as consuls.\r\n- Fixed an issue where pocket pieces would not be available unless a duplicate of a board piece.\r\n- Fixed an issue with computer assessing checkmate against consuls. (The player doesn't actually use checkmate, but the AI was deceived into believing they themself had consuls. Sort of. It was a data structure issue.)\r\n- Improve True Fork and Royal Fork logic. (For example, Royal Forks no longer depend on a third piece being forked by the same piece somewhere left of the two royal pieces.)\r\n\r\nSeveral fixes involve Queen pieces, which are seldom to generate due to certain constraints on prerequisites.\r\n\r\nTODO: Further True Fork work involving piece material value. For now, constraints have been raised on generation, telling the logic that the AI really hates getting forked.",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v2023.11.16/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "b0b0547461a98ce65cbe1c98caeccbac8423a982cb6832a5416b462a9969002c",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v2023.11.16",
      "ignore": true,
      "prerelease": true,
      "size": 39815,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v2023.11.16",
      "title": "2023-11-16 Client",
      "version_simple": "2023",
      "world_version": "2023.post11"
    },
    "v2023.11.21": {
      "created_at": "2023-11-21T22:53:33Z",
      "description": "You really think someone would do that? Just go on the Internet and add crypto miners to open source releases?\r\n\r\n- Improve UI.\r\n- Support Castling locations.\r\n- Add new Options to limit maximum Pocket Pieces. May limit by total item count or by individual pocket destination.\r\n- Add new Option to guarantee a certain number of items, e.g. Progressive Pawns, exist in the pool. Likely to change implementation in the future.\r\n- Fix to add the proper number of Queens while user has additional Kings. (Previously lost 1 Queen per King found. No further commentary)\r\n- Fix to support Mounted King and Hyper King taking Bongcloud locations. (Previously a Mounted King was not a King and would not be considered to capture, reach back rank, etc)\r\n- Fix to send enemy Pawn captures when that Pawn promoted. (Previously could be difficult to achieve Capture Everything)\r\n- Allow AI to achieve victory by capturing using their King, even if it would put their King under attack.\r\n- Improve resilience to incorrectly populated SlotData. (This might not be a good thing)\r\n- Improve DeathLink handling (still not fully supported).\r\n- Documentation updates.\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v2023.11.16...v2023.11.21",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v2023.11.21/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "f942e43c3456360eec5a53b9cc1c5e127ac53543803ae315a878bcfb75b9ae30",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v2023.11.21",
      "ignore": true,
      "prerelease": true,
      "size": 43547,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v2023.11.21",
      "title": "2023-11-21 Client",
      "version_simple": "2023",
      "world_version": "2023.post11"
    },
    "v2023.11.25": {
      "created_at": "2023-11-25T16:03:26Z",
      "description": "The much-maligned crypto miners have been removed! They have been forced out by protective benign adware. Rejoice!\r\n\r\n- DeathLink support.\r\n- Cannot castle while involved pieces or squares are under attack.\r\n- Improve some AI reasoning involving outposts, open files, colorbound pieces, and some king-related tactics.\r\n- Improve randomizer logic's distribution of locations. Expectation of items will now be more uniformly distributed across a game's lifetime. In general, fewer locations are accessible early in logic - preferring breaking out of logic over mandating high-difficulty locations.\r\n- Fix notation of moves from a pocket in AI PV move list as well as FEN move history. (This is a fix to the standard client, not a fix of a newly introduced problem.)\r\n- Fix to re-establish AI as subject to checkmate after a previous fix involving player consuls.\r\n- Fix for specific counts of minor pieces when a second player king is present. (Also a fix based on a suspicion that huge quantities of major pieces may be an issue. Tests may be valuable.)\r\n\r\n**Full Changelog**: https://github.com/chesslogic/chessv/compare/v2023.11.21...v2023.11.25",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v2023.11.25/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "592ed805ea38f5ed176be0295764153eba1fe5216d3a04b6cce3118f4333a523",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v2023.11.25",
      "ignore": true,
      "prerelease": true,
      "size": 43785,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v2023.11.25",
      "title": "2023-11-25 Client",
      "version_simple": "2023",
      "world_version": "2023.post11"
    },
    "v2023.11.28": {
      "created_at": "2023-11-29T01:52:40Z",
      "description": "This release (requires AP 0.4.4) is very dangerous, but we are slowly containing the danger. Expect the lions to stay!\r\n\r\n- Fixed a piece set placement issue with multiple kings where various kinds of pieces (queens, majors, or minors, depending) would be omitted.\r\n- Fixed an issue where the generator would reduce your pool's material by up to 2500, depending on user settings regarding fairy pieces.\r\n- Fixed a crash issue involving the AI evaluating colorbound pocket pieces.\r\n- Improvement to item placement among generated locations by excluding some unreachable locations (currently based on material). This only happens for worlds with very little material.\r\n- Improvement to generator expedience in larger multiworlds by caching the material count as a prog_item in CollectionState.\r\n\r\nIn the future, more locations may be excluded based on chessmen count.\r\n\r\nAs an alternative to the current excluded_locations solution, the generator may need to guarantee location/item accessibility when that option is set, which may entail forcing many pawns into the item pool toward the end of generation. This would be accomplished by a function like `has_prereqs`. Alternatively, the locations can be removed entirely, which would hint to the player that there are few chessmen in their pool.",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v2023.11.28/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "dc1cd825fa712621c42738be5ee473b155f3b5f4cad3c7a809e4b01b882c8964",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v2023.11.28",
      "ignore": true,
      "prerelease": true,
      "size": 46447,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v2023.11.28",
      "title": "2023-11-28 Client",
      "version_simple": "2023",
      "world_version": "2023.post11"
    },
    "v2023.11.29": {
      "created_at": "2023-11-30T07:33:16Z",
      "description": "The brain-eating amoeba distributed by this package have been retargeted toward client CPUs. Hopefully the silicon proves a more resilient host.\r\n\r\n- Add new fairy chess pieces.\r\n- Fully support all permutations of FairyChessPieces, and properly limit selection among them using FairyChessArmy.\r\n  - FairyChessPieces is now an OptionSet. This allows for diverse permutations, but will not show up in the web UI.\r\n  - FairyChessArmy can be set to Limited to have the generator choose pieces from just one of the armies of FairyChessPieces you are willing to play. If you selected only one army of FairyChessPieces, the setting has no effect.\r\n  - An empty set of Fairy Chess Pieces enables only the FIDE pieces, while omitting the Fairy Chess Pieces option enables all pieces.\r\n- Fix for remove() method during generation, which should improve the reachability guarantee by not assuming huge amounts of material during late-stage generation balancing.\r\n- Infrastructure improvement: Added tests for various material states during generation.",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v2023.11.29/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "11bebb53ffb5175ecc1ca85671a2b8340de6818ee7949a5c46705f23b7510fed",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v2023.11.29",
      "ignore": true,
      "prerelease": true,
      "size": 46830,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v2023.11.29",
      "title": "2023-11-29 Client",
      "version_simple": "2023",
      "world_version": "2023.post11"
    },
    "v2023.12.01": {
      "created_at": "2023-12-02T01:19:56Z",
      "description": "There aren't any issues with this release, it's perfect in every way.\r\n\r\n- Improve True Fork logic to allow for material swing. (For example, a Pawn threatening two Knights is still a True Fork, even when defended.)\r\n- Add example YAMLs, with configurations that try to force specific experiences.\r\n- Fix for the True Fork location (it was equivalent to the Triple variant).\r\n- Fix for a crash involving one of the new (rare) fairy pieces.\r\n- Fix to account for material value of multiple copies of a given locked item.\r\n- Fix for a generator infinite loop under many excluded items and high material count.\r\n- Very minor changes to option defaults.",
      "download_url": "https://github.com/chesslogic/chessv/releases/download/v2023.12.01/checksmate.apworld",
      "has_manifest": false,
      "hash_sha256": "413a236a388a634a3334e748976a24f5e7e7209909dd5dab0551d4b3edcaf2b9",
      "html_url": "https://github.com/chesslogic/chessv/releases/tag/v2023.12.01",
      "ignore": true,
      "prerelease": true,
      "size": 48089,
      "source_url": "https://api.github.com/repos/chesslogic/chessv",
      "tag": "v2023.12.01",
      "title": "2023-12-01 Client",
      "version_simple": "2023",
      "world_version": "2023.post12"
    }
  }
}
