{
  "description": "Castlevania: Harmony of Dissonance is the second Metroidvania-style Castlevania released for the Game Boy Advance.\nAfter childhood friend Lydie is kidnapped away to a mysterious castle not on any map, Juste Belmont travels to\nthis new place with his best friend Maxim at his side. The two split up to search for Lydie, but it soon becomes\nclear that Maxim is not his normal self... Wield powerful sub-weapon spell fusions as Juste as you hunt for\nDracula's remains and unravel the conspiracy between two parallel castles.",
  "game": "Castlevania - Harmony of Dissonance",
  "github": "https://github.com/LiquidCat64/LiquidCatipelago",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "cvhodis_v1.0": {
      "created_at": "2025-04-01T19:28:59Z",
      "description": "Happy April Fools Day/Archipelago 0.6.0 Release Day/Switch 2 Direct Day/DK64 AP Release Day/Croc Remastered Release Day/Whatever Else May Be Happening, My Goodness There's A Lot(tm)! To commemorate Circle of the Moon finally being on the archipelago.gg website, what no better way to celebrate than with the grand debut of the *next* Castlevania game for the GBA for AP that I've been quietly working on in the background for the last month and a half or so! Yeah that's right, Harmony of Dissonance is now playable! For those still waiting patiently for the Legacy of Darkness full game apworld, don't worry, I haven't abandoned it; I just got...way more sidetracked than I want to admit, that's all.\r\n\r\nThis game is huge, and pretty open too! Just to give you an idea of what you can expect here, in my test run, I got Crushing Stone and Gryffin's Wing as my sphere 1 escape items and I wanna say that alone opened up...80-90 percent of the entire game? Yeah, it's quite something. I don't really know how much I can do about it other than implement ER, I guess. On the bright side, at least you can probably rest assured you'll never get stuck in a Burger King playing this game!\r\n\r\nThe options are pretty light right now, I was focused more on having a minimum viable product for the initial release of this. More stuff will come to this later, but the main things right now are you can choose goal send condition(s) to mix and match (including how many pieces of furniture you need) and DeathLink because it was actually quite simple for me to implement on top of everything I had already done. Other notable features you should probably know of while playing are: vague multiworld hints on Hint Card descriptions, JB's Bracelet being required to use the round warp gates (you don't start with it in this), and the ability to return to Entrance A by holding R while saving (which sets it as your spawn point next time you load your save). Anything else you can probably figure out on your own.\r\n\r\nNow that Archipelago's Generic Entrance Randomizer is actually finally in a stable release, it may now be time to play around with that...\r\n\r\nHave fun and let me know if you find any bugs! The README contains setup instructions and more information (no, you don't need the ROM to generate if you're not playing, if that's what you're wondering). This is the first release, and Harmony is a pretty big game, so there is probably bound to be something I missed somewhere...",
      "download_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/download/cvhodis_v1.0/cvhodis.apworld",
      "has_manifest": false,
      "hash_sha256": "fbf384f69c83b3f7c8e7818d565625ddffc6454ddd730c29941ae155c80eb22b",
      "html_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/tag/cvhodis_v1.0",
      "size": 67401,
      "source_url": "https://api.github.com/repos/LiquidCat64/LiquidCatipelago",
      "tag": "cvhodis_v1.0",
      "title": "CVHoDis apworld v1.0",
      "version_simple": "1.0",
      "world_version": "1.0"
    },
    "cvhodis_v1.1": {
      "created_at": "2025-04-01T19:28:59Z",
      "description": "Quick update with a few minor fixes and additions. Thanks to everyone who played and gave feedback!\r\n\r\nChanges:\r\n- Added a new option, Early Lizard. When enabled, your Lizard Tail will be forced *somewhere* in the multiworld's sphere 1, which should hopefully make needing to take the harder, scarier paths early on less likely.\r\n- You can now supply patches for the apworld to apply to the ROM before any of the AP rando patches are applied. To do this, make a folder in the root of your Archipelago installation named `cvhodis_user_patches`, put whatever patches you want applied in there (currently only the `.ips` format is supported), and patch the ROM with the `.apcvhodis` file like you normally would. You'll need to do this if you want to use the JonataGuitar and sorrow recolor patch, because for some reason it will try changing some items back to vanilla if you apply it to the AP rom after it's created (I haven't done a full AP run with it, so I still can't say how well it works beyond the opening areas).\r\n  - Moved the custom actor lists for most of the individual Castle A warp rooms to not overlap a hack the above patch makes.\r\n- Fixed the Luminous B Execution Elevator items not being changed to what they should be in the room's alternate post-elevator-ridden state.",
      "download_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/download/cvhodis_v1.1/cvhodis.apworld",
      "has_manifest": false,
      "hash_sha256": "482311414d0a55be4efc0215189bb854d459b3882b4f242ca63c59f8013c1bc2",
      "html_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/tag/cvhodis_v1.1",
      "size": 68480,
      "source_url": "https://api.github.com/repos/LiquidCat64/LiquidCatipelago",
      "tag": "cvhodis_v1.1",
      "title": "CVHoDis apworld v1.1",
      "version_simple": "1.1",
      "world_version": "1.1"
    },
    "cvhodis_v1.2": {
      "created_at": "2025-04-13T11:10:36Z",
      "description": "Another release with even more fixes and refinements! Once again, I would like to give a big thanks to everyone who has given feedback and reported bugs and logic mistakes and whatnot. You guys are awesome!\r\n\r\nNOTE: Patch files generated with an older version of the apworld will not be accepted by this one, and if you try to patch with an older version patch file using this version it will tell you of the version mismatch. I should've updated the identifier version in the last update when I relocated the custom decoupled warp room actor data, but I kinda forgot I had that capability to begin with, ooops. Better late than never, I guess!\r\n\r\nChanges:\r\n- Added a new option, `Spellbound Boss Logic`. When enabled, certain bosses that are considered \"medium\" or \"hard\" in difficulty will logically expect you to have spell books in order to get past them. More specifically, the \"medium\" bosses (Devil, Giant Merman, Max Slimer, Peeping Big, Legion (saint), and Shadow) will expect one book with the `normal` choice and two books with the `easy` choice, whereas the \"hard\" bosses (Pazuzu, Minotaur Lv2, Legion (corpse), Talos, Death, and Cyclops) will expect two books with the `normal` choice and three books with the `easy` choice. The rest of the bosses are all considered \"easy\" in difficulty and don't expect anything regardless of what's chosen. This has been a highly requested feature since the initial release of this apworld, and I am happy to be delivering on it now!\r\n- Your start inventory is now built into the ROM directly; it is no longer necessary to connect to the multiworld in order to receive it.\r\n- Replaced the second Lucky Charm in the multiworld item pool with a Steel Glove instead, the best arm accessory in the game. This Castlevania is one of the series' Four Horsemen of Practically Useless Luck Stats, you see...\r\n- Reclassified the Healing Mail to Useful instead of Filler; unlimited healing is still unlimited healing even if you have to wait around for it...\r\n- Fixed DeathLink seemingly ceasing to function if you load a savestate after being killed but before making it to the Game Over screen; the client will now see you as \"alive\" again if it notices you don't have 0 HP while it thinks you are \"dead\".\r\n- The map screen should now be in Castle A + B mode from the very start, and it should no longer revert to the starting gray version when using the warp to start feature.\r\n- Fixed logic associated with the following locations:\r\n  - `Room of Illusion A: Crawlspace to the Other World`: No longer always expects you to have Lizard Tail no matter what; you can reach this location by coming in from the Room A/Treasury B portal.\r\n  - `Shrine of the Apostates A: Lizard land storerooms - Left` and `Right` and `Shrine of the Apostates B: Bouncing bone zone coffin` and `above coffin`: These all no longer expect Lizard Tail. The only location in both Shrines that should is `Shrine of the Apostates A: Lower lizard crawlspace`.\r\n  - `Clock Tower A: Pinball zone end - Bottom-left`, `Top`, `Middle`, and `Bottom-right`: These now hard expect Sylph Feather specifically. The race is technically winnable with Griffin's Wing, but you have to be EXTREMELY lucky and persistent in order to do it. So, to be more reasonable for an average player, Griffin's Wing is no longer considered for this.\r\n  - `Entrance B: Secret skeletal passage - Upper`: Now properly expects Crushing Stone. I had this one in the wrong region, so up until this point it wasn't. Whoops!",
      "download_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/download/cvhodis_v1.2/cvhodis.apworld",
      "has_manifest": false,
      "hash_sha256": "f27bfd60d44e5686e5638d66699de07de05ab004da8a84bcef972746e2b0e439",
      "html_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/tag/cvhodis_v1.2",
      "size": 70438,
      "source_url": "https://api.github.com/repos/LiquidCat64/LiquidCatipelago",
      "tag": "cvhodis_v1.2",
      "title": "CVHoDis apworld v1.2",
      "version_simple": "1.2",
      "world_version": "1.2"
    },
    "cvhodis_v2.0": {
      "created_at": "2025-05-03T12:42:52Z",
      "description": "Well, this update is pretty significant if only for one reason: it contains the first entrance randomizer implementation for this particular rando! More specifically, it uses the General Entrance Randomizer (GER) that was merged and properly added to AP in it's 0.6.0 update and onwards. This thing is absolutely amazing and surprisingly easy to use, and I can't wait to add it to my other worlds one day! @BadMagic100 deserves a very special thanks for making it.\r\n\r\nEntrance Randomizer may be the main attraction here, but that doesn't mean there isn't other stuff worth drawing attention to as well. So with that said, let's roll the changelog:\r\n\r\n- Added the new `Entrance Randomizer` category of options. The options under this category at the moment are:\r\n  - `Area Shuffle`: Randomizes where every transition to a differently named area of the map leads to. The choices currently available are \"None\", \"Separate\", and \"Combined\". The difference between \"Separate\" and \"Combined\" is that the former will keep the Castle A and B transitions randomized separately in their own pools while the latter will allow them to be mixed together to create one massive creature of chaos! The spoiler log will contain which entrances are supposed to lead to where in case you get stuck.\r\n  - `Decouple Transitions`: Decouples transition entrances and exits from each other if `Area Shuffle` is enabled. Also known as \"Insanity ER\", this means going back through an area transition you just came through will not necessarily send you back to the same place that you came from...\r\n   - `Link Door Types`: Whether special door types should only be linked with each other (all skull doors link to other skull doors and all MK's Bracelet doors link to other MK's Bracelet doors).\r\n - In addition to all the ER stuff, the following options were added as well:\r\n   - `Castle Warp Condition`: You can now choose what you want the condition for being able to change castles at Warp Rooms to be; yes, you are not always forced into it being finding JB's Bracelet anymore! The currently available choices are:\r\n     - \"None\": No condition; the gates are all usable from the beginning.\r\n     - \"Bracelet\": The gates will unlock upon finding JB's Bracelet, which was previously the only available option.\r\n     - \"Death\": The gates will unlock after talking to Death at Clock Tower A like in the vanilla game. The cutscene with him here will be restored for this specific purpose.\r\n    - `Double Sided Warps`: If enabled, you will be allowed to change castles at a warp gate without having fulfilled the castle warp condition provided you have been to that particular warp room in both castles. This is purely for convenience and should not affect logic.\r\n- The game will now autosave after the intro Talos chase, so you won't have to go out of your way to save at a save room to enable the quick save feature. Trust me when I say using the warp-to-start feature will probably become *significantly* more important when playing Entrance Randomizer!\r\n- Added more stuff to slot data (including the ER connections) as well as more client set events which should help @Armipotent's map tracker for this apworld.\r\n- Fixed a logic error wherein Skeleton Cave B's left side exit was connecting to the bottom of Entrance A instead of B. Whoops!\r\n- Corrected the documentation for the Spellbound Boss Logic option, so it should name the correct choices everywhere (and how many books are required for which bosses with each option). Hopefully, there shouldn't be any more confusion here.\r\n- Updated the README with the new options, as well as a link to the after mentioned map tracker.\r\n\r\nNOTE: Patch files generated with an older version of the apworld will not be accepted by this one, and if you try to patch with an older version patch file using this version it will tell you of the version mismatch.\r\n\r\nI've playtested a few ER seeds fairly extensively, so there should hopefully be minimal logic errors here, if not none at all. But of course, if you do think you've managed to find an unbeatable seed, you'll know where to find me. In my opinion, I think this game's logic becomes significantly more interesting with ER involved; if you haven't yet, I highly recommend trying it! And for those wondering, more options like ensuring both castles' transitions are linked to their same equivalent areas will be added at a later time, after GER sees a few more improvements in a future AP release. So, stay tuned for that eventually!",
      "download_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/download/cvhodis_v2.0/cvhodis.apworld",
      "has_manifest": false,
      "hash_sha256": "d60a8ebd0fa0f1af67335609b2726973eae6be7c7a470e48e684f20cf95bd052",
      "html_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/tag/cvhodis_v2.0",
      "size": 82559,
      "source_url": "https://api.github.com/repos/LiquidCat64/LiquidCatipelago",
      "tag": "cvhodis_v2.0",
      "title": "CVHoDis apworld v2.0",
      "version_simple": "2.0",
      "world_version": "2.0"
    },
    "cvhodis_v2.0hotfix": {
      "created_at": "2025-05-25T09:20:25Z",
      "description": "It turned out there were a couple noteworthy bugs with the last release, sooooo...hotfix release, GO:\r\n\r\n- Cyclops and Pazuzu's boss kill flags should now be communicated to the map tracker properly. Before I was checking for the wrong flags, so uh, oops.\r\n- Fixed the warp room portals not working as intended with the Castle Warp Condition option set to None. If you are currently playing a multi with this option choice, reapply your `.apcvhodis` patch with this apworld and you should get a fixed ROM without losing your current progress.\r\n\r\nJust as an aside, if you ever enter a round gate warp room and the gate spawns already open with Death nowhere in sight, then this is unintended behavior, and it should be reported. The vanilla game has the gates spawn like this until you've met Death at Clock Tower which properly enables them (for the sake of said cutscene's behavior), but they need to be in their closed state in order to warp by pressing down, so I altered their behavior heavily for this.",
      "download_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/download/cvhodis_v2.0hotfix/cvhodis.apworld",
      "has_manifest": false,
      "hash_sha256": "11dc53479aa7abd3eea99a1974c04ec0194b5eebd4416f741804a7a03a4cf0ff",
      "html_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/tag/cvhodis_v2.0hotfix",
      "size": 86145,
      "source_url": "https://api.github.com/repos/LiquidCat64/LiquidCatipelago",
      "tag": "cvhodis_v2.0hotfix",
      "title": "CVHoDis apworld v2.0 hotfix",
      "version_simple": "2.0",
      "world_version": "2.0"
    }
  }
}
