{
  "description": "Castlevania: Legacy of Darkness is an expanded \"director's cut\" edition of Castlevania 64, featuring new characters,\nnew and heavily altered stages, new bosses, and more. In addition to Reinhardt and Carrie from the prior game, you\ncan now play as Cornell, a man-beast who sets out on a quest to rescue his sister, and Henry, a gun-toting knight\ntasked by the church to rescue kidnapped children.",
  "game": "Castlevania - Legacy of Darkness",
  "github": "https://github.com/LiquidCat64/LiquidCatipelago",
  "license": null,
  "manifest_fields": [
    "authors",
    "minimum_ap_version",
    "world_version"
  ],
  "versions": {
    "cvlod_v1.0": {
      "created_at": "2026-02-08T17:39:49Z",
      "description": "It has been too long since the last time I posted an apworld here on this release page, but yes! After many, MANY consecutive months of pretty much nonstop locking in during the little (much less than I used to) free time that I have these days, the first full release of the Castlevania: Legacy of Darkness apworld is finally, FINALLY ready! Yes, no more of this two-stage demo business that it was before, the full game (all stages) is now implemented!\r\n\r\nAnd what's more, a good chunk of the options that the CV64 AP has are already implemented in this first release, including all extra breakables; most quality-of-life things like the countdown number, previous subweapon droppping, permanent powerups, etc.; DeathLink (including the explosive variety!); and more! I also went to the effort of giving you a lot, lot more control over which stages are included in your runs this time, basically being able to add/drop any specific ones. You'll just have to see the options yourself, there is a lot.\r\n\r\nDo note that not EVERY option from CV64 is implemented right now. The big things right now are shopsanity, ice traps, the panther dash, music/lighting randomizer, item pool difficulties, and big toss. I would like to add all of these things eventually, though it's probably going to take a while longer yet to get there. Still though, with how much I *did* manage to bring over from it already, I hope people will be satisfied for a while! The wait for this was worth it, I promise!\r\n\r\nA very special thanks to @moisesPC for the [CVLoD Extended Stage Select mod](https://github.com/moisesPC/cv64_extendedStageSelect) that I heavily modified to make the new warp menu in this AP, and to the few people who partook in the test sync I ran (a few more bugs got caught and fixed because of that)! As with all my other apworld releases, instructions are in the README. Also included is a new obscure checks document that I took the time to make specifically for this game, similar to the CV64 one. Have fun and let me know if you run into any bugs! Being a very new AP release, and with how much stuff there is in this one, there's probably bound to be something somewhere...\r\n\r\nDue to the, uhhhhh, funny timing in which I happen to be dropping this, I guess I feel obligated to also say happy 40th anniversary Castlevania, huh? Maybe we'll get THIS game and CV64 in a collection one of these days, who knows...? Also, it's Friday the 13th when I drop this, the perfect time to be playing a randomizer of a game featuring a guy with a chainsaw chasing you around, isn't it? Heh!\r\n\r\nUpdate: Had to put out a hotfix already! Please see the Releases page for the most up-to-date version.",
      "download_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/download/cvlod_v1.0/cvlod.apworld",
      "has_manifest": true,
      "hash_sha256": "ea4748810fbb93002ca5140a0a87ee693efd8e3797ef55cecbd62ad55af38d60",
      "html_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/tag/cvlod_v1.0",
      "minimum_ap_version": "0.6.3",
      "size": 208937,
      "source_url": "https://api.github.com/repos/LiquidCat64/LiquidCatipelago",
      "tag": "cvlod_v1.0",
      "title": "CVLoD apworld v1.0",
      "version_simple": "0.1.0",
      "world_version": "0.1.0"
    },
    "cvlod_v1.0hotfix": {
      "created_at": "2026-02-08T17:39:49Z",
      "description": "Day two hotfix update already, because surprise, surprise, bugs there certainly were! How many more of these am I going to end up putting out in the next week or two, I wonder?\r\n\r\nThe following things were addressed:\r\n- Fixed the warp menu crashing when entering it on Hard Mode if Special1s Per Warp was higher than 2. Don't ask...\r\n- Fixed a logic oversight that expected you to be able to go from the rear side of the Maze Garden to the front (this is impossible with the Villa State on Cornell or Hybrid).\r\n- Fixed the location Tower of Ruins: Labyrinth Room B6 Left Statue not spawning if you picked up Tower of Science: Cube Factory Second Corner first. Yeah, fun fact: the three invisible items in this map are all normally configured to not spawn if certain Tower of Science pickup flags are set, and this particular one I forgot to remove.\r\n- Fixed Mary's dialogue that tells you what item she has turning ALL the gameplay textbox text yellow after the item name if it's a local progression item.\r\n- Added the Castle Center Maids Vase location to the list of freestanding item locations to slightly lower down if a Cross, Axe, or Cornell quest item lands there. You could technically grab these here before, but it required you to awkwardly jump onto the vase (which could especially cause confusion if the item is invisible).\r\n\r\nA very special thanks to BMS for reporting all of these!",
      "download_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/download/cvlod_v1.0hotfix/cvlod.apworld",
      "has_manifest": true,
      "hash_sha256": "eec23eb20de8265c44120729912f8c5f85412a570ed9e6fd44699b77c013790c",
      "html_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/tag/cvlod_v1.0hotfix",
      "minimum_ap_version": "0.6.3",
      "size": 208955,
      "source_url": "https://api.github.com/repos/LiquidCat64/LiquidCatipelago",
      "tag": "cvlod_v1.0hotfix",
      "title": "CVLoD apworld v1.0 hotfix",
      "version_simple": "0.1.0",
      "world_version": "0.1.0"
    },
    "cvlodbijcw&v_v1": {
      "created_at": "2024-01-31T20:07:07Z",
      "description": "At long last, it is finally here! Yeah, that's right, it's the long-awaited sequel to [OoTBIJMQWT](https://github.com/Alchav/ootbijmqwt) that no one asked for: Castlevania Legacy of Darkness But It's Just Castle Wall & Villa!\r\n\r\nFor this first version of LoD rando, I decided to take a different approach from what I did with CV64 by focusing on getting much of the big features working in a small portion of the game first and then adding the rest of the stages and locations later, rather than randomizing the entire game first and then adding on features after that. A major challenge that I have to face with Legacy that I did not need to worry about so much with CV64 is jus the sheer amount of character and difficulty-specific things there are this time around that, in order to make the game work in a randomizer-friendly context without forcing the player to use any one specific character and difficulty combination, I need to make universal. Which extends not just to map actor instances, but even hardcoded checks in some overlays for specific characters! I could go on about how much fun I had getting the child Henry escort sequence to work for everyone, for instance... Villa I daresay has the absolute most of these by far, so hopefully the rest of the stages will be downhill to add from here.\r\n\r\nSome things you should know before playing:\r\n\r\n-The US version of LoD is the one you need to play this. LoD cartridges are way more expensive than CV64s, but thankfully there are no revisions, so any clean US version you can get your hands on *should* work. The md5 is 25258460f98f567497b24844abe3a05b.\r\n\r\n-Pressing Z + R + START will always send you to your start location initially, but once you get the single Special1 placed in the pool the combo will, every other time you press it, send you to the Villa storeroom instead. The fancy warp menu from the CV64 implementation is not implemented here (yet), so for now, we'll make do with this quick and dirty solution.\r\n\r\n-The Villa fountain pillar is on its Cornell behavior for everyone, but with a twist: the order of tombstone buttons to press is randomized! To learn the new combination, find the Oldrey's Diary item (this is an unused item in vanilla LoD, fun fact) and check its pause menu description for four letters. Each letter corresponds to a specific tombstone, and you must press the tombstone buttons from left to right in the order shown in the description:\r\nO: Or De Rais\r\nM: Mary\r\nH: Henry\r\nV: Visitor (the one that's too damaged to read)\r\nThere are 24 possible combinations and you can try to bruteforce it if you want, but just know that the logic expects you to find Oldrey's Diary before you can get onto the fountain.\r\n\r\n-To enter the Maze Garden through the main OR the servant entrance gate, you will need to find the Garden Key. Once you unlock one gate, the other will unlock as well. This is something I implemented in CV64 as well to make the logic more interesting, but I thought I'd mention it here because you are far more likely to see it with the servant door unlocked from the get-go. That, and it goes along with the next point that IS specific to LoD...\r\n\r\n-The two doors in the Maze that divide the front and the rear of it are locked by the Rose Garden Key (a key specific to Cornell's version of the stage that normally locks the door between the Foyer and the Rose Garden), and once you unlock one door all three Rose Garden Key doors in the game will unlock at the same time. Between this and the regular Garden Key locks, the entire Villa stage is essentially split into four main logical \"quadrants\" that you may or may not have access to depending on what you currently have when you get there.\r\n\r\n-Child Henry is the kid to rescue in the maze for all characters, not Malus. In the future I plan to let you pick between the two when generating a seed, but for now this is how it is. To be able to start the escort sequence, you must talk to Mary first in the mirror room adjacent to the bedroom. She will tell you what item is at stake for rescuing Henry and what player it's for, so you can then decide if the kid is worth saving or not. If you start the escort and decide you want to get out of it without finishing it (and you may have to if you never got the Rose Garden Key), just Z + R + START warp out. There's an issue I'll have to address wherein the \"jaws theme\" instrument in the Maze Garden B song continues playing, but everything functions as it should and you can restart the escort by going back to the starting point of it.\r\n\r\n-Everything else I didn't mention about Castle Wall and Villa so far is in a combination of both its Cornell and Reinhardt/Carrie states. This means you will need both the Left Tower Key and Winch Lever to reach the Castle Wall exit normally, both the 3am Rosa meeting and 6am Thorn Key rose patch are present in the Rose Garden, you will encounter vampire Oldrey, Mary, and Vincent in the bedroom area, etc. Locking the maze doors with the Rose Garden Key I figured would be a good compromise between having to choose between making said doors open one way or the other.\r\n\r\n-Your goal in this is to make it to the end of Villa, defeat the bosses there, and trigger the \"Found a hidden path\" cutscene. Doing this entails finding the Copper Key and both Crest Halves to get into the crypt. Once the flag for that cutscene is set, the goal will send. You *can* jump into the coffin and play the next stage if you want, and I set the loading zone up to have its Henry time of day behavior for everyone, but there's hardly any point to because I have not made any changes to said post-Villa stages whatsoever. Don't expect everything to work properly if you are not the intended character for the stage.\r\n\r\n-The settings you see in the Cornell YAML are what I currently have tested and working. The Countdown number in particular is a bit more advanced than the CV64 one, actually changing colors this time; it will start off green initally, and once its no longer its starting value it will turn light brown, and then dark brown once it hits 00.\r\n\r\n-AP off-world items will appear as spinning contracts for now. This will change if/when we get the AP icons from CV64 working in this game some day, which we haven't as-of-yet.\r\n\r\nKNOWN ISSUES:\r\n-Z + R + START warping during the child Henry escort sequence causes the \"jaws theme\" instrument in the Maze Garden B song to continue playing. I will fix this later.\r\n-Warping during either the second or third vampire fight in the Villa crypt can potentially cause the \"found a hidden path\" cutscene to become un-triggerable. I'll prevent warping during boss fights later, but for now, I'll have to ask you please don't do that!\r\n-If you access the end of Castle Wall by orb sniping the dogs through the gate (a trick accounted for in Hard Logic) and then go back through the loading zone, the Villa stage intro cutscene will play and the gate will close with no way to re-open it since the dogs are dead. Again, I will address this later, but try not to screw yourself out of beating the seed if there's something essential in that end part of Castle Wall!\r\n-On the character select screen, on Bizhawk specifcally, on lo-res mode, the character selector does not show the currently-selected character behind it properly. It's a Bizhawk problem with the game in general, it happens with the vanilla ROM, and AFAIK there's nothing I can do about it beyond reporting the issue which [I did](https://github.com/TASEmulators/BizHawk/issues/3671). So we'll just have to deal with this one...\r\n\r\nIf you run into any problems not listed there, let me know in the Archipelago or CV64&LoDSpeedruns Discord and I'll address it. The setup is the same as with my CV64 apworld, so read up on it in its README if you aren't familiar with it.\r\n\r\nYes, multiworld works in this initial playable version! No waiting a whole entire year for that like with CV64! :)",
      "download_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/download/cvlodbijcw%26v_v1/cvlod.apworld",
      "has_manifest": false,
      "hash_sha256": "3978f5f4a78f34af6b01504c394b65c4f961453b030c700f0c3c04c52d771b65",
      "html_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/tag/cvlodbijcw%26v_v1",
      "size": 91528,
      "source_url": "https://api.github.com/repos/LiquidCat64/LiquidCatipelago",
      "tag": "cvlodbijcw&v_v1",
      "title": "CVLoDBIJCW&V v1",
      "version_simple": "1",
      "world_version": "1"
    },
    "cvlodbijcw&v_v2": {
      "created_at": "2024-05-20T07:04:06Z",
      "description": "Castlevania: Legacy of Darkness But It's Just Castle Wall & Villa! The second!\r\n\r\nAt long last, I am finally back to working on Legacy of Darkness randomizer development! And what no better way to celebrate than with a relatively minor update to the existing .apworld?\r\n\r\nBecause my primary focus for this one was to update the codebase to be closer to present day CV64's after it made it through its entire review process, functionally, not much has changed in the grand scheme of things. But there are a few things y'all may appreciate:\r\n-Added a dash in the Game Name, bringing it more in-line with how Castlevania - Circle of the Moon is named in its implementation.\r\n-Now uses AP Procedure Patch. So now you can bring this into your short OoTBIJMQWT syncs without bugging the host to drop 100+ dollars on a very not-cheap cartridge!\r\n-Fixed the \"jaws instrument\" from the Henry escort song continuing to play when you warp out of said sequence.\r\n-Fixed a game crash that could happen when you die while having items queued up for receival.\r\n\r\nBecause the apworld's underlying code has changed drastically, there may be new bugs present that were not in the first release, particularly on the generator or client side. Keep an eye out and report any you encounter!\r\n\r\nI may have the rest of the stages added now before you know it...",
      "download_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/download/cvlodbijcw%26v_v2/cvlod.apworld",
      "has_manifest": false,
      "hash_sha256": "f9338d296156f8b98f15491e8fe4d206ec4cb4c600e5cfd26d097f567921e225",
      "html_url": "https://github.com/LiquidCat64/LiquidCatipelago/releases/tag/cvlodbijcw%26v_v2",
      "size": 97343,
      "source_url": "https://api.github.com/repos/LiquidCat64/LiquidCatipelago",
      "tag": "cvlodbijcw&v_v2",
      "title": "CVLoDBIJCW&V v2",
      "version_simple": "2",
      "world_version": "2"
    }
  }
}
