{
  "description": "Frogmonster.",
  "game": "Frogmonster",
  "github": "https://github.com/Rooby-Roo/FrogmonsterAPWorld",
  "license": "MIT",
  "manifest_fields": [
    "authors",
    "minimum_ap_version",
    "world_version"
  ],
  "versions": {
    "v0.1.0": {
      "created_at": "2025-03-17T16:18:47Z",
      "description": "The first public release of Frogmonster for Archipelago!\r\n\r\nIt's got a few rough edges, and the combat logic _definitely_ will need an overhaul at some point, but you can play it!\r\n\r\nPlease report any logic concerns, incompatibilities, or feature requests either on this repositories in the Issues tab, or by messaging me on Discord. You can find me in both the Archipelago main discord as well as the Frogmonster discord.",
      "download_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/download/v0.1.0/frogmonster.apworld",
      "has_manifest": false,
      "hash_sha256": "90259b04f5236280970a144718f111f523e0d5bd7c4600dd223c8216652d8443",
      "html_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/tag/v0.1.0",
      "size": 79872,
      "source_url": "https://api.github.com/repos/Rooby-Roo/FrogmonsterAPWorld",
      "tag": "v0.1.0",
      "title": "Frogmonster v0.1.0",
      "version_simple": "0.1.0",
      "world_version": "0.1.0"
    },
    "v0.1.1": {
      "created_at": "2025-03-19T19:04:19Z",
      "description": "# PLEASE USE v0.1.2 INSTEAD. THIS ONE HAS A CRITICAL LOGIC BUG.\r\n\r\nA lot of quick patches to make everything a little more sensible.\r\n\r\n**Use this APWorld with Client Version 0.1.0.**\r\n\r\n- Additional item aliases: You can now hint for Sticky Hands as \"wall grab\" and Tongue Swing as \"grapple\", as well as some common typings for the myzand gun upgrades.\r\n- The check named \"Yellow Forest: River\" now has a more descriptive name, and its access rules were changed to be more accurate.\r\n- The Purple Bosses (Mud, Borp, Balsam) are now no longer excluded by default, to coincide with a change to the client that makes them easier to access.\r\n- The Death Bug checks (Soul Frog, Soul Fish) now logically expect access to City when Deathlink is enabled, so you're never obligated to die in a Deathlink to get a check.\r\n- Logic for Sticky Hands check has been adjusted to account for the fact that you can access it without fighting The Long Beast by means of the portal vine.\r\n- All checks in The Well now require Fire Fruit Juicer by default. Re-lighting torches with fireball or Hot Gun did not seem feasible.\r\n- Turtle's access logic corrected - you can find it in the Yellow Forest Town fishing bay.\r\n- Removed a combat arena in Green Sea that doesn't exist.",
      "download_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/download/v0.1.1/frogmonster.apworld",
      "has_manifest": false,
      "hash_sha256": "f2655f5515d6091c0b415103decd9254680a6514bf0af89b6ea23cf5673eef3c",
      "html_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/tag/v0.1.1",
      "size": 81725,
      "source_url": "https://api.github.com/repos/Rooby-Roo/FrogmonsterAPWorld",
      "tag": "v0.1.1",
      "title": "Frogmonster v0.1.1",
      "version_simple": "0.1.1",
      "world_version": "0.1.1"
    },
    "v0.1.2": {
      "created_at": "2025-03-19T19:04:19Z",
      "description": "This fixes an issue with v.0.1.1 where the purple bosses were not correctly giving access requirements, and as such could be considered in logic before their prior bosses were defeated, or well before you have the capacity to beat them.\r\n\r\nNo patch notes, it's just the one fix.",
      "download_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/download/v0.1.2/frogmonster.apworld",
      "has_manifest": false,
      "hash_sha256": "0a618778aa869f7ad20c868ba2f1c7743dcdeb18efa7157dc0f02301b60e6742",
      "html_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/tag/v0.1.2",
      "size": 81948,
      "source_url": "https://api.github.com/repos/Rooby-Roo/FrogmonsterAPWorld",
      "tag": "v0.1.2",
      "title": "Frogmonster v0.1.2",
      "version_simple": "0.1.2",
      "world_version": "0.1.2"
    },
    "v0.1.3": {
      "created_at": "2025-03-28T21:52:47Z",
      "description": "v0.1.3\r\n\r\n**Please use this with version 0.1.0 of the client.**\r\n\r\n**Feature Changes:**\r\n- New option: `well_light_logic`: Users can choose whether the game expects them to have glowbug, fire fruit juicer, or both, while descending the well.\r\n- A WebWorld now exists! If you don't know what this is, don't worry about it; it doesn't impact you.\r\n\r\n**Logic Changes:**\r\n- Chroma now expects Dash at all currently existing difficulty levels. Previous versions of the logic would allow some scenarios without Dash at Hard difficulty, but this is proving too difficult to abstract at the moment.\r\n- Old Wood: After Jumper Arena is now called \"Old Wood: After Gorilla Arena\" and now expects dash, as it's not otherwise possible to cross the spike pit gap without tanking damage.\r\n- Thickness as a whole has been classified as harder, and will now expect more items on average to clear it. Those birds suck!\r\n\r\n**Bug Fixes:**\r\n- Green Sea: Underwater Webs chest now will correctly check whether you have access to gun upgrades when considering Fire Fruit Juicer or Gatling Gun as web-burning tools.\r\n- Well: Eighth Floor has been renamed to \"Well: Seventh Floor\" to account for my inability to count to ten.\r\n- Fixed an issue where Wren's Shop (Key) and a chest in Thickness would accidentally send each other's locations when checked.\r\n- The connection from Old Wood to Well now correctly checks if you have the ability to burn webs. This hasn't mattered, as there's currently no ways to get INTO Old Wood without burning webs, but it's future-proofing if I want to handle web skips or something.",
      "download_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/download/v0.1.3/frogmonster.apworld",
      "has_manifest": false,
      "hash_sha256": "5f9bae335b016a0feab227b5b81c03f495104b84a6cb1ff7e5a071d1b917dfab",
      "html_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/tag/v0.1.3",
      "size": 133601,
      "source_url": "https://api.github.com/repos/Rooby-Roo/FrogmonsterAPWorld",
      "tag": "v0.1.3",
      "title": "Frogmonster v0.1.3",
      "version_simple": "0.1.3",
      "world_version": "0.1.3"
    },
    "v0.1.4": {
      "created_at": "2025-05-23T22:15:28Z",
      "description": "v0.1.4\r\n\r\n**New Features:**\r\n- **Music Update!** All features that came with the \"Music Update\" of the base game are now implemented into the client. Well, they have been for a while, but I figured I'd announce it here for anyone who's been out of the loop.\r\n- **Option: Hardcore Parkour!** Turning this on adjusts the logic to allow for some trickier movement with Cricket, Mushbomb, wavedashing, or just smart jumping. The current list of tricks if _far_ from comprehensive, so if you have any movement you'd like to see potentially get added, **feel free to send me a clip!** I'm not creative enough with Mushbomb and I've kept bad notes from tricks I've been sent in the past.\r\nThe current list of tricks is:\r\n\t- Forest Floor to Treetops with Mushbomb (no Tongue Swing)\r\n\t- Hive to Treetops with Dash (no Tongue Swing)\r\n\t- Forest Floor: Swinging Above the Toro Arena with Sticky Hands, Dash, and Cricket (no Tongue Swing)\r\n\t- Marvin's Domain: Poison Cloud Arena Upper Level with Nothing (No Dash)\r\n\t- Yellow Forest: Above Chrom with Nothing (No Dash)\r\n\r\nBug Fixes:\r\n- Myzand 1 now logically requires Tongue Swing and Sticky Hands (to beat Barge form). Prior to the above parkour option, it was not possible to get to Ridge without these, so it wasn't an issue until now.\r\n\r\nName Changes:\r\n- \"Very Lost Swamp: Outskirts Entrance\" has been renamed to \"Very Lost Swamp: Near Fishanny\" to make the detour clearer.\r\n- The Bow and Gat locations are now named \"Very Lost Swamp: Supo's Weepwood Bow\" and \"Cicada Cove: Supo's Gatling Gun\". Previous versions of these locations were ambiguous, and for now, keeping Supo alive has to be logically presumed, so we're gonna stick with it for now.\r\n- All bug-catching locations are now named \"Catch:\" to make things more transparent and to make the webtracker a bit more organized.\r\n- \"Axolotyl\" has been renamed \"Axolotl\" (on both name and location) to coincide with a long-overdue typo fix that came with the music update.\r\n\r\nOther Changes:\r\n- The \"Post-Ridge\" location group now accurately identifies ridge-exclusive bugs (Tang, Mushroom, Mite, Axolotl) as belonging to them, making them easier to exclude (or prioritize).\r\n- Some additional code cleanup to make my job easier down the line.",
      "download_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/download/v0.1.4/frogmonster.apworld",
      "has_manifest": false,
      "hash_sha256": "8c45e56e55a46c25c16158b56820471f1560589e2f9496df7f547cc0c0ec6310",
      "html_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/tag/v0.1.4",
      "size": 87810,
      "source_url": "https://api.github.com/repos/Rooby-Roo/FrogmonsterAPWorld",
      "tag": "v0.1.4",
      "title": "Frogmonster v0.1.4",
      "version_simple": "0.1.4",
      "world_version": "0.1.4"
    },
    "v0.2.0": {
      "created_at": "2025-08-18T19:53:32Z",
      "description": "_APWorld version v0.2.0, built from [commit 0f46399](https://github.com/Rooby-Roo/Archipelago/commit/0f463999a22b8b75fce8a068198726dadc8e338e)._\r\n\r\n### **New Features:**\r\n\r\n- **Workshop Key Shuffle!** The Workshop Key is now available as a randomized item/location. The Workshop Key gives you the ability to use the upgrade machine in Bins' Workshop. The associated location is called \"Bins' Workshop: Gift from Bins\" and is obtained when talking to Bins after killing Xoto. As a quality of life feature, an option is present that gives you the ability to choose whether or not this item is shuffled, left in its vanilla location, or placed in your starting inventory.\r\n- **Orchus Key Shuffle!** The green key that Bins gives you after defeating Runi is now available as a randomized item/location pair. The location is called \"Ridge: Gift from Bins\". The key opens the door in Under City that leads to Barge, potentially allowing earlier access to Ridge and the associated late-game regions without having to climb Treetops, reach the Orchus Tree, and defeat Runi.\r\n\r\n### **Client Changes:**\r\n\r\n- The **client version number** has been updated! It now works when connecting to AP games generated on versions 0.6.2 and 0.6.3, which would reject the older version.\r\n- **Deathlink messages** now are less broken when being sent to or received from other non-Frogmonster games. Additionally, you should no longer get stale messages from earlier deathlinks when dying on your own.\r\n- **Added more ASCII** characters, including numbers and basic punctuation and math symbols, allowing some offworld item names to display better.\r\n- **Fixed a bug** where sometimes the popup message for found items would accidentally display an item from the wrong game.\r\n- **Fixed a bug**, namely, the Mushroom, from behaving incorrectly when the shuffled bug effects option is enabled.\r\nAll of the above changes were done by Frogmonster dev Ben. Big thank you for all of his work in getting this client up and running! Frogmonster Archipelago would not be possible without his help.\r\n\r\n### **APWorld Changes:**\r\n- The spoiler log now correctly displays which bug effects are shuffled into which bugs. Curse you, off-by-one errors!\r\n- The logic backend for Moridono's Domain has been completely reworked. Now that you can access Ridge very early, it needed to be tidied up and written in a way that was coherent with how that maze of a map is actually structured.\r\n- The regioning surrounding the area of the Runi fight was also reworked, to account for the fact that you can now reach the 6-Eye Door without ever actually fighting Runi.\r\n- The item classification of most bugs have been changed to _progression skip-balancing deprioritized_, to account for their generally limited utility, and recognizing that their status as such. A handful of bugs with specific logical implications, such as Bass, Mushfrog, Cicada, and Glowbug, do not have these tags and are instead full progression items. A handful of other utility upgrades, such as health and mana shards, are also _deprioritized_.\r\n- The chest in the Fog Garden Key area had its logic fixed to correctly account for its placement behind that gate.\r\n- The APWorld now has an internal version number that matches the release version (in this case, 0.2.0). Anyone unafraid to look at python code can now access this information. I'm going to set it up to print to the spoiler log in the future for debug purposes.\r\n- Some documentation and definitions have been changed for clarity.",
      "download_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/download/v0.2.0/frogmonster.apworld",
      "has_manifest": false,
      "hash_sha256": "cdfb47d69966ccf9f92545c8e63ae652e81c4ea7927ae248c8f648716c662616",
      "html_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/tag/v0.2.0",
      "size": 89409,
      "source_url": "https://api.github.com/repos/Rooby-Roo/FrogmonsterAPWorld",
      "tag": "v0.2.0",
      "title": "Frogmonster v0.2.0",
      "version_simple": "0.2.0",
      "world_version": "0.2.0"
    },
    "v0.2.1": {
      "created_at": "2025-08-20T04:05:25Z",
      "download_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/download/v0.2.1/frogmonster.apworld",
      "hash_sha256": "621ef5c2679a26987a4680eaf1cf76e07749518af2d8cb3fd1d00b96bd6c9f77",
      "size": 145914,
      "source_url": "https://api.github.com/repos/Rooby-Roo/FrogmonsterAPWorld",
      "tag": "v0.2.1",
      "title": "Frogmonster v0.2.1",
      "version_simple": "0.2.1",
      "world_version": "0.2.1"
    },
    "v0.2.1r2": {
      "created_at": "2025-08-20T04:05:25Z",
      "description": "_APWorld version 0.2.1-hotfix1, built from release [681045a](https://github.com/Rooby-Roo/Archipelago/commit/681045a60ac14c2759a0eb32f09ca92ccba0f8c2)._\r\n\r\nJust a couple of hotfixes found in yesterday's beta test sync!\r\n\r\n- Hardcore Parkour now expects you to be able to reach Cicada Cove in addition to Treetops using the Hive dash skip.\r\n- Old Wood to Thickness/Well area now always expects dash. No more tanking damage from thorn segments!\r\n- Treetops Key room now correctly expects you to have Tongue Swing.",
      "download_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/download/v0.2.1/frogmonster.apworld",
      "has_manifest": false,
      "hash_sha256": "dc57b6e4b38a1c5533f43fec7a5e492e30065f1495e2baa43a9ef04111c2fac9",
      "html_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/tag/v0.2.1",
      "size": 146225,
      "source_url": "https://api.github.com/repos/Rooby-Roo/FrogmonsterAPWorld",
      "tag": "v0.2.1r2",
      "title": "Frogmonster v0.2.1",
      "version_simple": "0.2.1",
      "world_version": "0.2.1.post2"
    },
    "v0.2.2": {
      "created_at": "2026-01-05T16:40:03Z",
      "description": "_APWorld version 0.2.2, built from commit [0f78cda](https://github.com/ScipioWright/Archipelago-SW/commit/0f78cdaca64f09beeb4ee13cc49cf9db8408d659)._\r\n\r\nNothing too exciting overall, but I had a handful of small changes that had been sitting on the branch for a bit, and I figured I'd push them out.\r\n\r\n- Several items now carry both \"Progression\" and \"Useful\" flags, allowing them to appear extra-important in some clients. This includes all guns and myzand upgrades, all major movement options, and the Workshop and Orchus keys.\r\n- Fixed the Pecker access rules in the Moridono's area.\r\n- The default option for well_light_logic has been changed to glowbug instead of FFJ.\r\n- Cricket and Dash together can now be used as a logical alternative to Tongue Swing in the Moridono's spike pit.\r\n- Added a manifest file, ensuring world compatibility with 0.7.0 and future AP releases.\r\n- Webworld documents and world docstrings have been rewritten. If you're hosting Frogmonster on a website somewhere, the instructions on the page will now make a lot more sense for your use case.",
      "download_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/download/v0.2.2/frogmonster.apworld",
      "has_manifest": true,
      "hash_sha256": "5043181bb42aa6794cff7868af2503edd35a85e7277722ee83e1893d9c0ddb79",
      "html_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/tag/v0.2.2",
      "minimum_ap_version": "0.6.5",
      "size": 28316,
      "source_url": "https://api.github.com/repos/Rooby-Roo/FrogmonsterAPWorld",
      "tag": "v0.2.2",
      "title": "Frogmonster v0.2.2",
      "version_simple": "0.2.2",
      "world_version": "0.2.2"
    },
    "v0.2.3": {
      "created_at": "2026-02-18T20:40:43Z",
      "description": "_APWorld version 0.2.3, generated from commit [37d7eea](https://github.com/Rooby-Roo/Archipelago/commit/37d7eea0040a409b794ec122f97a13d89f5a6f33)_\r\n\r\nI've tested none of this! Have fun. Please tell me what's broken as soon as possible so I can push out the inevitable hotfix 🔥\r\n\r\n**We've got Universal Tracker!** I've learned how to make UT work and I'll be explicitly supporting it going forward. **YAMLless generation** is available. So, if you want an up-to-date list of everything the world expects you to be able to reach, download [Universal Tracker](https://github.com/FarisTheAncient/Archipelago/releases/latest) and install it in the same place as the Frogmonster apworld. Then, open up the AP Launcher, click \"Universal Tracker\", and connect to your Frogmonster slot. The location list should update in real time.\r\n\r\nAdditionally, we have several small logic bugs that were found as a result of the Big Async. Thanks to everyone who reported them:\r\n\r\n- Runi combat now explicitly requires Dash. I swear that was in there before, but it's definitely in there now.\r\n- Multiple locations in Hive now have correct combat logic (Hive chest, saving Shoot, etc). Additionally, Foraz requires Tongue Swing.\r\n- The Eye Chest goal no longer requires the combat proficiency that is required of you when reaching Myzand 2.",
      "download_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/download/v0.2.3/frogmonster.apworld",
      "has_manifest": true,
      "hash_sha256": "429dc4e4695f379501ec48878f789f6c3945f304c357512fa30221fca0884047",
      "html_url": "https://github.com/Rooby-Roo/FrogmonsterAPWorld/releases/tag/v0.2.3",
      "minimum_ap_version": "0.6.5",
      "size": 28223,
      "source_url": "https://api.github.com/repos/Rooby-Roo/FrogmonsterAPWorld",
      "tag": "v0.2.3",
      "title": "Frogmonster v0.2.3",
      "version_simple": "0.2.3",
      "world_version": "0.2.3"
    }
  }
}
