{
  "description": "Glover is an N64 physics puzzle platforming game.",
  "game": "Glover",
  "github": "https://github.com/Smg065/GloverArchipelago",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "beta": {
      "created_at": "2025-12-08T07:09:44Z",
      "description": "[Glover AP's Information](https://github.com/Smg065/GloverArchipelago/blob/main/worlds/glover/docs/en_Glover.md)\r\n\r\n[Setup Guide (Bizhawk)](https://github.com/Smg065/GloverArchipelago/blob/main/worlds/glover/docs/setup_en.md)\r\n\r\nBeta version for public testing/feedback.",
      "download_url": "https://github.com/Smg065/GloverArchipelago/releases/download/beta/glover.apworld",
      "has_manifest": false,
      "hash_sha256": "16627aa16fca1346d900ac4069c4c6af108442ce51caf73f638343f0a827b98d",
      "html_url": "https://github.com/Smg065/GloverArchipelago/releases/tag/beta",
      "prerelease": true,
      "size": 286172,
      "source_url": "https://api.github.com/repos/Smg065/GloverArchipelago",
      "tag": "beta",
      "title": "Glover AP Beta v0.1.0",
      "version_simple": "0.1.0",
      "world_version": "0.1.0"
    },
    "v1.0.0": {
      "created_at": "2026-01-01T21:12:50Z",
      "description": "### New Features\r\n\r\n- Portalsanity! (Level Doors and Stars are Checks)\r\n- Alternate win conditions added:\r\n  - Crystal Turn-In Count: Turn in the number of Crystals to win, ranging from 2-7\r\n  - Golden Garibs: Find the golden garibs in the multiworld to win\r\n- Checkpoint Items\r\n- Custom Mr. Tip Dialogue\r\n- Score Locations\r\n- Open World/Open Level Settings\r\n- Random Garib Sounds\r\n- False Trap Names\r\n- Easy Ball Walk (De-Inverts your ball controls when standing atop it)\r\n- Filler Items and Trap Items work by weight instead of by percentage\r\n- Overrides to manually set your spawning Checkpoint, the level Entrances, and the Garib Order\r\n- APWorld interactivity with False Trap Names and Custom Mr. Tip Dialogue\r\n- Entrance Randomizer locations now display the Hub Door as its Entrance\r\n- Debug option to toggle puml generation for Glover Logic Builders\r\n\r\n### Fixes\r\n\r\n- Fixed uncaught set_rule lambda error breaking checkpoint spawns (Thank you [CodeGorilla](https://www.twitch.tv/codegorilla) and the people from AP's discord world-dev chat!)\r\n- Fixed Bonus Levels causing Spawning Checkpoint Randomizer logic breaks\r\n- Made Switch-requiring access rules happen after switchless access rules\r\n- Fixed Switchsanity disabling making some switches unusable as vanilla\r\n- Fixed the Fear Boss Reset Switch not working with Switch Checks enabled\r\n- Fear 1's Targets not working with Switch Checks enabled\r\n- Fixed not making you tag after death/checkpoint menu warps\r\n- Fixed the multiworld using random items when needing to place filler items in the world\r\n- Marked an extra life in Fortress of Fear 2 thought inaccessible as accessible (Brick Life)\r\n- Fix the floating ram level transition into instant-check bug.\r\n- Prevents Glover crashing when 100 messages were sent in the same level.\r\n- Stop cutscenes from crashing when receiving filler items by adjusting the cutscene notification flag\r\n- Fixed Level Garibs not giving star marks\r\n- Fixed Level Garibs causing Extra Lives to give garibs\r\n- Fixed item received text sometimes falling behind the current items\r\n- Fixed graphical errors with text displaying garibs/lives when message ram got too full\r\n- Fixed the custom tip crashes.\r\n- Atl1's General Wu's no longer dies when being pushed down the beach\r\n- Crn3's Bee flying too low no longer kills them\r\n- Fixed validation of text for Lua tip inputs\r\n- Fixed Wayroom Tips not being written\r\n- Fixed collecting a checkpoint without having the item replacing the current menu option with the given checkpoint\r\n- Fixed text being on screen while loading a checkpoint crashing\r\n- Fixed collecting the first checkpoint of a level instantly making you respawn\r\n- Fixed Garib collection sfx on garib settings that are not by level\r\n- Fixed getting boomerang/beachball potion in hubs killing you repeatedly\r\n- Fixed being able to enter and leave the well to duplicate balls in the hubworld\r\n- Fixed Game Overs causing a game crash.\r\n- Fixed hint scouts not generating with tip checks disabled\r\n- Fist-Slamming the platform in Pirates 2 moves it while Switch Checks are enabled\r\n- Exiting/Entering the hub after leaving a level caused Xandervile's random door openings\r\n- Fixed Locate Garibs locking your ability to cast spells, and clearing when traps clear.\r\n- Fixed Portalsanity opening a gate before the gate you meant to get\r\n- Fixed getting all garibs in a level giving you a star mark without the item in Portalsanity\r\n- Fixed Level Spawn-In Crashes\r\n- Fixed Score Names not showing up in Locations List\r\n- Fixed All Garib Names not showing up in Locations List\r\n- Fixed All Garib checks being placed at level root and thus requiring level access logically\r\n- Fixed 20 character lines breaking everything.\r\n- Fixed TrapLink not checking if your currently sending a trap before sending it.\r\n- Fixed TrapLink not getting a trap because it wasn't looking for the trap name in the data.\r\n- Fixed checkpoints not accounting for touching the ball letting you warp to the checkpoint with it after\r\n- Fixed cheats happening during the main menu/demo and crashing Glover\r\n- Fixed bug that makes message text fall behind when getting FoF Bonus Garibs or other similarly long multi-message notifications that split into a second message\r\n\r\n### Known Bugs\r\n- Somehow, later levels will open randomly when Open Levels and Portalsanity are off. I've spend 3 months trying to track down this bug, and so I'm just leaving it be.\r\n- \"Link\" packets are occasionally asymmetrical\r\n\r\nThe following are known, but I want to keep because they're just kinda funny.\r\n- You're able to get atop the ball in bonus levels where you control only the ball.\r\n- Getting a frog trap as a stage completion item occurs creates a terrible Glover-Frog hybrid.\r\n\r\n### No Current Plans\r\n\r\n- Tip Trap\r\n- Fastcam\r\n- Grab Mechanical Implementation (Depreciated & Autocollects for logic pathing)\r\n\r\n\r\n\r\nMany thanks to [jjjj112212](https://github.com/jjjj12212) for help with the creation of the Glover AP Rom. He's retired from working on this project, and I wish him the best in future",
      "download_url": "https://github.com/Smg065/GloverArchipelago/releases/download/v1.0.0/glover.apworld",
      "has_manifest": false,
      "hash_sha256": "6bc8021694790bbbe34add8e2457272968fc516a0f3a7f162cb6019e07fc47a0",
      "html_url": "https://github.com/Smg065/GloverArchipelago/releases/tag/v1.0.0",
      "size": 368536,
      "source_url": "https://api.github.com/repos/Smg065/GloverArchipelago",
      "tag": "v1.0.0",
      "title": "Glover AP v1.0.0",
      "version_simple": "1.0.0",
      "world_version": "1.0.0"
    }
  }
}
