{
  "description": "THE GUARDIAN LEGEND (NES 1988, Irem/Compile)",
  "flags": [
    "after_dark"
  ],
  "game": "The Guardian Legend",
  "github": "https://github.com/CoreZer0/TheGuardianLegend-AP",
  "license": "MIT",
  "manifest_fields": [
    "minimum_ap_version",
    "world_version",
    "authors"
  ],
  "versions": {
    "v0.3.0": {
      "created_at": "2024-03-19T04:25:40Z",
      "description": "- New option \"item_distribution\" to select how many copies of subweapons and upgrades exist in the item pool. Choose from Vanilla, Exact, Reduced, or Extra. See the template YAML for details. This is independent of Area Gating and both settings can be combined to customize your difficulty and randomized experience.\r\n- Rewrite of the item_gating logic. Instead of Landers/Stats, it now splits on Offense/Defense. Also fixed a bug with the logic where excess copies of stats could count for access to areas even though they don't do anything in game.\r\n- Added a BizHawk text message for when items are received by the player.\r\n- Supported on Archipelago Server 0.4.4 and higher.",
      "download_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/download/v0.3.0/guardianlegend.apworld",
      "has_manifest": false,
      "hash_sha256": "f6be00b7eae9b18a1afa84d4089c9907501405131aba379ef63e5f7fcf16a6e8",
      "html_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/tag/v0.3.0",
      "size": 56982,
      "source_url": "https://api.github.com/repos/CoreZer0/TheGuardianLegend-AP",
      "tag": "v0.3.0",
      "title": "TGL for Archipelago 0.3.0",
      "version_simple": "0.3.0",
      "world_version": "0.3.0"
    },
    "v0.4.0": {
      "created_at": "2024-03-25T03:28:20Z",
      "description": "- TGL now supports generating a randomized AP file and patch _without_ a copy of the ROM file present. Now game hosts can include TGL without needing to own the game. Players will still need a legal copy of the game in ROM format to patch, play, and connect to AP.\r\n- Miscellaneous code cleanup and bugfixes. Note that Shops no longer have an 'A' in their name, a holdover from when I was listing out multiple shop items that no longer applies.\r\n- This release is supported on Archipelago Server 0.4.5-RC2 and higher, it _will not_ work on 0.4.5-RC1 or 0.4.4, be aware!",
      "download_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/download/v0.4.0/guardianlegend.apworld",
      "has_manifest": false,
      "hash_sha256": "eae39f07707f83a080a32cfbdc487d3dfbb742517d74aef8e41a789ac803407a",
      "html_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/tag/v0.4.0",
      "size": 56763,
      "source_url": "https://api.github.com/repos/CoreZer0/TheGuardianLegend-AP",
      "tag": "v0.4.0",
      "title": "TGL for Archipelago 0.4.0",
      "version_simple": "0.4.0",
      "world_version": "0.4.0"
    },
    "v0.5.0": {
      "created_at": "2024-04-12T02:40:57Z",
      "description": "A number of Quality-of-Life changes for the TGL mod in this release. Supported on AP server release 0.4.5+\r\n\r\n- The big one: Corridor 11-20 now have (optional) in-game hints, where the instructions for opening Corridor 1-10 used to be. Hints will tell you what the \"best\" item in each Corridor's classification is. For example, if C-11 has a Defense Up and an Enemy Eraser, you will get a hint saying something important/progression is there. If it's 2 subweapons, you'll get a \"useful\" hint. How many hints you get is customizable, but which corridors receive hints is randomized. Corridors without hints will get alternate text. New YAML setting is \"corridor_hints\", set to 0-10, 'none', or 'all'.\r\n\r\n- The Blue Landers finally dumped the last of their Blue Chip stocks, so 3-item shops will now only offer one item each. Now there's no risk of grabbing a useless chip instead of that last Attack Up you needed... While clearing inventory, the Landers *may* have misplaced some items, don't pay any attention to it (there is a visual glitch in the shop rooms that shouldn't affect gameplay).\r\n\r\n- The password system has been disabled. The title screen menu option is removed, and the save rooms will no longer give you a password when using \"NO USE\". The save room text has been altered accordingly, and the title screen will now display your AP slot name below \"NEW GAME\". Note that the title screen supports a limited character set so some things will not appear correctly (only space, uppercase English letters, and numerals work; names will be converted as needed).\r\n\r\n- A good amount of code cleanup to help with long-term maintainability, and peer review.",
      "download_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/download/v0.5.0/guardianlegend.apworld",
      "has_manifest": false,
      "hash_sha256": "5b1b8f396a0ca6c49f1c05f3ffae25f08f909be91f3c7b92781eaab3f1c3181e",
      "html_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/tag/v0.5.0",
      "size": 67875,
      "source_url": "https://api.github.com/repos/CoreZer0/TheGuardianLegend-AP",
      "tag": "v0.5.0",
      "title": "TGL for Archipelago 0.5.0",
      "version_simple": "0.5.0",
      "world_version": "0.5.0"
    },
    "v0.5.1-maprando-test": {
      "created_at": "2024-05-08T16:03:51Z",
      "description": "IMPORTANT: This is an EXPERIMENTAL release for testing Map Randomization in TGL. If you need a stable version and don't wish to test the new features, I recommend staying with v0.5.0. I cannot guarantee that seeds with map randomization enabled are completable!\r\n\r\n### What is this?\r\nIn order to get better feedback during the process of developing the Map Rando for TGL I want to get the apworld to players even while features aren't fully fleshed out. Things _should_ work just fine, but expect a bit less polish and a few more bugs.\r\n\r\nFor this release, there is a new YAML Toggle setting \"randomize_map\". Setting this to 'true' will fully randomize the labyrinth map for TGL, changing room layouts and moving areas around. Currently, the randomization will closely resemble that of Fireball87's TGL Randomizer, for those familiar with that.\r\n\r\nWhile the randomization is fully functional, there are still some related missing and incomplete features:\r\n- Location names in the client will still show the coordinates of the vanilla item locations. Areas should still correspond correctly so hints and the Universal Tracker will still direct you to the correct Area.\r\n- Item, shop, and miniboss distribution is identical to vanilla for now. For example, Area 0 will have 4 ground items and 5 shops, Area 10 will have just the one ground item and the 2000 Chip shop.\r\n- The enemy balancing and corridor randomization from Fireball's randomizer aren't implemented yet, only the labyrinth map changes are in this release.\r\n\r\nAlso in this version, the screen flashes for Enemy Erasers and the Naju destruction cutscene before the final boss have been removed.\r\n\r\nFireball87's work used with permission and in accordance with the MIT License at https://github.com/fireball87/GuardianLegendRando",
      "download_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/download/v0.5.1-maprando-test/guardianlegend.apworld",
      "has_manifest": false,
      "hash_sha256": "7a8fac7ea7dfb5d1bc52dbca22b41f92455c5c6153b698d392ff64e51996b345",
      "html_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/tag/v0.5.1-maprando-test",
      "size": 97039,
      "source_url": "https://api.github.com/repos/CoreZer0/TheGuardianLegend-AP",
      "tag": "v0.5.1-maprando-test",
      "title": "TGL for Archipelago 0.5.1-maprando-test",
      "version_simple": "0.5.1",
      "world_version": "0.5.1"
    },
    "v0.6.0": {
      "created_at": "2024-07-10T02:50:19Z",
      "description": "This is a more \"official\" release for the map randomization features introduced in v0.5.1.\r\n\r\n- A new set of \"generic\" location names are now used for the map randomizer (e.g. \"A0 Ground Item A\", \"A0 Miniboss B\") that no longer include the coordinates. Instead, when hinting items/locations, the coordinates will now appear as entrance hints, so it's still possible to locate the item in the randomized map. Ground items will be labeled A-F, minibosses as A or B.\r\n- For now, item distribution per area remains the same as vanilla, but the generic locations are designed to allow more flexibility in moving things around in a future release.\r\n- Seed determinism and world uniqueness have been tested. In other words, using a predetermined seed for ArchipelagoGenerate results in the same world map and item locations across generations. Also, generating multiple TGL games in a single multiworld will have distinct randomized maps.\r\n- Generating a game with randomize_map off will lead to a vanilla game as it was previously, including the coordinates in the location names.\r\n\r\nThere's not much in the way of new user-facing features or goodies here, this was mostly a lot of back-end changes that are needed to support upcoming stuff, but this was more thoroughly tested than the previous experimental release.\r\n\r\nTested to work with Archipelago v0.5.0 but _should_ also work on 0.4.6. Keep in mind that as the location name data has changed, multiworlds generated on a previous apworld version will NOT work on this one, you'll need to generate new ones!\r\n\r\n",
      "download_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/download/v0.6.0/guardianlegend.apworld",
      "has_manifest": false,
      "hash_sha256": "75114563fa40a87e45044255416330ffb4241c449292b47c8c56be4249c7da8d",
      "html_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/tag/v0.6.0",
      "size": 109041,
      "source_url": "https://api.github.com/repos/CoreZer0/TheGuardianLegend-AP",
      "tag": "v0.6.0",
      "title": "TGL for Archipelago 0.6.0",
      "version_simple": "0.6.0",
      "world_version": "0.6.0"
    },
    "v0.7.0": {
      "created_at": "2026-01-29T23:04:21Z",
      "description": "A small but important update to the TGL apworld to ensure the game is compatible with future versions of Archipelago!\r\n\r\n- The apworld now includes a manifest file, as required by AP starting with the future 0.7.0 release. This doesn't affect the player experience in any way, except you should no longer see warnings about the file not being there. The manifest sets the _minimum_ AP version to 0.6.4, so this apworld will not work on versions prior to that.\r\n- Support for the 'start_inventory_from_pool' YAML option has been added.\r\n- A bug has been fixed where another world !collecting from a corridor bonus location would prevent the non-bonus location from sending out properly when actually cleared by the TGL player.\r\n\r\nPrevious YAMLs should be valid with no changes for this release. Supported on AP server release 0.6.4+.",
      "download_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/download/v0.7.0/guardianlegend.apworld",
      "has_manifest": true,
      "hash_sha256": "9d00cc633de400916bdd4ff3606412cae287a31254862c8be89d71d50c8a4612",
      "html_url": "https://github.com/CoreZer0/TheGuardianLegend-AP/releases/tag/v0.7.0",
      "minimum_ap_version": "0.6.4",
      "size": 39735,
      "source_url": "https://api.github.com/repos/CoreZer0/TheGuardianLegend-AP",
      "tag": "v0.7.0",
      "title": "TGL for Archipelago 0.7.0",
      "version_simple": "0.7.0",
      "world_version": "0.7.0"
    }
  }
}
