{
  "description": "Hammerwatch is a hack and slash action adventure.\nPlay as a hero that is one of seven classes as you fight your way through Castle Hammerwatch to defeat the dragon\nor the Temple of the Sun to stop the evil Sun Guardian Sha'Rand.",
  "game": "Hammerwatch",
  "github": [
    "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer",
    "https://github.com/Parcosmic/Hammerwatch-Archipelago"
  ],
  "license": "GPL-3.0",
  "manifest_fields": [],
  "versions": {
    "v0.7": {
      "created_at": "2023-03-19T20:05:08Z",
      "description": "Added banner traps. They appear as a purple chest, and breaking it will place down a random banner\r\nAdded custom map icons for archipelago items to better differentiate them on the map\r\nAdded an Archipelago settings page in the options menu, and moved Explore Speed and Fragile Breakables settings into the client\r\nAdded deathlink toggle in the Archipelago settings page\r\nAdded the ability to rebind the explore speed button in the controls menu\r\nWhen consumable items are received, they are prioritized to players that can use them\r\n(Castle) Added generation option to be able to use the shortcut teleporter at the beginning of the game to combat a potential early BK\r\n(Castle) Added save before the first bronze door to ensure that you can always save your progress\r\nThe client now checks what client version the server is expecting, and refuses to connect if outdated\r\nFixed issues with deathlink in multiplayer\r\nFixed crash when jumping in a multiplayer game\r\n\r\nThis version is *not* backwards compatible with previous versions of the apworld. When updating your client make sure you're using the newer apworld! It's also attached here for convenience",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/download/v0.7/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "7581aaf8180511f250de7f00fe1eb4c51f7c15224c224b6ebf9b00444f187481",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/tag/v0.7",
      "prerelease": true,
      "size": 195650,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago-Mod-Installer",
      "tag": "v0.7",
      "title": "v0.7",
      "version_simple": "0.7",
      "world_version": "0.7"
    },
    "v0.7.1": {
      "created_at": "2023-03-19T20:05:08Z",
      "description": "Fixed game resending you items you already received if you lose connection and reconnect automatically, then change levels",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/download/v0.7.1/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "7581aaf8180511f250de7f00fe1eb4c51f7c15224c224b6ebf9b00444f187481",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/tag/v0.7.1",
      "prerelease": true,
      "size": 195650,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago-Mod-Installer",
      "tag": "v0.7.1",
      "title": "v0.7.1",
      "version_simple": "0.7.1",
      "world_version": "0.7.1"
    },
    "v0.8": {
      "created_at": "2023-03-19T20:05:08Z",
      "description": "Unfortunately I haven't had too much time to test this beyond basic functionality testing. There is a high likelihood of bugs, if you come across any reporting them would be great!\r\n\r\n# Changelog\r\nRe-added the ability to play randomized games with modifiers! If the Randomize Recovery Items option is on it disables the 1 HP and no healing items modifiers\r\n\r\nAdded the Shop Upgrade Category Shuffle option, which shuffles the category of shop upgrades. There are two choices, Group or All. Group keeps all upgrades in a series (such as Damage 1, 2, etc) shuffled in the same category. All randomizes upgrades among all categories regardless of series, so Damage 1 could be in one shop and Damage 2 could be in another. You still have to purchase Damage 1 in order to see/buy Damage 2!\r\nAdded shop upgrade cost randomization. This is determined with two new options: Minimum Shop Cost Percent and Maximum Shop Cost Percent. Each shop upgrade's cost is multiplied by a random percentage uniformly-distributed between the minimum and maximum options. Both options can be set from 0% to 500%\r\nAdded Act Specific Keys option, in the Castle campaign this separates out keys into versions that can only be used on the specified act. This should improve hinting for keys so you have a higher chance of getting the hint for a key someone can actually get\r\nAdded the Remove Extra Lives option, which replaces all ankhs in the item pool with filler items. Nice for the infinite lives or no extra lives modifiers so you don't have useless items in the item pool\r\n\r\nAdded an announce message that displays when receiving items who sent the item and what you received\r\nImproved the countdown display in the client\r\nChanged the item pickup text of other player's items to show what the item is and who it belongs to\r\nRemoved mirroring server item send, item receive, and countdown messages in the in-game chat\r\n\r\nAdded a return portal in the entrance to Cave Level 3 in the TotS campaign that leads back to the surface in case you want to return and you don't have a Rune Key\r\nChanged the Worldfire boss arena exit back to the Chambers floors to be a portal rather than a doorway to be more visible\r\nRemoved the boss switch that appears when taking the shortcut teleporter, and prevented the bridge to the second boss switch from being broken\r\n\r\nFixed selected difficulty not displaying properly when playing a randomized game\r\n\r\nUpdated Archipelago.NET version\r\n\r\n# Known Issues\r\n\r\nPlaying the temple campaign and exiting out in a boss room will cause the game to crash after loading the save and leaving the room. Make sure not to exit the game while in a boss room!\r\nCastle: going through the shortcut teleporter will break the bridge to the 2nd boss switch, softlocking the save. Unfortunately this means you can't actually use that option for now",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/download/v0.8/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "1b4a2288747099312ccf44324b516069b1adab49443fe734ee09391acb6324cc",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/tag/v0.8",
      "prerelease": true,
      "size": 228727,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago-Mod-Installer",
      "tag": "v0.8",
      "title": "v0.8",
      "version_simple": "0.8",
      "world_version": "0.8"
    },
    "v1.0": {
      "created_at": "2023-03-19T20:05:08Z",
      "description": "Note: I tried my best but there will likely be some things I missed due to the large number of option combinations. If you run into any bugs please let me know I would greatly appreciate it!\r\n\r\n# New Options\r\nOpen Castle - castle campaign only, unlocks travel to/from all floors at the start of the game\r\nExit Randomization - randomizes where level exits and portals lead\r\nER Act Connection Range - how many acts apart levels are likely to be connected to each other with ER\r\nRandomize Start Location - starts you at a random exit if ER is on\r\nStart Location Act - determines the act of the starting exit if the setting is on\r\nGate Shuffle - shuffles the types of bronze, silver, and gold gates\r\nEnemy Shuffle - shuffles the locations of enemies, spawners, mini-bosses, and towers in each level\r\nEnemy Shuffle Act Range - how many acts away enemies can be shuffled to\r\nTreasure Shuffle - shuffles the locations of minor treasure such as coins, crates, pots, and vegetation\r\n\r\n# APWorld Changes\r\nKill final boss goal options are now kill all bosses in case you play with Open Castle on\r\nChanged how entrances are named, should only impact spoiler\r\nShortened location and region names. Feedback is appreciated!\r\nAdded exit connectivity info to spoiler if ER is on\r\n\r\nFixed enemy loot locations existing when the option was disabled whoops\r\nFixed item link crash when replacing with random filler\r\nFixed crash when Remove Extra Lives option was on\r\n\r\n# Client Changes\r\n\r\nAdded a hub level to both campaigns for faster travel or hanging out in if you get in BK!\r\nAdded client commands, mainly to help combat softlocks or things breaking\r\n* /help: lists all commands and their usages\r\n* /tp [level_code] [start_id]: teleports you to the specified start node, with no arguments teleports to the start\r\n* /flag flag_name [true/false]: sets the value of the given flag, with only 1 argument returns the value of the flag instead\r\n* /deathlink: toggles deathlink on/off\r\n\r\nOption to play a sound when Explore Speed enables\r\nOption to disable Archipelago chat mirroring\r\nFloor signs now change to show what floor is behind an exit\r\nRemoved gates that lead to the back of each boss room, the back of the room functions the same\r\nAct specific bonus keys now show what act they are for\r\nA sound now plays during a countdown\r\nAdded mod info to the credits screen\r\nAdded to crash message to send me the log.txt as well, got more debug printing in there that should be helpful\r\nMoved the first save in the castle campaign to be before the first wall rather than behind it\r\nBumped up temple cave storage room spawn node a bit so you don't appear inside a wall when exiting from there\r\n\r\nFixed crash when loading a temple save in a boss room\r\nFixed crash when failing to connect to the server\r\nFixed shortcut portal breaking the bridge to the second boss switch\r\nFixed deathlink messages using the wrong class for class-specific messages\r\nFixed Act Specific Keys being used for the temple campaign\r\nFixed item receive message to not show names twice\r\nUpdated Archipelago.NET version\r\n\r\n# Known Issues\r\nCurrently generation has a decent chance of failing if gate shuffle and exit randomization are on, I haven't found a good solution for this yet so you might have to generate a few times to get it to work!",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/download/v1.0/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "d39e7dc6ff7a28307175d9d200440c97ee942113f6b818979c7e9dac37d691d7",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/tag/v1.0",
      "size": 320822,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago-Mod-Installer",
      "tag": "v1.0",
      "title": "v1.0",
      "version_simple": "1.0",
      "world_version": "1.0"
    },
    "v1.0.4": {
      "created_at": "2023-03-19T20:05:08Z",
      "description": "# Client Changes\r\n\r\nFixed not being able to force load a save in case the port or ip has changed\r\nFixed being able to connect to a server with an incompatible save\r\nFixed not being able to place planks in the final boss room that were given to you after entering\r\nFixed the portal in the dragon boss room from re-opening after defeating the boss in the castle escape goal\r\nFixed the secret passage in the dragon boss room from opening when not playing the castle escape goal\r\nFixed walls not being removed when coming from bonus return rooms and the bonus is not completed\r\nFixed checked locations being reset by what was last known by the server\r\nFixed a crash when receiving a hint message including an item or location id that is larger than an int\r\nFixed crash when the explore speed sound would try to play in vanilla\r\n\r\n# AP World Changes\r\n\r\nUpdated game info page to include information about commands\r\nRenamed a lot of locations and regions to be more descriptive\r\nAdded logic for sneaking into the dragon boss room to grab checks without waking the boss\r\nFixed logic for accessing locations coming from the shortcut portal on floor 1\r\nFixed the shortcut portal to floor 3 being considered as two-way\r\nFixed a swapped exit code in the armory floors\r\nFixed crash when starting with more items in your start inventory than that exist in your world\r\nFixed a crash when the trap percent option is ludicrously high\r\n\r\n# Tracker Changes\r\n\r\nAdd item tracking for the tools\r\nMerge similar locations into a single square\r\nChange location sprites based on the location type (miniboss, tower, etc)\r\nResized check boxes to be more consistent between similar levels\r\nFixed auto tab switching for the temple campaign",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/download/v1.0.4/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "f7a8ef045a966ee1e943629bf171dc3e8268c9347b61ff11b380bd207db95443",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/tag/v1.0.4",
      "size": 538222,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago-Mod-Installer",
      "tag": "v1.0.4",
      "title": "v1.0.4",
      "version_simple": "1.0.4",
      "world_version": "1.0.4"
    },
    "v1.1": {
      "created_at": "2023-03-19T20:05:08Z",
      "description": "Usual disclaimer that there will very likely be bugs in this release, especially due to the sheer amount of hackery required for buttonsanity. Please report any issues that you come across!\r\n\r\n# New Options\r\n**Buttonsanity** - allows you to get randomized items when pressing buttons, as well as put button effects into the item pool. Has two suboptions, normal and insanity. Insanity will make ALL buttons checks, including ones included in a sequence. This will also split up certain button events into Progress items which getting all of them will finally execute the button effect. It is highly recommended not to play with buttonsanity on unless knowledgeable about the game, especially so with buttoninsanity!\r\n**Key Mode** - a new option that handles whether keys should behave like vanilla, be split into act-specific keys, or a new variant: floor master keys. Receiving a floor master key (ex Prison Floor 1 Master Bronze Key) will enable you to unlock all doors of that type on that floor. This effectively condenses the 150 keys in the castle campaign into 40 or less master keys!\r\n**Game Modifiers** - a dictionary that enables you to lock certain game modifiers on or off. The modifiers are: no_extra_lives, 1_hp, shared_hp_pool, no_hp_pickups, no_mana_regen, reverse_hp_regen, infinite_lives, hp_regen, double_damage, double_lives, and 5x_mana_regen. Note some modifiers are incompatible with each other, if conflicting modifiers are specified the earlier ones in the dictionary will apply\r\n**Trap Item Weights** - allows you to specify the weights of different trap items, in case you want 100% bomb traps for some reason\r\n**ER Seed** - allows you to set an alphanumeric seed for exit randomization in case you and others want the same ER layout. Using a value of \"random\" will make the seed random\r\n\r\n# APWorld Changes\r\nRemoved Act Specific Keys option, that behavior is now incorporated into the Key Mode option\r\nMade Serious Health item classification useful so it isn't duplicated as filler\r\nImproved victory locations and conditions to make the spoiler look better\r\nReverted renaming entrances in ER to be more clear which exits need to be taken to get to a new region\r\nFix incorrect bonus gate logic\r\n\r\n# Client Changes\r\nMajor enemies that drop randomized loot now drop from that enemy rather than where the enemy started the room\r\nRune puzzles are now fully randomized\r\nRemoved support for offline play due to complexities of saving data with the new options. If I hear that this is a desired feature I am open to reimplementing it!\r\nHub portals now activate when you go through them rather then when defeating the act boss\r\nChanged how ending the game works. In the castle campaign in the plank hunt or defeat all bosses goals you can return to the bridge at the start to end the game. In the temple campaign you can talk to Richard Cain (the old dude sitting outside the temple) to hear what your goal is, and to end your game after you complete it\r\nAdd a send message queue so you can more easily read all items you send out when grabbing many in quick succession\r\nShow duplicate received items as \"Received 2x...\" or higher to shorten the item display message spam\r\nDeathlinks received on a loading screen will now apply when loaded into the level\r\nYou can add quotation marks in commands to pass arguments with spaces\r\nThe mod now unpacks the game assets and patches any it needs rather than distributing the already patched assets along with the mod\r\nNetwork optimizations with only sending the server what new locations were checked\r\nMod now stores/retrieves the datapackage from the same path as the Archipelago text client\r\n\r\nFixed deathlink not killing all local players when disconnected from the server\r\nFixed trap items not affecting you while standing still by adding a slight offset when spawning them on the player\r\nFixed temple floor 2 N/S puzzles from having the wrong one active\r\nFixed pickaxe items remaining behind the ice blocks in the temple campaign\r\nFixed player messages no longer being colored\r\nFixed temple floor 1 east puzzle wall not being solid when not active\r\nFixed a crash when trying to load a save while not connected to an Archipelago server\r\n\r\n# Tracker Changes\r\n\r\nUpdated tracker with button locations and to show floor master keys if the option is on\r\nReduced excessive loading times when connecting to an Archipelago server\r\n",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/download/v1.1/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "e96b595a4e3c7a0ae42239f32ebed4b904276fdaabb2a5b60b8f6d624869c384",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/tag/v1.1",
      "size": 648374,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago-Mod-Installer",
      "tag": "v1.1",
      "title": "v1.1",
      "version_simple": "1.1",
      "world_version": "1.1"
    },
    "v1.1.13": {
      "created_at": "2023-10-29T12:20:28Z",
      "description": "Now hosting the apworld on this repo for ease of access",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago/releases/download/v1.1.13/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "3e899c24673f6b0acbdcf770d84b55af5b654d9cf1179463ffc679e2690dce18",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago/releases/tag/v1.1.13",
      "size": 120196,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago",
      "tag": "v1.1.13",
      "title": "v1.1.13",
      "version_simple": "1.1.13",
      "world_version": "1.1.13"
    },
    "v1.1.4": {
      "created_at": "2023-03-19T20:05:08Z",
      "description": "### Client changes\r\n\r\nFixed temple campaign switching keys when act_specific keys is on\r\nFixed /i command crashing the game when the player doesn't exist\r\n\r\n### Apworld changes\r\n\r\nPrevent the act_specific key mode from being set in the temple campaign\r\nRenamed \"Open AvF9 Boss Switch Room\" to \"Open AvF9 Boss Rune Room\"",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/download/v1.1.4/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "9e5f6e99614c8dd4a355642eabdd0679e9d9a6c5fcdbf5961126fea3d0344710",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases/tag/v1.1.4",
      "size": 648816,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago-Mod-Installer",
      "tag": "v1.1.4",
      "title": "v1.1.4",
      "version_simple": "1.1.4",
      "world_version": "1.1.4"
    },
    "v1.2": {
      "created_at": "2023-03-19T20:05:08Z",
      "description": "**Note this update is NOT backwards compatible!!** While working on this I realized that I've designed a lot of things less than optimally, so I've decided to finally rip off the band-aid. Now the back-end of things are formatted a lot nicer and the slot data usage is much less!\r\n\r\nAnd for the usual disclaimer that there are almost assuredly bugs in this version, especially in multiplayer which I'm largely unable to test by myself. I ripped through most of the code reformatting everything so I wouldn't be surprised if things broke in ways that I haven't anticipated. Reporting any issues anyone comes across would be greatly appreciated!\r\n\r\nGet the latest client release here: https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases\r\n\r\n# New Options\r\n**Shop Randomization** - adds shop upgrades to the itempool and enables multiworld items to be bought from the shops. To use this option you need to specify which class each player will play as, which will add that class's upgrades to the pool. If multiple players play as the same class they will receive their upgrades together and will have the same items in their shops. NOTE in vanilla there is not enough money to be able to purchase everything from the shops, if you don't want to grind for money in the ap hub it is highly recommended to decrease the shop costs to 50% or less or to turn on this next option:\r\n**Balance Shopsanity Costs** - reduces the costs of items in shops based on their item classifications. If the item is useful it will cost 50% as normal while filler items will cost 10% as much\r\n**Shady Shops** - causes the names and descriptions of trap items in shops to mimic another item in the world of the receiving player. There are suboptions that can slightly change the name/description of the mimicked item, meant to be more for fun than to make telling the mimic apart difficult. One suboption can instead make every item be hidden in the shop so none of them will be known until they are purchased\r\n**Enemy Shuffle Mode** - functions like the old Enemy Shuffle option, however it now allows you to shuffle enemy types instead of them individually. For example this means that all tier 1 bats can be replaced by tier 1 beetles\r\n**Enemy Shuffle Keep Tier** - if Enemy Shuffle is on, only shuffles enemies of the same tier amongst each other\r\n**Hammer Fragments** - if this option is on then breakable walls can only be destroyed after collecting the specified number of hammer fragments\r\n**Open Castle Portals** - replaces the previous Open Castle option, now lets you specify a number of acts to be open from the start rather than all or none of them\r\n\r\n# APWorld Changes\r\n\r\nButtoninsanity no longer splits items into multiple \"Progress\" variants. The additional locations previously part of this option still remain the same. Junk items will be added to the itempool to make up for the difference\r\nAdded location name groups\r\nFixed typo with buttonsanity logic on floor 2 connecting to the south\r\nFixed logic for CL3 for items that you can access after opening the temple entrance shortcut\r\nFixed logic on TF2 where the rune sequence is considered accessible without needing to access the nw boulder room\r\nFixed logic on TF2 where the item on the blue spikes didn't require the blue spikes switch\r\nFixed logic on TF3 right boss fall room not requiring the sun blocks to be broken to access it from the main room\r\nProbably a few other logic fixes that I forgot about",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago/releases/download/v1.2/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "6edd82d458376d6ec7900694fa4588e9ad12790bad1559e66a342e28bc6b0d89",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago/releases/tag/v1.2",
      "size": 137688,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago",
      "tag": "v1.2",
      "title": "v1.2",
      "version_simple": "1.2",
      "world_version": "1.2"
    },
    "v1.2.2": {
      "created_at": "2024-11-25T23:35:24Z",
      "description": "Added random_class suboption to Shopsanity options\r\nAdded Shopsanity Assist option\r\nAdded UT support for randomizing your class\r\nRenamed TF1: Node 2 locations to TF1: NE Node\r\nFixed some entrances being created multiple times, screwing up key logic if keys are consumed\r\n\r\nGet the latest client release here: https://github.com/Parcosmic/Hammerwatch-Archipelago-Mod-Installer/releases",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago/releases/download/v1.2.2/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "67b137c8b5eadbfb344fe5d87c52366e4dbe76b38840bc4b065cddf65f77ae6c",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago/releases/tag/v1.2.2",
      "size": 236444,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago",
      "tag": "v1.2.2",
      "title": "v1.2.2",
      "version_simple": "1.2.2",
      "world_version": "1.2.2"
    },
    "v1.2.3": {
      "created_at": "2024-11-25T23:35:24Z",
      "description": "Open TF1 North Jail is now classified as useful\r\nFixed logic for TF2: West Enemy Jail Barricade",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago/releases/download/v1.2.3/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "b40bf46a3385569126d40aadef02ff95a25f0e9f73efdc7e06a25276a95eff84",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago/releases/tag/v1.2.3",
      "size": 70916568,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago",
      "tag": "v1.2.3",
      "title": "v1.2.3",
      "version_simple": "1.2.3",
      "world_version": "1.2.3"
    },
    "v4.0pre0": {
      "created_at": "2025-08-15T12:55:11Z",
      "description": "This update adds new options, a fair amount of optimizations, and better integration with Universal Tracker!\r\n\r\nGet the latest client release here: https://github.com/Parcosmic/HammerwatchAPMod/releases\r\n\r\nAdded map tracking support with Universal Tracker, along with auto tab switching\r\nEnabled yaml-less generation with Universal Tracker\r\nAdded four new traps: the Disarm Trap (prevents you from dealing damage), Stun Trap (prevents movement and attacking), the Hey! Trap (creates a swarm of text boxes that follows players), and the Chaser Trap (spawns a kamikaze mummy that chases you through the entire level)\r\nAdded Lever Fragment suboption: per_level. This splits levers into versions that only activate the pumps on a single floor\r\nAdded suboption for Randomize Enemy Loot to force all enemy loot locations to exist\r\nStrange Planks are now deprioritized in the Plank Hunt mode\r\nArchives bonus keys are now considered useful\r\nIf Randomize Bonus Keys is off, the non-randomized keys are treated as act-specific\r\nOverhauled the docs\r\nMinor name clarifications\r\n\r\nFixed a generation error in the castle campaign plank hunt goal if there are less than 12 planks in the item pool\r\nFixed a couple rare generation errors regarding gate shuffle and ER",
      "download_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago/releases/download/v4.0pre0/hammerwatch.apworld",
      "has_manifest": false,
      "hash_sha256": "ec8b9fc338a19a328ae75afdef957376e96a2a70fc1400225d4940836e88d7ca",
      "html_url": "https://github.com/Parcosmic/Hammerwatch-Archipelago/releases/tag/v4.0pre0",
      "prerelease": true,
      "size": 70777009,
      "source_url": "https://api.github.com/repos/Parcosmic/Hammerwatch-Archipelago",
      "tag": "v4.0pre0",
      "title": "v4.0 Prerelease 0",
      "version_simple": "4.0",
      "world_version": "4.0rc0"
    }
  }
}
