{
  "description": "HyperRogue game desc.",
  "game": "HyperRogue",
  "github": "https://github.com/rajanb/HyperRogueAP",
  "license": "GPL-2.0",
  "manifest_fields": [],
  "versions": {
    "v0.1": {
      "created_at": "2025-07-30T11:29:21Z",
      "description": "### HyperRogue Archipelago Implementation!\r\nThis version is playable but may contain a few bugs / logic errors so be careful. Currently only treasures are randomized, and the goal is to collect 10 hyperstones. Hyperstones will spawn like they do in vanilla, but the number of treasures you need 10 or more of can be decreased to make hyperstones spawn earlier. Only the standard game mode is supported, I haven't actually tested OSM yet\r\n\r\n### Setup\r\nInstall [MSYS2](https://www.msys2.org/). Then add C:\\msys64\\ucrt64\\bin (or wherever msys ucrt is installed) to your PATH. Then open msys2.exe and paste this command `pacman -S mingw-w64-ucrt-x86_64-gcc mingw-w64-ucrt-x86_64-SDL mingw-w64-ucrt-x86_64-SDL_mixer mingw-w64-ucrt-x86_64-SDL_ttf mingw-w64-ucrt-x86_64-SDL_gfx mingw-w64-ucrt-x86_64-glew` After installing the packages you should be able to run the game included in the zip below\r\n\r\n### Playing the Game\r\nTo connect to a multiworld, go to settings > archipelago settings and input your connection info. You can toggle settings at any time but connecting to a server will restart your run. The settings are as follows:\r\n- Balance Monster Spawns - instead of scaling enemy spawn rate with the number of treasures you have (items received from the multiworld) scale spawn rate with locally collected treasures (the in game objects you collect to send checks). This makes the gameplay much closer to that of a normal run\r\n- Show text client messages in game - Displays all messages using the in game text display. By default this covers a fair amount of the screen so you may want to lower the font size if you enable this setting\r\n- Enable Deathlink - When you get checkmated you will send a death to all other deathlink players. When you receive a deathlink your run is restarted immediately\r\n- Enable RingLink - Originating from Sonic games, RingLink links currency across several games. For HyperRogue, this is orb charges. Collecting orbs will increase other player's ring counts, and losing orb charges will decrease other player's ring counts\r\n\r\nThere is also an in game tracker you can view by holding tab. This displays each treasure you can logically collect in an X/Y/Z format, where X is the number you currently have this run, Y is the highest number you have collected in any run, and Z is the amount of treasure in logic. The amount of treasure in logic scales with the amount of that treasure you have received from the multiworld",
      "download_url": "https://github.com/rajanb/HyperRogueAP/releases/download/v0.1/hyperrogue.apworld",
      "has_manifest": false,
      "hash_sha256": "e8bf123dc5392cf6c704162a5095abcfa3ee215b7aa11b026cef0e38c18cd6ff",
      "html_url": "https://github.com/rajanb/HyperRogueAP/releases/tag/v0.1",
      "prerelease": true,
      "size": 39832,
      "source_url": "https://api.github.com/repos/rajanb/HyperRogueAP",
      "tag": "v0.1",
      "title": "HyperRogue AP v0.1",
      "version_simple": "0.1",
      "world_version": "0.1"
    }
  }
}
