{
  "description": "Iji is a freeware action platformer developed by Daniel Remar and released in 2008.\nYou play as Iji: a young woman empowered with alien technology and suddenly thrown into the midst of deadly \nintergalactic conflict... with the fate of humanity in her hands. The game features ten regular levels and several\nextra levels, an in-depth stat system that rewards customisation, an arsenal of powerful alien weaponry and a\nwealth of secrets to discover.",
  "game": "Iji",
  "github": "https://github.com/Minish-Link/Iji-Archipelago",
  "license": null,
  "manifest_fields": [
    "authors",
    "minimum_ap_version",
    "world_version"
  ],
  "versions": {
    "v1.0.0": {
      "created_at": "2025-03-07T17:34:39Z",
      "description": "The first public release of the Iji Archipelago Multiworld Randomizer!\r\nOriginal game by Remar Games https://remar.se/daniel/\r\nMake sure to read the enclosed README",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.0.0/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "28192362afd909c88f73245c9c603592787a62dcbe008e8f5d379891b356af39",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.0.0",
      "size": 18753,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.0.0",
      "title": "Iji Archipelago v1.0.0 ",
      "version_simple": "1.0.0",
      "world_version": "1.0.0"
    },
    "v1.0.1": {
      "created_at": "2025-03-07T17:34:39Z",
      "description": "This should \"fix\" generation failing for worlds that contain more items than locations by compacting stat items and removing excess items when needed.\r\nAlso deleted a function that referenced a removed option that caused generation to fail for worlds that added the null driver as a check.",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.0.1/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "3e854d54b24f8adfb0c22791dab42b91c5988be2422925c85a45d6af415fc5a6",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.0.1",
      "size": 19422,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.0.1",
      "title": "Iji Archipelago v1.0.1 Too many items fix",
      "version_simple": "1.0.1",
      "world_version": "1.0.1"
    },
    "v1.1.0": {
      "created_at": "2025-03-09T06:12:13Z",
      "description": "Adds 69 new locations that are always enabled.\r\n- 6 Tutorial Pages at the start of Sector 1\r\n- 9 locations for each of the 7 stats, from leveling up that stat to certain levels.\r\n\r\nNow with 100% generation success rate using random yamls\r\n\r\nIncludes changes to both the apworld and randomizer since the previous release.",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.1.0/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "9b2952b799d7d22e1344b59e2c1bac47c623090e88155d3683e5f1961bc41ade",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.1.0",
      "size": 20103,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.1.0",
      "title": "Iji Archipelago v1.1.0 Statsanity",
      "version_simple": "1.1.0",
      "world_version": "1.1.0"
    },
    "v1.1.1": {
      "created_at": "2025-03-09T21:10:30Z",
      "description": "Fixed an apworld logic issue that caused all Stat level locations to require 9 Komato Stats, and that caused all Sector weapons to be inaccessible\r\n\r\nAPWorld changed since previous release, no changes to the randomizer.",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.1.1/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "8052ee2042a59d7b4846b8c90e3da6f5c1d5ca8eae38af7d9a99710081010fc3",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.1.1",
      "size": 20099,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.1.1",
      "title": "Iji Archipelago v1.1.1 The Komato Fix",
      "version_simple": "1.1.1",
      "world_version": "1.1.1"
    },
    "v1.1.3": {
      "created_at": "2025-03-16T15:26:36Z",
      "description": "Prepared for the first Playtest Async in the Archipelago discord\r\n\r\n- Fixes the logic for the Sector 9 Poster region so that it now correctly requires an MPFB Devastator\r\n- Fixes the Sector 4 Supercharge region and Sector 4 Surveillance Control region not actually being connected to the rest of the regions in the world.\r\n- Fixes the Null Driver Portal incorrectly checking how many posters the player found, allowing it to be entered earlier than intended.",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.1.3/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "9f1e96969342ca6f3a531eceb2d1da61bda2cb99147a802a21320a16a9f0dc4e",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.1.3",
      "size": 20091,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.1.3",
      "title": "Iji Archipelago v1.1.3 Playtest Async Build",
      "version_simple": "1.1.3",
      "world_version": "1.1.3"
    },
    "v1.1.4": {
      "created_at": "2025-04-09T19:18:16Z",
      "description": "Fixed error when receiving DeathLinks\r\nFixed logic for Supercharges in Sectors 1, 2, and 3\r\nFixed logic for Sector 3 - Rocket Launcher 1/2\r\nSome AP error scripts will now display a message on screen\r\n(Still need to figure out the issue with players sometimes getting disconnected during gameplay)\r\n\r\nYAMLs from the previous apworld will still work",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.1.4/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "1a4077211b3d0c2f5035f1ce4fff8cb84dcf4e02ecbd44994856b30af3a591f5",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.1.4",
      "size": 69305,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.1.4",
      "title": "Iji Archipelago v1.1.4 Post Playtest Build",
      "version_simple": "1.1.4",
      "world_version": "1.1.4"
    },
    "v1.1.5": {
      "created_at": "2025-07-10T01:05:17Z",
      "description": "The game client now reports to the server that it is using version 0.6.2 to avoid version incompatibility errors.\r\n\r\nAPWorld and YAML are unchanged from v1.1.4",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.1.5/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "b897df025054dc0eceac73d06888bde4987d4d0ebe2d710c519137894abd4277",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.1.5",
      "size": 20089,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.1.5",
      "title": "Iji Archipelago v1.1.5 Archipelage 0.6.2 update Hotfix",
      "version_simple": "1.1.5",
      "world_version": "1.1.5"
    },
    "v1.2.0": {
      "created_at": "2025-07-29T16:49:47Z",
      "description": "## Major Changes:\r\n\r\n- Each Sector can be played even if the Sector before it hasn't been completed.\r\n- new YAML Option to choose between items that give Progressive Sector Access or items that access to specific Sectors\r\n- Health Balancing option now allows full customization of Health Stat items needed to logically reach sectors, including the option to use random values\r\n- Sectors 3, 5, 7, and 9 can be chosen as your end goal\r\n- Poster and Ribbon requirements apply to whatever your current goal is, instead of exclusively for Sector Z\r\n- When leaving a sector, your weapons, stats, remaining points, upgrades, and ammo will be saved and transferred to the next Sector you play\r\n- Your current weapons, stats, upgrades, and points are all now visible on the main menu screen\r\n- Your Poster and Ribbon requirements for your goal, and how many you currently have is also visible on the main menu\r\n- Armor Upgrades and Jump Upgrades are items that can be shuffled into the multiworld, or kept in their vanilla locations\r\n- new Cursed Armor option where you start with 1/4 of your Armor bar and gain another 1/4 of it when you get your next 3 armor upgrades\r\n- new Levelsanity option where Level ups no longer award stat points, and instead adds a Supercharge item to the multiworld for each Level up in your world.\r\n- When warping to a Sector, you can warp to a checkpoint within the level, if you have reached that checkpoint at least once.\r\n- You can unlevel your stats by interacting with level stations while your weapon is in passive mode\r\n  - You can switch your weapon mode while connected to a level station for quick and easy stat reassignment\r\n- New option to add Fire Anytime item to the multiworld, which lets you shoot your weapon while midair or ducking.\r\n- Checkpoints are now locations\r\n- New option to add Secured boxes as locations\r\n- New option to add Nano overloads as locations\r\n- Universal Tracker integration that adds an internal poptracker pack and YAML-less regen\r\n  - Removed in-game map markers\r\n\r\n## Minor changes:\r\n\r\n- Picking up armor when you have a partial armor bar can give you temporary armor, at 1/2 the rate of normal armor gain\r\n- Health Pickups obtained from the Archipelago server have a special appearance, and give 1 temporary health if you're at full health\r\n- Expanded logic difficulty options from 3 tiers to 5.\r\n- Removed Compact Stat items option\r\n- Removed Post-game locations option\r\n- Removed Pacifist Locations option\r\n  - Massacre is no longer a check, but can still be obtained via its vanilla requirements\r\n  - Deep Sector is always accessible, regardless of any story decisions made\r\n- Music Shuffle option\r\n- Duplicate items options have been compressed into a single option.\r\n  - Special traits, Jump Upgrades, Armor Upgrades, and Fire Anytime can now also have duplicates in the pool.\r\n- Worlds can have way more total ribbons in them (Up to 500)\r\n- Ribbons are now forced to be locations\r\n- Enabling special traits as items adds \"Reach Max Level in <Stat>\" locations for parity purposes\r\n- Custom deathlink messages that match Iji's cause of death\r\n  - Not all causes of death have been added yet\r\n- new Ammo Bundle filler that spawns one of each small ammo type\r\n- new Banana Trap that spawns a Banana at Iji's position\r\n- Player saves now use .ini files for faster reading and writing\r\n  - Save files are now located in the same directory as the executable file (Thanks Game Maker 8)\r\n- \"Goal Requirements\", \"Inventory\", and \"Miscellaneous Locations\" removed from the Sector Warp menu\r\n  - new \"Sector Information\" selection in Sector Warp menu that displays important information about each sector\r\n- The opening cutscene only plays the first time you enter Sector 1, and then never again\r\n- The game will now output an error log when encountering a fatal error\r\n- You can take a screenshot of the game by pressing F9\r\n\r\nAnd maybe some other stuff I've forgotten idk\r\nNote: This version overhauls a ton of stuff from the previous versions, and is thus entirely incompatible with older versions and older YAML files",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.2.0/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "107ac4049e89b87329c97f8a78c1a73f3fab58977f83778ade63be2d4822f446",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.2.0",
      "size": 251010,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.2.0",
      "title": "Iji Archipelago v1.2.0 Massive Overhaul",
      "version_simple": "1.2.0",
      "world_version": "1.2.0"
    },
    "v1.2.1": {
      "created_at": "2025-07-29T16:49:47Z",
      "description": "## Features\r\n- Brought back an old option that allows you to visit Sector Z and/or obtain the null driver regardless of your goal.\r\n- Reduced maximum ribbon count from 500 to 100.\r\n- Ribbon items that exceed your goal requirement are now marked as useful instead of progression\r\n- Duplicates of progression items are now marked as useful instead of as progression\r\n\r\n## Bug Fixes\r\n- Fixed an invalid text id for a logbook in Sector 9\r\n- Added a failsafe message to display when interacting with a logbook that has an invalid text id\r\n- Fixed a logbook in Sector 3 not showing up on the UT map page\r\n- Fixed the first rocket launcher in Sector X not being a location when all_instances is chosen for basic_weapon_locations option.\r\n- Fixed Iosa defaulting to being dead during Sector X when creating a new save file.\r\n- Fixed a visual bug on the main menu stats display when more than 9 of a given stat item was received\r\n- Fixed an issue that forced you into one of the bad endings regardless of what decisions you made.\r\n- Fixed an issue that prevented you from skipping logbook text after warping to a checkpoint.\r\n\r\nThe v1.2.1 Game Client is compatible with multiworlds generated using the v1.2.0 apworld",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.2.1/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "93c917dd16ddcb81d12a4bf76eea1da31ca56f161a26702edd930319936ce25c",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.2.1",
      "size": 253097,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.2.1",
      "title": "Iji Archipelago v1.2.1",
      "version_simple": "1.2.1",
      "world_version": "1.2.1"
    },
    "v1.2.2": {
      "created_at": "2025-08-07T22:28:40Z",
      "description": "Fixed an issue with how v1.2.1 filled slot data that caused generation to fail.\r\nOnly the apworld was changed from v1.2.1",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.2.2/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "7f1d7d5f93d72873b31befb4c0d32c34d2ced6e2b92e36e0e1be760c71b022c8",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.2.2",
      "size": 314513,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.2.2",
      "title": "Iji Archipelago v1.2.2 Apworld Hotfix",
      "version_simple": "1.2.2",
      "world_version": "1.2.2"
    },
    "v1.2.3": {
      "created_at": "2025-08-07T22:28:40Z",
      "description": "AKA I forgot once again to do my due diligence before releasing stuff\r\n- Fixes an issue with generation when choosing to add one or more duplicate items in the options YAML",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.2.3/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "a6bacf59a33fb22eebbdd162f28a75bf6d3395ce07770f59c7aebb3a317c7592",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.2.3",
      "size": 253100,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.2.3",
      "title": "Iji Archipelago v1.2.3 Yet another Hotfix",
      "version_simple": "1.2.3",
      "world_version": "1.2.3"
    },
    "v1.2.4": {
      "created_at": "2025-08-23T02:58:24Z",
      "description": "## MAJOR BUG FIXES\r\n- Fixed an issue with the cake at the end of Sector Y, which previously made seeds with Sector Y as a goal unwinnable.\r\n- Fixed a softlock that occurred when opening security doors after warping to a checkpoint.\r\n\r\n## MINOR BUG FIXES\r\n- Fixed the Main Menu being unresponsive and softlocking the player when entering the Tertiary Weapons Controls submenu before connecting to a server.\r\n- Fixed the Extras Menu having one too many selections.\r\n- Fixed an issue where obtaining Posters or Ribbons while in the same sector as your goal would not open the final door if the door is off-screen.\r\n- Fixed a minor visual bug where hovering over the Komato stat while deleveling stats would display the Tasen bar overlay instead.\r\n- Cleaned up obsolete story flags.\r\n- Fixed Banana Gun, Massacre, and Null Driver flags not saving when exiting the game.\r\n  - Now, if you obtain any of them, and close the game, you will retain them when reloading your save file.\r\n\r\n## QUALITY OF LIFE FEATURES\r\n- Obtaining a weapon gives you permanent access to that weapon, as long as you have the proper stats allocated to use it.\r\n  - If your stats drop below what you need to use a weapon, you'll temporarily lose access to it, and you'll regain it automatically when your stats are increased back up.\r\n  - This applies to both Basic weapons and Combined weapons.\r\n  - Deleveling your stats or rebooting your nanofield will no longer cause your weapons to drop on the ground.\r\n- If you obtain the Resonance Reflector at the end of Sector X, you will permanently gain access to the Reflector, and you won't lose it if your crack stat ever drops below 4.\r\n- Added an invisible object in Sector 8 to make obtaining the Supercharge much more consistent and less frustrating.\r\n- After firing the Null Driver for the first time, you will permanently have 99 points at the start of every sector you play.\r\n\r\n## KNOWN BUGS\r\n- There is still a visual bug that can occur when loading into a sector, where the weapon sprites on the hud are incorrect. switching weapons causes the bug to quickly disappear.\r\n\r\nNo changes have been made to the .apworld since v1.2.3, so if you are updating from the previous version, you'll only need the game client.",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.2.4/iji.apworld",
      "has_manifest": false,
      "hash_sha256": "a6bacf59a33fb22eebbdd162f28a75bf6d3395ce07770f59c7aebb3a317c7592",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.2.4",
      "size": 253100,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.2.4",
      "title": "Iji Archipelago v1.2.4 - Permanent Weapons (Among Other Things)",
      "version_simple": "1.2.4",
      "world_version": "1.2.4"
    },
    "v1.2.5": {
      "created_at": "2025-08-23T02:58:24Z",
      "description": "## QOL Features\r\n- Added four new item groups, to assist in hinting next logical progression items:\r\n  - Sector Access [Contains the Progressive Sector Access item and all of the Sector Access items for specific sectors]\r\n  - Stat [Contains each of the seven Stat items]\r\n  - Weapon Stat [Contains specifically Tasen Stat and Komato Stat]\r\n  - Special Trait [Contains each of the seven Special Trait items]\r\n- Added a display in the Sector Select menu that shows how much Health you are logically expected to have to play the sector, according to your Health Balancing options.\r\n- Retrying a boss fight will now set your ammo back to what it was when you first entered the room.\r\n\r\n## Bug Fixes\r\n- Fixed a major bug that would break the cutscene at the start of a boss fight when retrying or respawning, resulting in a softlock.\r\n- The debug_item and out_of_order_sectors options are now passed in to slot data, so Universal Tracker can properly regen worlds that enable them.\r\n- Fixed the location of a map marker in the UT map page for a few logbooks in Sector 1.\r\n\r\n## Other\r\nAdded archipelago.json manifest file to the root folder to be compatible with AP version 0.7.0",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.2.5/iji.apworld",
      "has_manifest": true,
      "hash_sha256": "7f62fdde479fb58383deeef1578f42e8518151e1b4ae85094f92801e61262a24",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.2.5",
      "minimum_ap_version": "0.6.4",
      "size": 253554,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.2.5",
      "title": "Iji Archipelago v1.2.5 Just a Few QoL tweaks",
      "version_simple": "1.2.5",
      "world_version": "1.2.5"
    },
    "v1.2.6": {
      "created_at": "2026-02-05T21:04:16Z",
      "description": "Fixed an issue with slot names containing certain characters not being able to create a save file, and stalling on the connection screen\r\nFixed a small logic error in Sector 4",
      "download_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/download/v1.2.6/iji.apworld",
      "has_manifest": true,
      "hash_sha256": "208bf9bb0bfdda0189003370a137bec1add1a16beb59c1c43cd2035dd39229e5",
      "html_url": "https://github.com/Minish-Link/Iji-Archipelago/releases/tag/v1.2.6",
      "minimum_ap_version": "0.6.4",
      "size": 253561,
      "source_url": "https://api.github.com/repos/Minish-Link/Iji-Archipelago",
      "tag": "v1.2.6",
      "title": "Iji Archipelago v1.2.6",
      "version_simple": "1.2.6",
      "world_version": "1.2.6"
    }
  }
}
