{
  "flags": [],
  "game": "",
  "github": "https://github.com/SerpentAI/Archipelago",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "keymasters-2.0.1": {
      "created_at": "2025-10-29T00:51:15Z",
      "download_url": "https://github.com/silasary/Archipelago/releases/download/keymasters-2.0.1/keymasters_keep_manager.apworld",
      "has_manifest": true,
      "hash_sha256": "abce71f91b1cc9346b0dbe92ee9d0aaca098dc55c680d03655215e4a7aa4711f",
      "minimum_ap_version": "0.6.1",
      "size": 3285,
      "source_url": "https://api.github.com/repos/silasary/Archipelago",
      "tag": "keymasters-2.0.1",
      "title": "Keymaster's Keep 2.0.1",
      "version_simple": "1.0.0",
      "world_version": "1.0.0"
    },
    "kmk-0002": {
      "created_at": "2025-05-10T16:38:31Z",
      "description": "## New in this version\r\n* Players now have the option to define a configurable chance to replace keep areas with shops\r\n* Each shop has a unique name and a unique shopkeeper that will greet you and incite you to shop in their own way\r\n* Shop will have a variable number of items for sale (configurable; up to 5 per)\r\n* Shopkeepers will only part with their valuable items in exchange for specific unique relics (New progression items!) \r\n* Players can configure the chance of each shop item being forced as a progression item\r\n* An option exists to control whether or not discovering a shop will generate hints for its items\r\n\r\nFinally, a totally insane feature (as in, literal insanity required to add this):\r\n* Keymaster's Keep shops are Archipelago item aware and will show a unique description for each one\r\n* For this initial release, every item from core-verified APWorlds have descriptions (over 12,000 items!)\r\n* The game also has a pool of interesting descriptions for items it doesn't know\r\n* Future updates will gradually add item descriptions support for popular / stable custom APWorlds\r\n\r\nNote: Screenshots are taken from Archipelago 0.6.2 (with the new UI), but the APWorld works just fine with 0.6.1.\r\n\r\n![image](https://github.com/user-attachments/assets/c49d66d0-fea6-421c-ad71-80fc1b91cf16)\r\n![image](https://github.com/user-attachments/assets/bcb61f4e-b113-434c-a0e4-5bd2307fce75)\r\n![image](https://github.com/user-attachments/assets/8f41f0ca-d707-4cd5-a996-1c13c222b8c1)\r\n\r\n\r\n## Keymaster's Keep\r\nKeymaster's Keep is a dynamic, multi-game objective / challenge generator that seamlessly integrates with a thematic Archipelago randomizer. In other words, you have a typical Archipelago randomizer with goals, finite locations, progression items, logic etc. and Keymaster's Keep will generate and associate unique game challenges with each location. The APWorld features a plugin system to add games independently from releases, as well as a dedicated client to assist with the exploration and challenges of Keymaster's Keep.\r\n\r\n**When you play Keymaster's Keep...**\r\n* You will generate a new keep with distinct areas\r\n* A few of these areas will be unlocked from the start\r\n* The rest will be locked and will require combinations of magic keys to unlock\r\n* These magic keys are scattered throughout the multiworld\r\n* Once an area is unlocked, a set of trials for a specific game will be revealed\r\n* For each trial you complete, you will manually check it off in the client and that will correspond to a location check\r\n* Your goal will either be to collect enough artifacts of resolve to unlock a final challenge to beat or to escape the keep with a certain number of magic keys in hand.\r\n\r\nYou can find the Python files for the game implementations that used to be bundled with Keymaster's Keep here: https://github.com/SerpentAI/KeymastersKeepGameArchive\r\n\r\n![image](https://github.com/user-attachments/assets/647f9272-ef00-48bd-96cc-3e27a9317d79)\r\n![image](https://github.com/user-attachments/assets/5a466ef5-e23d-4703-a5a9-34d17c64da81)",
      "download_url": "https://github.com/SerpentAI/Archipelago/releases/download/kmk-0002/keymasters_keep_manager.apworld",
      "has_manifest": false,
      "hash_sha256": "0807fe49f0a2b56ed02a4a6907f3f12cdb4db4415c58f48d6a68fd0fc076bffb",
      "html_url": "https://github.com/SerpentAI/Archipelago/releases/tag/kmk-0002",
      "prerelease": true,
      "size": 2944,
      "source_url": "https://api.github.com/repos/SerpentAI/Archipelago",
      "tag": "kmk-0002",
      "title": "Keymaster's Keep - Release #2: The Shop Update",
      "version_simple": "2",
      "world_version": "2"
    }
  }
}
