{
  "description": "Lego Star Wars: The Complete Saga",
  "game": "Lego Star Wars: The Complete Saga",
  "github": "https://github.com/Mysteryem/Archipelago-TCS",
  "license": null,
  "manifest_fields": [
    "authors",
    "world_version",
    "minimum_ap_version"
  ],
  "versions": {
    "v0.1.0": {
      "created_at": "2025-06-25T20:22:29Z",
      "description": "This is the first public testing version of Lego Star Wars: The Complete Saga Archipelago. Expect there to be some issues.\r\n\r\nThis is mostly a port of the Roush version of the TCS manual apworld to a fully fledged apworld and client, but with a few missing items and locations added and a few logic issues fixed.\r\n\r\nThere are definitely still some logic issues due to how all 'Blaster' characters are categorized together, despite some being unable to grapple (Droideka) and despite some shooting other projectiles (Ewok), but these generally should not be a problem. If needed, the Custom Characters have been left unlocked in this testing version, which always have access to 'Blaster' abilities.\r\n\r\nA lot of the ported logic has not been double checked because it is going to be overhauled in the future, so it is possible there are additional logic issues remaining.\r\n\r\nMany desired features have yet to be implemented. The purpose of this testing version is to help get an idea of how best to implement an AP randomizer for TCS. What things work well/don't work well with the current implementation and what ideas would be good to add etc.\r\n\r\nMy recommended yaml options are to add all Episode Unlock items to `start_inventory_from_pool` and to add `R2-D2` and `C-3PO` to `local_items` due to just how much of the game is locked behind those items. When adding all Episode Unlock items to starting inventory, this puts the force ghost shop purchases in-logic immediately, which have very high prices, you may want to exclude those locations, give yourself a lot of starting `Purple Stud` items, or enter the cheat codes to unlock those characters without having to farm an unreasonable number of studs at the start.\r\n\r\nIf you don't know where the Minikits and Power bricks are, you can also add the `Minikit Detector` and `Red Brick Detector` to starting inventory. There are also guides online which detail their locations.\r\n\r\nThere is a PopTracker package that can be used with this apworld: https://github.com/Mysteryem/TCS_AP_PopTracker/releases/latest\r\n\r\nThe documentation has more details on the current issues:\r\nhttps://github.com/Mysteryem/Archipelago-TCS/blob/main/lego_star_wars_tcs/docs/en_Lego%20Star%20Wars%20The%20Complete%20Saga.md\r\n\r\nSetup guide:\r\nhttps://github.com/Mysteryem/Archipelago-TCS/blob/main/lego_star_wars_tcs/docs/setup_en.md",
      "download_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/download/v0.1.0/lego_star_wars_tcs.apworld",
      "has_manifest": false,
      "hash_sha256": "0f98509bd6265fea27bb6bd0d97da040668c4429b837b32bab3ad6809452a105",
      "html_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/tag/v0.1.0",
      "prerelease": true,
      "size": 68647,
      "source_url": "https://api.github.com/repos/Mysteryem/Archipelago-TCS",
      "tag": "v0.1.0",
      "title": "Initial WIP testing release, v0.1.0",
      "version_simple": "0.1.0",
      "world_version": "0.1.0"
    },
    "v0.2.0": {
      "created_at": "2025-06-29T01:39:57Z",
      "description": "The client should be compatible with seeds generated with apworld version 0.1.0.\r\n### New options\r\n- Added option for the number of Minikits required to goal. (no tracker update to support values other than `270` yet).\r\n- Added option to specify Minikit bundle size. The current options are `individual`/`1`, `2`, `5`, `10`. (no tracker update yet to support sizes other than 5 yet).\r\n\r\n### Fixes\r\n- Fixed True Jedi checks sending at unusual times.\r\n- Fixed 5-5 and 5-6 being partially swapped in the code.\r\n5-5 was sending 5-6 completion and vice versa, and probably some other issues with these two levels. Old seeds where either 5-5 or 5-6 have already been completed might still have some issues even with the updated client.\r\n- Fixed in-game messages overwriting some of the text in the Extras menu.\r\n- Fixed missing Sith logic for 5-5 minikits.\r\n\r\n### Other changes\r\n- Reworked some of the client->game and client->server connection flow to give better feedback to users about what their next steps should be.\r\n- A message is now displayed in-game when the client is fully connected and running.\r\n- Add more handling to prevent an edge-case where save data could roll back and delete connection info from the save data.\r\n- Internal preparations for being able to disable levels and other locations from being included in a seed.",
      "download_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/download/v0.2.0/lego_star_wars_tcs.apworld",
      "has_manifest": false,
      "hash_sha256": "6146ede8240ef70a7844fa4c5d4a31bca6e8023ab4f1f93b171d7ff09b14b64d",
      "html_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/tag/v0.2.0",
      "prerelease": true,
      "size": 73434,
      "source_url": "https://api.github.com/repos/Mysteryem/Archipelago-TCS",
      "tag": "v0.2.0",
      "title": "Bug fixes and minikit goal/bundle options, v0.2.0",
      "version_simple": "0.2.0",
      "world_version": "0.2.0"
    },
    "v0.2.1": {
      "created_at": "2025-06-29T21:15:55Z",
      "description": "The client should be compatible with seeds generated with older apworld versions.\r\n\r\nThis is a hotfix release to fix two bugs found in v0.2.0.\r\n\r\n### New options\r\n- Added option for the number of Minikits required to goal..\r\n- Added option to specify Minikit bundle size. The current options are `individual`/`1`, `2`, `5`, `10`.\r\n\r\n### Fixes\r\n- Fixed True Jedi checks sending at unusual times.\r\n- Fixed 5-5 and 5-6 being partially swapped in the code.\r\n5-5 was sending 5-6 completion and vice versa, and probably some other issues with these two levels. Old seeds where either 5-5 or 5-6 have already been completed might still have some issues even with the updated client.\r\n- Fixed in-game messages overwriting some of the text in the Extras menu.\r\n- Fixed missing Sith logic for 5-5 minikits.\r\n\r\n### Fixes from v0.2.1\r\n- Fixed `Purchase Score x_` locations not sending.\r\n- Fixed the number of minikits required to goal resetting when saving a new game to a save file for the first time.\r\nReconnecting to the server would fix this issue. The client defaults to requiring millions of minikits to goal after a reset, so this would not have caused the goal to send by mistake.\r\n\r\n### Other changes\r\n- Reworked some of the client->game and client->server connection flow to give better feedback to users about what their next steps should be.\r\n- A message is now displayed in-game when the client is fully connected and running.\r\n- Add more handling to prevent an edge-case where save data could roll back and delete connection info from the save data.\r\n- Internal preparations for being able to disable levels and other locations from being included in a seed.",
      "download_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/download/v0.2.1/lego_star_wars_tcs.apworld",
      "has_manifest": false,
      "hash_sha256": "7dce3785a7a3591441043750dadb46f77eaff8e1013c101c3f0d58d520ceac58",
      "html_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/tag/v0.2.1",
      "prerelease": true,
      "size": 73614,
      "source_url": "https://api.github.com/repos/Mysteryem/Archipelago-TCS",
      "tag": "v0.2.1",
      "title": "Bug fixes and minikit goal/bundle options, v0.2.1",
      "version_simple": "0.2.1",
      "world_version": "0.2.1"
    },
    "v1.0.0": {
      "created_at": "2025-07-17T02:21:01Z",
      "description": "All Chapters being included in a generated multiworld was a bit too much for most sync multiworlds. This update's main feature is allowing for only some Chapters to be enabled, allowing the overall size of the generated world to be reduced, making the apworld more suitable for sync multiworlds.\r\n\r\n### Known issues\r\n#### Bonus levels\r\n- The LEGO City and New Town bonus levels are missing their logical character ability requirements (Sith + High Jump + Blaster + Bounty Hunter)\r\n- In multiworlds with more than one TCS slot, TCS slots after the first TCS slot are missing the Gold Brick requirements for bonus levels.\r\n- Leaving the Bonuses locations disabled will avoid these issues.\r\n#### Chapter Completion Character Unlock Locations\r\n- The Chapter Completion Character Unlock Locations are currently always enabled, even when set to disabled. But if set to disabled, the client will not send the checks.\r\n- To work around this issue, always play with these locations enabled.\r\n\r\n# Important\r\n- Incompatible with multiworlds generated with apworld versions 0.x.x.\r\n- The game name has changed to correctly include the `:` in the game name, so all older YAMLs will need to be updated (there are many new options, so updating YAMLs is highly recommended regardless).\r\n\r\n# New Options\r\n\r\n### Enabled Chapters\r\n- Choose how many Chapter should be enabled (defaults to 18, which is half of the Chapters in the game) \r\n- Specify what Chapters the generator is allowed to pick (defaults to all enabled)\r\n- Additionally optionally disable all vehicle Chapters\r\n- Choose/randomize your starting Chapter (defaults to 1-1)\r\n- Specify Chapters the generator should try to always include in the generated multiworld\r\n- Tell the generator to try to enable entire episodes of Chapters at a time rather than picking completely randomly\r\n\r\n### Episode unlock requirements\r\n- Choose between whether Episodes have no unlock requirements (default) or require an \"Episode # Unlock\" item to unlock\r\n\r\n### Preferred Characters and Extras\r\n- Specify Characters and Extras that the generator should try to always include in the item pool\r\n\r\n### Expensive purchase logic\r\n- A number of Progressive Score Multiplier items will be logically expected for purchasing expensive characters/extras. The number of Progressive Score Multiplier items expected is adjustable by specifying the maximum purchase cost that is expected without any Progressive Score Multiplier items.\r\n\r\n### Required Minikits as a percentage\r\n- The required Minikits to goal can now be set to a percentage of the total (enabled by default and set to 75%)\r\n\r\n### Location toggles and a new location type\r\n- Chapter Completion character unlocks, for the Story mode characters that would normally be unlocked by completing a chapter in Story mode in vanilla, have been added (on by default, but can be disabled with a new option) \r\n- Toggle Bonus locations (levels and Indiana Jones trailer+purchase) on/off (off by default)\r\n- Toggle 'All Episodes' character purchase locations on/off (off by default)\r\n\r\n### 'All Episodes' character purchase logic\r\n- Control how 'All Episodes' character purchases unlock, the choices are unlocking all enabled Episodes, or receiving as many \"All Episodes Token\" items as there are enabled Episodes.\r\n\r\n### Start with Detectors\r\n- Start with the Minikit Detector and the Power Brick Detector (on by default).\r\n\r\n### Filler weights\r\n- Control how much of each kind of non-required item is used to fill out any remaining space in the item pool (non-required characters, non-required extras and Purple Studs)\r\n\r\n# Other\r\n- Universal Tracker support (fully YAMLless support is waiting on a bug in Universal Tracker to be fixed).\r\n\r\n# Changes\r\n- The temporarily given Story completion Gold Brick (to allow playing Free Play immediately) is now only temporarily given while inside the Chapter's door. This makes it easier to tell in-game whether a Chapter has been completed because only the Chapter name will be displayed while outside the door, if the Chapter has not been completed.\r\n- Chapter completion is now additionally written to the server's datastorage. This improves same-slot co-op behaviour and should make !collect behaviour clearer in the future.\r\n- Bonus levels now only require Gold Bricks to access. Character requirements for Bonus levels and \"Progressive Bonus Level\" items have been removed. This means that watching the Indiana Jones trailer and sending the Purchase Indiana Jones location check are now Sphere 1 locations.\r\n\r\n# Fixes\r\n- Fix chapters not completing when the Completion location has been !collect-ed.\r\n- Fix A New Hope completion only sending when completing LEGO City.\r\n- 'BLASTER' logic has been removed from characters that cannot grapple to prevent logic issues\r\n- IG-88 and 4-LOM have been removed from the 'DROID_OR_FLY' logic group, which has been renamed to 'HOVER'.\r\n- HOVER requirement has been added to 3-4 Minikits.\r\n- Red Brick Detector has been renamed to Power Brick Detector.\r\n- Removed the VEHICLE_TIE ability from the Imperial Shuttle.\r\n- The in-game message display should be even more robust now, hopefully it will work 100% of the time now.",
      "download_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/download/v1.0.0/lego_star_wars_tcs.apworld",
      "has_manifest": false,
      "hash_sha256": "3cdb1e28e610945ab5e1acbead2584cf204a292a6820a3db516772dab1d9b5be",
      "html_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/tag/v1.0.0",
      "prerelease": true,
      "size": 90336,
      "source_url": "https://api.github.com/repos/Mysteryem/Archipelago-TCS",
      "tag": "v1.0.0",
      "title": "v1.0.0 - The Sync friendly update",
      "version_simple": "1.0.0",
      "world_version": "1.0.0"
    },
    "v1.0.1": {
      "created_at": "2025-07-22T12:59:49Z",
      "description": "# Known issues\r\n- Automatically reconnecting to the server after an unintended disconnect will cause the client to lose previously received items.\r\nTo fix this, deliberately disconnect by clicking the Disconnect button, and then reconnect to the server.\r\n- The host of multiworlds containing Lego Star Wars: The Complete Saga must be running Archipelago 0.6.2 or newer.\r\n\r\n# Client features\r\n- The client now updates the current level and the current cantina room in the Archipelago server's datastorage, for the PopTracker pack to be able to use to automatically switch tabs.\r\n\r\n# Fixes\r\n- Fix Chapter Completion Character Unlock locations being created even with the option set to false\r\n- Fix a very small chance that the client would fail to disconnect from the server when intentionally disconnecting due to a multiworld seed mismatch with the current save file, or in a few other cases were it intentionally disconnects from the server\r\n- Fix errors, raised to due invalid option combinations, failing to include the name of the player with invalid options\r\n\r\n# Logic fixes\r\n- Fix LEGO City and New Town logic missing their ability requirements\r\n- Fix Gold Brick event requirements being removed for TCS slots after the first\r\n- Add High Jump ability to Captain Tarpals\r\n- Add Blaster requirement to 1-2 minikits\r\n- Add High Jump requirement to 3-3 minikits\r\n- Add High Jump OR Hover requirement to 3-3 Power Brick\r\n\r\n# Other\r\n- Added MIT license\r\n- Internal changes to how the client replaces in-game text, in preparation for a future release\r\n\r\n# Webhost/Options\r\n- Added option groups\r\n- Added a display name for each option\r\n- Added choices to the Most Expensive Purchase With No Score Multiplier option, in addition to being able to choose any value within the range\r\n- Documentation updates, including adding maybejess and Roushmore to credits\r\n- Added item groups\r\n- Added location groups",
      "download_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/download/v1.0.1/lego_star_wars_tcs.apworld",
      "has_manifest": false,
      "hash_sha256": "67ebf37004301c555e1a05187f47288c47159d16ac8ed745e3978bbf02c8de24",
      "html_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/tag/v1.0.1",
      "prerelease": true,
      "size": 97356,
      "source_url": "https://api.github.com/repos/Mysteryem/Archipelago-TCS",
      "tag": "v1.0.1",
      "title": "v1.0.1",
      "version_simple": "1.0.1",
      "world_version": "1.0.1"
    },
    "v1.1.2": {
      "created_at": "2025-08-13T00:46:06Z",
      "description": "The client should be backwards compatible with seeds generated with apworld versions 1.x.x.\r\n\r\n## Known Issues (fixed in v1.1.3)\r\n- The client errors when the connected slot does not have the Defeat Bosses goal enabled\r\n- The client errors when checking for bonus level completions\r\n\r\n# Important changes\r\nThe Minikits goal no longer sends immediately and must be turned in by using the Minikits display in the outside area of the Cantina, once enough Minikits to goal have been acquired.\r\n\r\n# Features\r\n## Defeat Bosses Goal\r\n- Require defeating a number of bosses as part of your goal\r\n- The chapter must be completed for defeating the boss to count\r\n  - This may be changed in the future, but, for now, to keep the client simpler, defeating a boss is tied to completing the chapter\r\n- Choose which boss chapters can be selected as counting towards your goal\r\n- Choose how many boss chapters will exist in your game\r\n- Choose whether individual boss chapters counts towards the goal, or whether individual boss characters count towards the goal\r\n- Available bosses:\r\n  - Darth Maul (1-6) # Darth Maul\r\n  - Zam Wesell (2-1) # Bounty Hunter Pursuit\r\n  - Jango Fett (2-2) # Discovery On Kamino\r\n  - Jango Fett (2-4) # Jedi Battle\r\n  - Count Dooku (2-6) # Count Dooku\r\n  - Count Dooku (3-2) # Chancellor In Peril\r\n  - General Grievous (3-3) # General Grievous\r\n  - Anakin Skywalker (3-6) # Darth Vader (an extra option will make Anakin Skywalker count as Darth Vader instead)\r\n  - Death Star (4-6) # Rebel Attack\r\n  - Darth Vader (5-4) # Dagobah\r\n  - Darth Vader (5-5) # Cloud City Trap\r\n  - Boba Fett (5-6) # Betrayal Over Bespin\r\n  - Rancor (6-1) # Jabba's Palace\r\n  - Boba Fett (6-2) # The Great Pit Of Carkoon\r\n  - Darth Sidious (6-5) # Jedi Destiny\r\n  - Death Star II (6-6) # Into The Death Star\r\n## Other\r\n- Enabled chapter info and goal info can be found in the first 3 pre-unlocked hints in the hints shop\r\n- The text that appears when standing in front of unlocked Episode doors show the status of all bosses to defeat in that Episode\r\n- The pause screen shows your goal progress (this replaces Custom Character 2's name showing your goal progress)\r\n- Custom Characters have been added as items that can be shuffled into the multiworld under the names `STRANGER 1` and `STRANGER 2`\r\n  - They logically provide the Blaster ability because blasters are always unlocked in the Custom Character Creator\r\n- Purchase locations in the shop that are !collect-ed will purchase themselves automatically for free\r\n  - If you are in the Cantina when the locations get !collect-ed, you will need to reload the Cantina for this to take effect\r\n- Gold Bricks for enabled locations and Power Bricks progress is now saved to and loaded from AP, this allows them to synchronize in same-slot co-op, and the tracker can use this to display game progress\r\n- The Minikit goal can be disabled by setting the number of Minikits to Goal to zero\r\n  - At least one goal must be enabled in your yaml otherwise it will not generate\r\n  - Minikit items will become filler items when the goal is disabled. It is recommended to set the Minikit Bundle Size to 10 in that case.\r\n- Minikit locations can now be disabled\r\n  - The Minikit goal can still be used with Minikit locations disabled, but the Minikit Bundle Size will be forced to 10\r\n- True Jedi locations can now be disabled\r\n- Previously, the generator would always try to add at least as many characters/extras to the item pool as enabled locations that unlock characters/extras in vanilla. This behaviour of the generator can now be toggled off by setting the Filler Reserve options to False\r\n- Yaml-less Universal Tracker support has been re-enabled. This requires Universal Tracker version 0.2.12 or newer.\r\n\r\n# New Options\r\n- Defeat Bosses Goal Amount (defeat_bosses_goal_amount)\r\n- Enabled Bosses Count (enabled_bosses_count)\r\n- Allowed Bosses (allowed_bosses)\r\n- Only Count Unique Bosses (only_unique_bosses_count_towards_goal)\r\n- Enable Minikit Locations (enable_minikit_locations)\r\n- Enable True Jedi Locations (enable_true_jedi_locations)\r\n- Filler Reserve: Characters (filler_reserve_characters)\r\n- Filler Reserve: Extras (filler_reserve_extras)\r\n\r\n# Fixes\r\n- Fix auto-reconnect clearing items without also clearing the client expected item index\r\n- Clients will show a warning and disable some same-slot co-op/tracker features when connecting to AP servers older than AP 0.6.2, preventing disconnects when completing Chapters\r\n- Fix starting Jedi being chosen, but not actually added to start inventory\r\n- After loading into the Cantina as Qui-Gon Jinn and Obi-Wan Kenobi, if either are not unlocked, the client will reload the Cantina and replace the locked characters with randomly chosen unlocked characters.\r\n- Fix Universal Tracker thinking that no characters had any of the abilities of your starting characters (including your starting characters)\r\n\r\n# Logic\r\n## Fixes\r\n- Add shortie requirement to 2-4 minikits and 5-4 minikits\r\n- Remove Imperial ability from Imperial Spy\r\n\r\n# Other\r\n- The options now mention that starting with 5-3 and open Episodes will also unlock 6-6 and vice versa\r\n- The DxWnd setup guide has been updated again to mention the issues of running the Steam version of TCS through DxWnd when TCS is on a different drive to your Steam installation\r\n- A few more characters with high run speeds have been given the Useful item classification\r\n- The client now replaces Custom Character 1's lightsaber with a blaster in preparation of future apworld versions where it won't be guaranteed to always start with a Jedi unlocked. The Custom Characters Creator cannot select lightsaber weapons if no Jedi are unlocked, but it can always select blaster weapons, even if no Blaster characters are unlocked.\r\n- The starting chapter, enabled episodes/chapters, enabled bonuses, enabled bosses and apworld version are now written to the spoiler log",
      "download_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/download/v1.1.2/lego_star_wars_tcs.apworld",
      "has_manifest": false,
      "hash_sha256": "6a274367218280ebbbacd7fe952667469bba3a3dd5e709804b2aea45ad7d265f",
      "html_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/tag/v1.1.2",
      "prerelease": true,
      "size": 116559,
      "source_url": "https://api.github.com/repos/Mysteryem/Archipelago-TCS",
      "tag": "v1.1.2",
      "title": "v1.1.2 - Defeat Bosses Goal",
      "version_simple": "1.1.2",
      "world_version": "1.1.2"
    },
    "v1.1.3": {
      "created_at": "2025-08-13T14:15:20Z",
      "description": "Client-only fixes following the v1.1.2 release\r\n\r\n- Fix client error when the connected slot does not have the Defeat Bosses goal enabled\r\n- Fix client error when checking for bonus level completions",
      "download_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/download/v1.1.3/lego_star_wars_tcs.apworld",
      "has_manifest": false,
      "hash_sha256": "5df9c6c19550fe8da51a988dc0533c349c4006246415763950d9719b28d1f05e",
      "html_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/tag/v1.1.3",
      "prerelease": true,
      "size": 116581,
      "source_url": "https://api.github.com/repos/Mysteryem/Archipelago-TCS",
      "tag": "v1.1.3",
      "title": "v1.1.3 - Defeat Bosses Client hotfix",
      "version_simple": "1.1.3",
      "world_version": "1.1.3"
    },
    "v1.2.0": {
      "created_at": "2025-12-18T23:05:23Z",
      "description": "The client should be almost compatible with all 1.x.x versions of the APWorld though it is recommended to use the latest v1.1.x client with multiworlds generated with v1.1.x of the APWorld.\r\n\r\nWhat won't work when connecting the v1.2.x client to a v1.1.x slot, is that any non power brick Extras, such as Extra Toggle and Beep Beep will not be unlockable, because the client now expects them to be AP items you can receive.\r\n\r\nArchipelago version 0.6.1 or newer is required to use this APWorld, thought the latest stable release of archipelago is recommended (especially 0.6.3 or newer if you are generating a multiworld with priority locations due to the *Deprioritized* item classification existing that Lego Star Wars: TCS takes advantage of).\r\n\r\nKnown Issues:\r\n- Worlds with 'All Episodes' character purchases enabled and set to unlock after receiving 6 Episode Completion Tokens are erroneously starting with 5 Episode Completion Tokens, with only 1 in the item pool to find. There should be one in the pool for every 6 enabled chapters (rounded to the nearest 6), but v1.2.0's code is counting the number of enabled chapters wrong.\r\n\r\n# Additions\r\n## Death Link\r\n- Separate Amnesty options for normal levels vs most top-down vehicle levels where it can be easier to die\r\n- Yaml option as well as a client command to toggle on/off `/toggle_death_link`\r\n- Option to permanently lose studs when receiving a death (it's not possible for studs to drop on death currently), plus a further option to have that studs loss scale with score multipliers\r\n- Receiving Deaths can be a little weird or delayed in some cases\r\n- Some levels that instantly respawn the player at a checkpoint do not internally count as a death by the game, so will not send deaths, such as in Gunship Cavalry (Original)\r\n\r\n## More Goals\r\n- Require completing a percentage of levels (chapters and bonus levels)\r\n- Require collecting 7/7 Kyber Brick items from the item pool (pretending to be like Chaos Emeralds)\r\n- Require completing a Goal Chapter that requires completing all other goals to unlock (in addition to the usual requirement to access the chapter)\r\n- Imperial Spy in 4-3 has been added to the Defeat Bosses Goal\r\n- Minikits goal can now be set to complete automatically instead of needing to visit the Minikits display in the Cantina's junkyard (useful for when you have a Goal Chapter enabled)\r\n\r\n## True Jedi Options\r\n- Easier True Jedi option that sets True Jedi to Story requirements\r\n- Option to scale True Jedi requirements with acquired Score Multipliers, preventing True Jedi from becoming trivial with a few Score Multipliers\r\n- Note that Studs items received while in a level now contribute to True Jedi\r\n\r\n## Ridesanity\r\n- Locations for riding each unique animal/turret/vehicle\r\n- Notably adds more checks to LEGO City and New Town due to their unique vehicles\r\n\r\n## Non Power Brick Extras\r\n- Extras that are unlocked in the shop from the start are now locations to check by default, this can be disabled in the options\r\n\r\n## Junk Items\r\nNew junk filler items have been added:\r\n- Power Up\r\n- Blue Stud\r\n- Gold Stud\r\n- Silver Stud\r\n\r\nPower Ups wait in a queue if you receive more than one, using up a Power Up and refreshing the duration just before the current Power Up runs out. Power Ups will only activate in Free Play levels.\r\nStuds received while inside a Free Play level will be added to your in-level stud counts, therefore contributing to True Jedi progress\r\n\r\n## Miscellaneous\r\n- Option to restore High Jump height in Original trilogy levels and other levels that cap High Jump height\r\n- The in-game Goal progress display on the pause screen now cycles through your goals\r\n- The pre-unlocked hints in the Shop have been updated to include information on the new Goal options that are enabled for your slot\r\n- Added archipelago.json manifest\r\n\r\n## Documentation\r\n- Linux setup guide by Flit\r\n\r\n# Changes\r\n\r\n## Yaml changes\r\n- Non Power Brick Extras are shuffled by default\r\n- `Extra Toggle` is added to the Preferred Extras option in new template yamls\r\n- `All Episodes Token` has been renamed to `Episode Completion Token`\r\n- New junk items can be specified in the Junk Filler Weights\r\n\r\n## Items\r\n- `All Episodes Token` has been renamed to `Episode Completion Token`, additionally, you always need 6 and will start with those that were not added to the pool due to not having all Chapters enabled\r\n\r\n# Fixes\r\n- Universal Tracker support should be 100% accurate now (though be aware that 'deferred events' support has not been added, so it will currently assume you've beaten every level that is in logic and collected every Gold Brick that is in logic)\r\n- Fixed rare case where Universal Tracker's local generation could fail if the world had only barely enough locations to fit all items\r\n- Fixed missing Bounty Hunter or Imperial logic for 4-1 Power Brick\r\n- Fixed missing Shortie requirement for 5-2 minikits\r\n- Fixed missing Astromech requirement for 6-5 minikits",
      "download_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/download/v1.2.0/lego_star_wars_tcs.apworld",
      "has_manifest": true,
      "hash_sha256": "ff525b7085ece52f8c6bf62bb3f6aa77ff9fe110f9fe84529ad25969178b86d8",
      "html_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/tag/v1.2.0",
      "minimum_ap_version": "0.6.1",
      "prerelease": true,
      "size": 166979,
      "source_url": "https://api.github.com/repos/Mysteryem/Archipelago-TCS",
      "tag": "v1.2.0",
      "title": "v1.2.0 Death Link - More Goals - True Jedi Options - Ridesanity",
      "version_simple": "1.2.0",
      "world_version": "1.2.0"
    },
    "v1.2.1": {
      "created_at": "2025-12-19T14:30:56Z",
      "description": "This is a hotfix for [v1.2.0](https://github.com/Mysteryem/Archipelago-TCS/releases/tag/v1.2.0), go there to see the full release notes.\r\n\r\n# Fixes\r\n- Fix too many of the 6 Episode Completion Tokens being put into starting inventory when 'All Episodes' character purchases are enabled and require Episode Completion Tokens to unlock.\r\n\r\n# Documentation\r\n- Direct mentioning of Purple Studs has been changed to refer to all types of Stud items now that Gold, Silver and Blue studs have been added as AP items.\r\n- Ridesanity locations are mentioned in the main documentation as optional locations",
      "download_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/download/v1.2.1/lego_star_wars_tcs.apworld",
      "has_manifest": true,
      "hash_sha256": "25ac5f08ca6c514ee78e8da2554d3176f2a63b0121b7d86b21d57e221a32c2f1",
      "html_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/tag/v1.2.1",
      "minimum_ap_version": "0.6.1",
      "prerelease": true,
      "size": 167157,
      "source_url": "https://api.github.com/repos/Mysteryem/Archipelago-TCS",
      "tag": "v1.2.1",
      "title": "v1.2.1 - Fix Episode Completion Tokens",
      "version_simple": "1.2.1",
      "world_version": "1.2.1"
    },
    "v1.3.0": {
      "created_at": "2026-01-05T21:23:41Z",
      "description": "## Incompatible with older multiworlds\r\nThe v1.3.0 client is not compatible with older multiworlds due to the added Universal Tracker integration.\r\n\r\nI will try to figure out a way that the client can skip running the Universal Tracker integration when it is connecting to a multiworld generated with an older, but still compatible, apworld version than the client, that could have different logic, while still forcing Universal Tracker, when run separately from the client, to entirely reject version mismatches.\r\n\r\n## Renamed Options\r\n\r\n`enable_chapter_completion_character_unlock_locations` has been renamed to `enable_story_character_unlock_locations` because the missing Story character unlock locations have been added to Bonus levels, e.g. completing the A New Hope Bonus level unlock Darth Vader and C-3PO in vanilla if they are not already unlocked.\r\n\r\nStory Character Unlock locations have been renamed from \"Chapter\" to \"Level\", e.g. `Chapter Completion - Unlock Chewbacca` is now `Level Completion - Unlock Chewbacca`.\r\n\r\nCharacter purchase locations names, that require completing a Chapter to unlock, now include the Episode and Chapter numbers of the Chapter in the location name, like Extra purchase locations, e.g. `Purchase Droideka` is now `Purchase Droideka (1-1)`.\r\n\r\n## Chapter Unlock Items\r\n\r\nThe Chapter Unlock Requirement option can now be set to Chapter Item to allow Chapters to unlock when receiving an unlock item specific to that Chapter, e.g. `1-3 Unlock` unlocks Episode 1 - Chapter 3 - Escape From Naboo, instead of only unlocking once the Story characters for the chapter have been received (assuming Episode 1 is unlocked).\r\n\r\nThe logic for this mode is often overly restrictive because it expects you to have characters with *all* the abilities of the Story characters for a Chapter before you can *logically* get any checks within the Chapter, so you can often get some checks in a Chapter out-of-logic.\r\n\r\nThe logic for Chapters with Hat Machines will additionally allow characters with the abilities the Hat Machines in that Chapter provide, instead of requiring having at least one character that can wear hats (and carry that hat to where the hat's ability is needed).\r\n\r\n## Customisable Item Classification Colours, Player Name Colours and Location Name Colours\r\n\r\nItems in in-game messages when receiving/sending items are now given a colour depending on their classification.\r\n\r\nPlayer names are also given a colour to make them stand out and location names can be given a colour if desired.\r\n\r\nEach of the colours are configurable in the options, though there is only a limited list of colours that can be chosen. You can see what each of the colours look like by entering `/color_test` in the game client while connected to a server.\r\n\r\nThe default colours try to match the default colours used in the client, except player names are mint green and location names are white.\r\n\r\n## Item names in Shops\r\n\r\nThe purchase locations in the Characters shop and Extras shop now display the names of the items and the players the items are for. The items will be displayed using colours depending on the classification of the items.\r\n\r\nTrap items in the shop may use fake names and pretend to be progression items until purchased. Fake item names for various games are borrowed from Sonic Adventure 2: Battle when it is present.\r\n\r\n## Universal Tracker Integration\r\n\r\nIf you have Universal Tracker installed, the Lego Star Wars: The Complete Saga Client will load Universal Tracker within the client\r\n\r\n## Misc Logic Fixes\r\n\r\n- Remove High Jump requirements from Original Trilogy minikits\r\n- Remove Imperial requirement from 6-1 Minikits due to the Hat Machine\r\n- Remove Bounty Hunter requirement from 6-1 Minikits due to the Hat Machines\r\n- Fix missing Bounty Hunter requirement for 4-2 Minikits\r\n- Fix missing Sith requirement for 6-4 Power Brick\r\n\r\n## Full changelog\r\n\r\nFix nondeterministic order of item pool and starting inventory\r\n\r\nInherit the base DeathLink option's docstring\r\n\r\nGeneration performance improved by rewriting the internal logic system\r\nto be just as fast for a character with loads of abilities as a\r\ncharacter with only very few abilities\r\n\r\nRemove High Jump requirements from Original Trilogy minikits - High Jump\r\ndoes not work in Original Trilogy levels, so I have no idea why this was\r\never required.\r\n\r\nRemove Imperial requirement from 6-1 Minikits due to the Hat Machine\r\n\r\nRemove Bounty Hunter requirement from 6-1 Minikits due to the Hat\r\nMachines\r\n\r\nAdd an option to lock Chapters behind Chapter Unlock items\r\nThe logic expects the player to have characters with all the same\r\nabilities as the Story characters for that chapter, excluding some\r\nchapter-specific abilities, when not relevant to the chapter in\r\n question, such as being able to wear hats.\r\n\r\nIntegrate Universal Tracker within the client (when Universal Tracker is\r\nan installed apworld)\r\n\r\nAdd Level Completion Story Character Unlock locations for Bonus levels\r\nand rename the locations to \"Level Completion\" from \"Chapter Completion\"\r\n\r\nFix missing Bounty Hunter requirement for 4-2 Minikits\r\n\r\nFix missing Sith requirement for 6-4 Power Brick\r\n\r\nAdd Slave 1 as an AP item\r\n\r\nRemoved forced starting with a Jedi and Protocol Droid\r\nJedi and Protocol Droid logic has been added where applicable to\r\nchapters that do not feature characters with those abilities in Story\r\nmode\r\n\r\nAdded the episode and chapter numbers to shop purchase locations that\r\nrequire completing a specific chapter to unlock\r\n\r\nAdd a chance for Trap classification items (excluding those with other\r\nclassification flags) in the shop to display fake item names instead of\r\nthe trap name\r\n\r\nAdd configurable item classification, player name and location name\r\ncolours\r\n\r\nUpdates to documentation and option docstrings",
      "download_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/download/v1.3.0/lego_star_wars_tcs.apworld",
      "has_manifest": true,
      "hash_sha256": "fd68bb3e961248dfec65aba0abbb65c8f790073ca1894992ffc9fb9aaadcdb52",
      "html_url": "https://github.com/Mysteryem/Archipelago-TCS/releases/tag/v1.3.0",
      "minimum_ap_version": "0.6.1",
      "prerelease": true,
      "size": 187492,
      "source_url": "https://api.github.com/repos/Mysteryem/Archipelago-TCS",
      "tag": "v1.3.0",
      "title": "v1.3.0 Chapter Unlock Items, Item names in Shops, Universal Tracker client integration, misc. logic fixes",
      "version_simple": "1.3.0",
      "world_version": "1.3.0"
    }
  }
}
