{
  "description": "",
  "flags": [
    "after_dark"
  ],
  "game": "Library of Ruina",
  "github": "https://github.com/Az-LastPenguin/LORAP",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "v0.1": {
      "created_at": "2025-02-19T23:55:56Z",
      "description": "This is the first public beta of LORAP mod, made specifically for testing. In case you did not read the disclaimer on the mod's page: **DO NOT USE THIS FOR ACTUAL RUNS, ONLY FOR TESTING RUNS SPECIFICALLY MADE TO TEST THIS MOD**. It is unfinished.",
      "download_url": "https://github.com/Az-LastPenguin/LORAP/releases/download/v0.1/lor.apworld",
      "has_manifest": false,
      "hash_sha256": "d81fc6ceca6daf8233e25b5dc070ce64794101f2f66c878b3070bfb2a23071df",
      "html_url": "https://github.com/Az-LastPenguin/LORAP/releases/tag/v0.1",
      "prerelease": true,
      "size": 10075,
      "source_url": "https://api.github.com/repos/Az-LastPenguin/LORAP",
      "tag": "v0.1",
      "title": "v0.1",
      "version_simple": "0.1",
      "world_version": "0.1"
    },
    "v0.1.1": {
      "created_at": "2025-02-19T23:55:56Z",
      "description": "This is the public beta of LORAP mod, made specifically for testing. In case you did not read the disclaimer on the mod's page: DO NOT USE THIS FOR ACTUAL RUNS, ONLY FOR TESTING RUNS SPECIFICALLY MADE TO TEST THIS MOD. It is unfinished.\r\n\r\nAdditions:\r\n-Every book that has a check can now only drop once (less useless book bloat, yay), also, \"Resolvable rewards\" in the invitation screen now only shows not yet obtained books with checks\r\n-Every reception with all books found are also marked with a checkmark\r\n-Combat Page exclusiveness is GONE\r\n\r\nChanges:\r\n-Changed booster pack drops generation just a bit\r\n-Changed custom save files folder (for better organization)\r\n\r\nFixes:\r\n-Fixed some receptions not unlocking and weird checks (I hope)\r\n-Fixed Abno Suppressions not giving any checks\r\n-Fixed save system (I hope)",
      "download_url": "https://github.com/Az-LastPenguin/LORAP/releases/download/v0.1.1/lor.apworld",
      "has_manifest": false,
      "hash_sha256": "2af62cd0bcab4e523d919e71c5fb3e5f2c9ff6516e7b946fcbf3277a2701cfb5",
      "html_url": "https://github.com/Az-LastPenguin/LORAP/releases/tag/v0.1.1",
      "prerelease": true,
      "size": 10085,
      "source_url": "https://api.github.com/repos/Az-LastPenguin/LORAP",
      "tag": "v0.1.1",
      "title": "v0.1.1",
      "version_simple": "0.1.1",
      "world_version": "0.1.1"
    },
    "v0.2": {
      "created_at": "2025-02-19T23:55:56Z",
      "description": "This is the public beta of LORAP mod, made specifically for testing. In case you did not read the disclaimer on the mod's page: DO NOT USE THIS FOR ACTUAL RUNS, ONLY FOR TESTING RUNS SPECIFICALLY MADE TO TEST THIS MOD. It is unfinished.\r\n\r\nAdditions:\r\n-The base game popup window for library upgrades and etc. was replaced with a custom one. You can now look through all the messages you receive without missing any\r\n-Abno pages and EGO pages receive window like in the original game, yay! (I had to mess with ui display order, tell me if something breaks)\r\n-Brand new \"End Battle\" button!!!! You can end the battle if you want to, and don't want to go to the title. (Don't mind it saying you will go to title, im just being lazy). Of course, tell me if it breaks\r\n-You can now select the level of randomness of abno pages (check .yaml for more, some need testing)\r\n-(Needs Testing) End Goals are real!\r\n\r\nChanges:\r\n-Slightly changed weights of each booster pack when generating new run\r\n-Receiving Booster packs and receptions now shows messages too\r\n-Another change to save file system. Old saves not compatible\r\n-Going to Title should now disconnect from AP, should be safe. Tell me if it breaks\r\n\r\nFixes:\r\n-(Needs Testing) Unstable Book of the Crying Children should now be only dropped once, and only one of it\r\n-Reception of The Crying Children doesn't anymore show up as completed without actually being completed\r\n-(Needs Testing) Tried to once more cut all the Pre-battle and Post-battle story\r\n-Random abno pages and EGO pages are finally random!! (lol)\r\n-Hokma and Binah now shouldn't have the unexisting 5th episode\r\n-Passive Attribution now actually saves ",
      "download_url": "https://github.com/Az-LastPenguin/LORAP/releases/download/v0.2/lor.apworld",
      "has_manifest": false,
      "hash_sha256": "a0e039e7a4394a71739fc1c300b73ddd10c3dcff75d6b48a22b53336228a0943",
      "html_url": "https://github.com/Az-LastPenguin/LORAP/releases/tag/v0.2",
      "prerelease": true,
      "size": 10776,
      "source_url": "https://api.github.com/repos/Az-LastPenguin/LORAP",
      "tag": "v0.2",
      "title": "v0.2",
      "version_simple": "0.2",
      "world_version": "0.2"
    },
    "v0.3": {
      "created_at": "2025-02-19T23:55:56Z",
      "description": "This is the public beta of LORAP mod. It's unfinished, be aware of the bugs.\r\n\r\n## Change Log\r\n### New/Changed stuff:\r\n- Mod's also released in Workshop for easier testing and updating. Also can use visual mods now (not tested). ~~If a visual mod breaks this one it's a skill issue~~\r\n- Mod now works without BepInEx.\r\n- Every custom UI element now uses in-game font instead of importing custom one i made (Why didn't i do that earlier? idk.)\r\n- Drop system was changed to a new one. There is now only one book you get from other players called \"Book of Everything\". It contains every page you can get from burning books from receptions from the map. You can select two variations of the book: Unbalanced and balanced. Drops from the unbalanced one have same chance of dropping no matter what. Balanced one drops pages based on total amount of books burned (drops get progressively better). You can still get pages from 1-2 chapters ahead of currently obtainable, if you get lucky. \r\n- \"End Battle\" is now \"Forfeit\", also works much more like it was intended to before.\r\n- Connect screen now saves last used IP, Slot Name and also last session's progress.\r\n- Endgame title screen variation now only appears when last played session has 100% obtained checks.\r\n- Loading screen now shows a random cg every time (Has most CGs from the story, i had to filter many variations by hand. Also you might notice some appear more than others, it's because of how it's made. I will try to make it better in next updates.)\r\n- Receptions completion checkmark behaviour was adjusted a bit, now shouldn't show any reception as completed even if it wasn't. (The requirement now is all books gotten AND reception cleared)\r\n- When an enemy dies, they only drop one book from the pool of books they can drop, but every book they can ever drop has same chance of being dropped, and is removed from the pool after being dropped. Should make it a lot easier to get books that require very low emotion level. Also kinda sometimes forces you to clear receptions twice or more for all the books. Good? idk.\r\n- There is no fake page called \"Archipelago check\" when burning books, because the implementation was too hacky\r\n\t- WIth the same reason as above book drops displayed as fake pages no longer exist, i replaced it with just text\r\n- ~~Added some checks for endgoals (3 for each ensemble floor, 6 for black silence and distorted ensemble and 8 for keter realization)~~ Coming later.\r\n- Hidden name of the abno for the abno pages list of the floor, as abno pages are shuffled and mostly from different abnos, so the name doesn't at all correspond to the correct one.\r\n- When receiving EGO pages, they're now centered (yay, perfectionism thrives).\r\n- You can no longer get Book of Distortion and Book of LC, because those books aren't even used.\r\n- You no longer get bonus pages from completing certain receptions, as all of those pages are now in the Book of Everything.\r\n- Cut even more of the tutorial. I hope none can be found anymore.\r\n- Funny version number because why not.\r\n\r\n### Bug Fixes:\r\n- Like half of the code was rewritten, so it should be better overall (can't guarantee that, everything needs testing again)\r\n- Apparentely \"Forfeit\" and \"Return to Title\" buttons' behaviours were partially messed up (In the code, \"Forfeit\" button disconnected from AP for some reason?? huh?)\r\n- Like you could've guessed from the above one, disconnecting and reconnecting is now actually possible.\r\n- Fixed Ruina Title screen variation's buttons. (Tai can finally enjoy a working Ruina title screen lmao (also no credits for you, i disabled the button))\r\n\r\n\r\n### Patch 'a':\r\n- It now actually works.\r\n",
      "download_url": "https://github.com/Az-LastPenguin/LORAP/releases/download/v0.3/lor.apworld",
      "has_manifest": false,
      "hash_sha256": "be68ba125a5234f86d127baf95360c620e693d551d27baafe884cf204df164fb",
      "html_url": "https://github.com/Az-LastPenguin/LORAP/releases/tag/v0.3",
      "size": 14499,
      "source_url": "https://api.github.com/repos/Az-LastPenguin/LORAP",
      "tag": "v0.3",
      "title": "v0.3a",
      "version_simple": "0.3",
      "world_version": "0.3a0"
    },
    "v0.3.1": {
      "created_at": "2025-03-16T10:17:16Z",
      "download_url": "https://github.com/Az-LastPenguin/LORAP/releases/download/v0.3.1/lor.apworld",
      "hash_sha256": "568e9e426e97b289d2e2322950c67a64e632b92e3470fbdedb801aa5e7560e98",
      "size": 83631,
      "source_url": "https://api.github.com/repos/Az-LastPenguin/LORAP",
      "tag": "v0.3.1",
      "title": "v0.3.1a",
      "version_simple": "0.3.1",
      "world_version": "0.3.1a0"
    },
    "v0.3.1r2": {
      "created_at": "2025-03-16T10:17:16Z",
      "description": "This is the public beta of LORAP mod. It's unfinished, be aware of the bugs.\r\n\r\n## Change Log\r\n### Changes:\r\n- Mod now works with a bit newer version of HarmonyX which might or might not break other mods\r\n\r\n### Fixes:\r\n- Fixed some parts of the code. Should be more stable now\r\n- Fixed abno pages. No getting them before unlocking now. Also fixed randomization a bit, now negative pages appear when you have more negative coins. And also no copies (hopefully)\r\n- \"Forfeit\" button now actually works (again)\r\n- Abno and EGO pages display shoundn't softlock with different resultions now\r\n- Abno or EGO pages display shouldn't be skipped when closing item gotten message\r\n- Completed receptions how should be saved correctly\r\n- Keter Realization now actually works\r\n\t- Also returned Angela her light (in the battle prepare screen)\r\n- Endgoals now should work fine (that includes Black Silence reception)\r\n- You can now clear any endgoal battle regardless of if you selected it as a goal. Won't yield anything yet though\r\n- No more bonus books from \"Sentinel\" and \"Request\"\r\n- Removed Urban Legend General Receptions from random pool\r\n\r\n\r\n## Patch 'a':\r\n- Fixed Book of Everything giving Leaflet workshop instead (ids were moved a bit)\r\n\r\n## Patch 'b':\r\n- Updated Multiclient version\r\n\r\n## Patch 'c':\r\n- Clearing 3rd/4th abno won't give some of the realization checks anymore\r\n- Blank key pages should be no more\r\n\r\n## Patch 'd':\r\n- Emergency patch of a crash that started happening to everyone for unknown reason\r\n- Reverted to HarmonyX 2.9.0\r\n- Updated to .NET 2.7.2",
      "download_url": "https://github.com/Az-LastPenguin/LORAP/releases/download/v0.3.1/lor.apworld",
      "has_manifest": false,
      "hash_sha256": "b6c913965dd7c639c460393d84228d6e0cefdc75c7f893aacbf2257b7a731eac",
      "html_url": "https://github.com/Az-LastPenguin/LORAP/releases/tag/v0.3.1",
      "size": 111900,
      "source_url": "https://api.github.com/repos/Az-LastPenguin/LORAP",
      "tag": "v0.3.1r2",
      "title": "v0.3.1d",
      "version_simple": "0.3.1",
      "world_version": "0.3.1.post2"
    }
  }
}
