{
  "description": "Manual games allow you to set custom check locations and custom item names that will be rolled into a multiworld.\nThis allows any variety of game -- PC, console, board games, Microsoft Word memes... really anything -- to be part of a multiworld randomizer.\nThe key component to including these games is some level of manual restriction. Since the items are not actually withheld from the player,\nthe player must manually refrain from using these gathered items until the tracker shows that they have been acquired or sent.",
  "game": "Manual_PokemonPlatinum_Linneus",
  "github": "https://github.com/Linneus/PlatinumAPManual",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "2.2.1": {
      "created_at": "2025-01-23T05:35:28Z",
      "description": "Fixed an error in the APWorld that causes generation to fail. This release only contains the APWorld; [refer back to the main 2.2 release](https://github.com/Linneus/PlatinumAPManual/releases/tag/2.2) for the full download.\r\n\r\nThis release ALSO will contain a YAML generated on 0.5.0. The YAML in the 2.2 release is generated on Archipelago 0.6.0, and users attempting to use _that_ one with an earlier version of Archipelago (especially 0.5.0 and 0.5.1) will experience an error in generation with it.\r\n\r\nBear in mind that YAMLs are only included in releases as a convenience; if the included YAML does not match your Archipelago version, you may generate your own as mentioned in the full setup guide, [in step 3 of Generating a seed](https://github.com/Linneus/PlatinumAPManual/blob/main/Full%20Archipelago%20Setup%20Guide.md#generating-a-seed).",
      "download_url": "https://github.com/Linneus/PlatinumAPManual/releases/download/2.2.1/manual_pokemonplatinum_linneus.apworld",
      "has_manifest": false,
      "hash_sha256": "a0b6947cace88c27d6adbda6389c8f53ca2336bc3e7ea24b1a10f7f7b77c2d7b",
      "html_url": "https://github.com/Linneus/PlatinumAPManual/releases/tag/2.2.1",
      "size": 59109,
      "source_url": "https://api.github.com/repos/Linneus/PlatinumAPManual",
      "tag": "2.2.1",
      "title": "Platinum AP Manual 2.2.1 Hotfix",
      "version_simple": "2.2.1",
      "world_version": "2.2.1"
    },
    "2.3": {
      "created_at": "2025-03-20T20:21:48Z",
      "description": "# Platinum AP Manual 2.3 Changelog\r\n## ROM Changes\r\n### New Additions\r\n- A new item, the AP PDA, has been added to the game.\r\n  - It can be used anywhere in the game to collect received items.\r\n  - Compared to the AP Items Room proper, the AP PDA has a very small selection of items; namely, it only contains progression items and Pokétch apps.\r\n  - You will receive it the first time you enter the AP Items Room.\r\n- A new item, the Marsh Pass, has been added to the game.\r\n  - Depending on YAML options set in-game, the Great Marsh in Pastoria will either ask for p500 or to be shown a Marsh Pass.\r\n  - Unlike the Storage Key, this is a wholly original item, inspired by Red/Blue's Safari Pass.\r\n- The Great Marsh will no longer count your steps.\r\n  - You will have to manually exit or click \"Retire\" in the menu to leave the Great Marsh.\r\n- HMs can now be forgotten at any time.\r\n  - Given that there is no item storage in this game and, thus, no way to go somewhere without access to the HMs you have, this should not cause any softlocks (unless you're outwardly trying).\r\n  - If this does cause any issue, please report it.\r\n### Changes/Fixes\r\n- Access to the Member Card event in Canalave City no longer requires the National Dex.\r\n- Access to Valley Windworks is now restricted by whether or not you've picked up the Works Key, not whether you've beaten the grunts in Floaroma Meadow.\r\n  - Under the hood, the game never checks for the Works Key; it checks for the event flag set after you beat the Floaroma Grunts. I've simply moved that flag to the AP Items Room (and the AP PDA) when you pick up the Works Key. (So if any of you PKHeX holdouts just give yourself the Works Key, it's not gonna work!)\r\n- The AP Manual Check will now be guaranteed to be the first item your Partner Pokémon picks up in Amity Square.\r\n- Maylene can no longer be rebattled.\r\n- The Badge Check at the Pokémon League has been streamlined.\r\n  - Mostly an under-the-hood change, rather than a big thing you'll see during gameplay. This should fix a potential crash, though.\r\n- The Galactic Grunts in Veilstone will no longer disappear after defeating Candice.\r\n- The lighting in Hotel Grand Lake's reception has been fixed.\r\n- Various small improvements have been made to the menus in the AP Items Room.\r\n  - Receiving a Plate will now return you to the menu to get more Plates.\r\n  - The Plates menu now correctly terminates, instead of jumping to the YAML options text.\r\n  - An extra A press on every 'item received' text box has been removed.\r\n- The Sprayduck and Rule Book items have been removed.\r\n  - It is still possible to water berries.\r\n## APWorld Changes\r\n### New Additions\r\n- new YAML Options have been added:\r\n  - `marsh_pass` - Having this on gates access to the Great Marsh in Pastoria City until you've received the Marsh Pass item, as mentioned in the ROM Changes.\r\n### Changes/Fixes\r\n- Logic has been updated for defeating Crasher Wake.\r\n- Logic has been updated for the Early Fly option's interaction with Floaroma's region.\r\n- Logic has been updated for the item in the northeast corner of Lake Acuity.\r\n- Two items on Route 214 had their categories swapped; this was fixed.\r\n- Mirroring the ROM change, there will no longer be a Sprayduck or Rule Book. (\"I know! I'll just !getitem them!\" well how are you gonna acquire them in-game, silly???)\r\n## Known Issues\r\n- Certain variables relating to the Arceus goal are unstable, and it's hard to test exactly when they're working. They've been changed, but if there are still issues, please report them.\r\n\r\nCheck the [README](https://github.com/Linneus/PlatinumAPManual/blob/main/README.md) for patching and randomizing instructions.\r\nMake sure to have [the latest APWorld for manual](https://github.com/ManualForArchipelago/Manual/releases) and the latest [Universal Tracker](https://github.com/FarisTheAncient/Archipelago/releases/)!\r\n\r\n**For those who are new to the Platinum AP Manual**, you only need to download the .zip file. It contains the patch files, the APWorld, the YAML, the xDelta patching program, and the version of Universal Pokémon Randomizer ZX that this project uses.\r\n\r\n**If you are a returning player** and you have all of those files from a previous release, all you need are the APWorld and your preferred Patch.",
      "download_url": "https://github.com/Linneus/PlatinumAPManual/releases/download/2.3/manual_pokemonplatinum_linneus.apworld",
      "has_manifest": false,
      "hash_sha256": "f695c5a1960425934493b64d458ca3e9512eae2972ce7c466c46f488821851c6",
      "html_url": "https://github.com/Linneus/PlatinumAPManual/releases/tag/2.3",
      "size": 58779,
      "source_url": "https://api.github.com/repos/Linneus/PlatinumAPManual",
      "tag": "2.3",
      "title": "Platinum AP Manual 2.3",
      "version_simple": "2.3",
      "world_version": "2.3"
    },
    "2.4": {
      "created_at": "2025-07-22T05:08:23Z",
      "download_url": "https://github.com/Linneus/PlatinumAPManual/releases/download/2.4/manual_pokemonplatinum_linneus.apworld",
      "hash_sha256": "856ea860a7a6a26629882c00ffe79c6a5822bd5cb92e8ba4dbf0e8f5817941ab",
      "size": 72763,
      "source_url": "https://api.github.com/repos/Linneus/PlatinumAPManual",
      "tag": "2.4",
      "title": "Platinum AP Manual 2.4",
      "version_simple": "2.4",
      "world_version": "2.4"
    },
    "2.4.1": {
      "created_at": "2025-08-05T22:45:44Z",
      "description": "# Platinum AP Manual 2.4.1 Changelog\r\n## ROM Changes\r\n- The Pokémon Center Nurse's dialogue has been reduced.\r\n## APWorld Changes\r\n- The location added for the daily berry girl in the Flower Shop has had its name fixed.\r\n- In the previous patch, all locations tied to accessories from the Pick a Peck Flower Shop were set to only give items from certain locations (namely, anything that wasn't a berry, in an attempt to prevent all of these locations from being filled with berries for other Pick a Peck accessories). This has been removed, as it tended to disrupt generation, and essentially nullified the ability to use any of these locations with plando settings, up to and including the `priority_locations` option in the settings file.\r\n\r\n\r\nCheck the [README](https://github.com/Linneus/PlatinumAPManual/blob/main/README.md) for patching and randomizing instructions.\r\nMake sure to have [the latest APWorld for manual](https://github.com/ManualForArchipelago/Manual/releases) and the latest [Universal Tracker](https://github.com/FarisTheAncient/Archipelago/releases/)!\r\n\r\n**For those who are new to the Platinum AP Manual**, you only need to download the .zip file. It contains the patch files, the APWorld, the YAML, the xDelta patching program, and the version of Universal Pokémon Randomizer ZX that this project uses.\r\n\r\n**If you are a returning player** and you have all of those files from a previous release, all you need are the APWorld and your preferred Patch.",
      "download_url": "https://github.com/Linneus/PlatinumAPManual/releases/download/2.4.1/manual_pokemonplatinum_linneus.apworld",
      "has_manifest": false,
      "hash_sha256": "70b921cc4eb76a16f3340bb3411fda257966d2fc61a2b16e802dfc2bedb2f8a1",
      "html_url": "https://github.com/Linneus/PlatinumAPManual/releases/tag/2.4.1",
      "size": 72643,
      "source_url": "https://api.github.com/repos/Linneus/PlatinumAPManual",
      "tag": "2.4.1",
      "title": "Platinum AP Manual 2.4.1",
      "version_simple": "2.4.1",
      "world_version": "2.4.1"
    },
    "2.4r2": {
      "created_at": "2025-07-22T05:08:23Z",
      "download_url": "https://github.com/Linneus/PlatinumAPManual/releases/download/2.4/manual_pokemonplatinum_linneus.apworld",
      "hash_sha256": "e992bcd2943262a0ad28768ebe8c9949e4c7799299185b403c731da8e7fd1c8e",
      "size": 72762,
      "source_url": "https://api.github.com/repos/Linneus/PlatinumAPManual",
      "tag": "2.4r2",
      "title": "Platinum AP Manual 2.4",
      "version_simple": "2.4",
      "world_version": "2.4.post2"
    },
    "2.4r3": {
      "created_at": "2025-07-22T05:08:23Z",
      "description": "# Platinum AP Manual 2.4 Changelog\r\n## ROM Changes\r\n- The AP PDA can now be accessed with the R Button, without the use of the item.\r\n  - You will still receive the AP PDA upon entering the AP Items room.\r\n  - Berries have been added to the PDA.\r\n- All Berry Trees have been replaced with random items. Interacting with one will give the player an item.\r\n  - The Berry Searcher Pokétch App is unable to detect these, and will not display berries on the map.\r\n- The Pick a Peck of Colors Flower Shop in Floaroma has been overhauled; the UI and prices have been changed to accommodate the new `pick_a_peck_accessories` option.\r\n- The Bike is usable in Eterna Gym, the Seven Stars Restaurant, and the Café Cabin.\r\n- There are two changes to the AP Items Room.\r\n  - The player now has the option to receive all 16 Plates at once from the Ruin Maniac.\r\n  - Berries have also been added to the Filler girl.\r\n- The southernmost Strength boulder in the Route 211 Tunnel room of Mt. Coronet has been replaced with a bollard that can be removed by interacting with it from the southern side. The Galactic Grunt that appears in this area will allude to this.\r\n## APWorld Changes\r\n- new YAML Options have been added:\r\n  - `berry_tree_shuffle` - This will add all 118 of the game's Berry Trees as locations to the game.\r\n    - If the player is playing with Battle Zone off, the four trees in the Fight Area will remain in logic with the S.S. Ticket.\r\n  - `pick_a_peck_accessories` - All 22 accessory purchases in Floaroma's Flower Shop will be added as locations. All accessory prices (excluding those that cost 1 Berry) have been reduced to 10% of their original price. As such, having this option on will add the 83 berries necessary to purchase the accessories as items.\r\n- The daily berry girl in the Flower Shop has been added as a location.\r\n- The location 'Mt. Coronet (Route 211 Tunnel Room) - Hidden Item on Center Boulder' has had its logic corrected.\r\n\r\n\r\nCheck the [README](https://github.com/Linneus/PlatinumAPManual/blob/main/README.md) for patching and randomizing instructions.\r\nMake sure to have [the latest APWorld for manual](https://github.com/ManualForArchipelago/Manual/releases) and the latest [Universal Tracker](https://github.com/FarisTheAncient/Archipelago/releases/)! Note this is the first release on Archipelago 0.6.2.\r\n\r\n**For those who are new to the Platinum AP Manual**, you only need to download the .zip file. It contains the patch files, the APWorld, the YAML, the xDelta patching program, and the version of Universal Pokémon Randomizer ZX that this project uses.\r\n\r\n**If you are a returning player** and you have all of those files from a previous release, all you need are the APWorld and your preferred Patch.",
      "download_url": "https://github.com/Linneus/PlatinumAPManual/releases/download/2.4/manual_pokemonplatinum_linneus.apworld",
      "has_manifest": false,
      "hash_sha256": "dbb0688ff196fc08675f60e560c49daecd453dc7bfa1adadc88b03cd694d7834",
      "html_url": "https://github.com/Linneus/PlatinumAPManual/releases/tag/2.4",
      "size": 72654,
      "source_url": "https://api.github.com/repos/Linneus/PlatinumAPManual",
      "tag": "2.4r3",
      "title": "Platinum AP Manual 2.4",
      "version_simple": "2.4",
      "world_version": "2.4.post3"
    }
  }
}
