{
  "description": "Manual games allow you to set custom check locations and custom item names that will be rolled into a multiworld.\nThis allows any variety of game -- PC, console, board games, Microsoft Word memes... really anything -- to be part of a multiworld randomizer.\nThe key component to including these games is some level of manual restriction. Since the items are not actually withheld from the player,\nthe player must manually refrain from using these gathered items until the tracker shows that they have been acquired or sent.",
  "game": "Manual_theHunterCotWTrophyHunt_Camoufladies",
  "github": "https://github.com/Nikkilites/Archipelago-Manuals",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "theHunterCotW_v0.1.0": {
      "created_at": "2025-08-06T02:37:01Z",
      "description": "Release of thHunter Call of the Wild manual for archipelago\r\n\r\nWe've run through a couple of runs of this game to adjust just what is required for the different hunts in the game, so the logic is quite complex and individual for each animal. Using the universal tracker is definitely recommended, although any animal that you have access to through hunting preserve and class permit can be hunted regardless of your gear!\r\n\r\nIncludes multiple hooks with multiple purposes:\r\n* Customize goal type to either Gold- or Diamond trophies\r\n* Adjust how many Trophies are required to goal\r\n* Adjust which DLC's you have available (Maps will always be part of it whether you own them or not though, as they can be played publicly)\r\n* Customize if you want birds present in your world or not",
      "download_url": "https://github.com/Nikkilites/Archipelago-Manuals/releases/download/theHunterCotW_v0.1.0/manual_thehuntercotwtrophyhunt_camoufladies.apworld",
      "has_manifest": false,
      "hash_sha256": "0811e9f66ffb73f0a507f3116a87d7baa08db11dc96e6e3a74588ab54be7711f",
      "html_url": "https://github.com/Nikkilites/Archipelago-Manuals/releases/tag/theHunterCotW_v0.1.0",
      "size": 55140,
      "source_url": "https://api.github.com/repos/Nikkilites/Archipelago-Manuals",
      "tag": "theHunterCotW_v0.1.0",
      "title": "theHunter: Call of the Wild Manual v0.1.0",
      "version_simple": "0.1.0",
      "world_version": "0.1.0"
    }
  }
}
