{
  "description": "Metroid Fusion, powered by MARS. The fourth Metroid game, known for its linearity, in randomized form!\nLocate the Infant Metroids to lure out the SA-X, set the self destruct, and escape the station.",
  "game": "Metroid Fusion",
  "github": "https://github.com/Rosalie-A/Archipelago",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "MF-v1": {
      "created_at": "2025-06-18T15:51:51Z",
      "description": "## SETUP:\r\n- Put in your AP install's custom_worlds folder.\r\n- Run the Archipelago Launcher and use it to generate a template YAML\r\n- Edit the YAML accordingly.\r\n- - Which is to say, change your player name because I don't have any custom world options yet.\r\n- Give your YAML to whoever's generating and they put it in their Players folder and run ArchipelagoGenerate.exe.\r\n- Have that person give you the .apmetfus file corresponding to your player slot.\r\n- Open your .apmetfus file with Archipelago. It should prompt you for your legally acquired Metroid Fusion USA rom. Select it.\r\n- Wait for your game to patch. The Bizhawk Client should open automatically with the Bizhawk Client connector lua running. \r\n- - You may be prompted to select an emulator to open the patched ROM with. You'll want EmuHawk.exe in your Bizhawk install directory.\r\n- Connect the Bizhawk Client to the game server, and enjoy playing.\r\n\r\n## Important Notes\r\n- MARS, the underlying randomizer, is in beta and many features are subject to change in the future.\r\n- Check out [the changes from the vanilla game here](https://github.com/Rosalie-A/Archipelago/blob/metroidfusion/worlds/metroidfusion/rom_changes.md)\r\n- Leave any feedback in the Metroid Fusion thread of the Future Game Design forum on the Archipelago Discord.",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v1/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "f9861f0b77873912883143844f0d7428aafcb968638a4025335a0da7835e5149",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v1",
      "size": 407090,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v1",
      "title": "Metroid Fusion APWorld v1",
      "version_simple": "1",
      "world_version": "1"
    },
    "MF-v10": {
      "created_at": "2025-07-03T20:10:54Z",
      "description": "## Changes:\r\n- Logic fixes and adjustments\r\n- - Sector 2 Antechamber now requires Morph Ball and Hi-Jump/Bombs when coming from the Sector 2 side.\r\n- - Bob's Abode and its connection in Sector 3 are now fixed.\r\n- - Going to the Twin Caverns area after the Varia Core-X in Sector 6 the back way now properly requires Morph Ball\r\n- - Spaceboost Alley in Sector 6 now properly requires Screw Attack.\r\n- - Bosses now have some energy tanks as a logical requirement. You probably won't notice a difference, but it helps guarantee you're not having to fight Nightmare with only 300 energy.\r\n\r\n## Known Issues\r\n- When receiving Beam items, the graphics may not update properly. This appears to just be a cosmetic issue and is fixed by entering and exiting the pause menu. Let me know if it's something more serious.\r\n- Sometimes when obtaining an Infant Metroid, the message indicating enough have been found will display incorrectly.\r\n- - I haven't figured the cause of this one yet. You can always confirm if you have enough by checking your inventory screen.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v10/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "5d9c64b7d51c45a4cd4cd9a69fe628a700a23cf8d51e4a9ff9e15c99b3ee70a9",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v10",
      "size": 904592,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v10",
      "title": "Metroid Fusion APWorld v10",
      "version_simple": "10",
      "world_version": "10"
    },
    "MF-v11": {
      "created_at": "2025-09-06T14:09:07Z",
      "description": "# Metroid Fusion Update\r\n\r\n## Changes:\r\n- Logic fixes and adjustments\r\n- - Way too many to note here, thanks to my delay in updating.\r\n- - Special thanks to JaggerG for contributions to some Sector 4 requirements\r\n- - And a super special thanks to CRIT MAGNET for both submitting fixes of their own as well as maintaining the APWorld in my absense.\r\n- New options: Elevator Shuffle and Sector Tube Shuffle.\r\n- - Elevator Shuffle comes in three flavors. `Off`, of course, is one of them. `Sectors` will shuffle the six sector elevator connections in the Sector Hub. `All` will shuffle all ten elevator connections: the six sector elevators, the elevator to the Sector Hub, the elevator to the Restricted Labs Navigation Room, and the elevators to the Operations Deck and Habitation Deck.\r\n- - Sector Tube Shuffle can be toggled on or off, and shuffles the sector shortcut tubes between each other. This doesn't change the static connections of the Reactor to Sector 2 or Sector 5 to Sector 4.\r\n- - These changed connections aren't marked on the minimap at the moment, so you may want to take notes. Both combined together can be rather confusing to navigate!\r\n- Updated the version of MARS used. Most of the changes are invisible to you, but the issue with beam graphics not updating should be fixed. If it's not, it's probably my fault.\r\n\r\n## Known Issues\r\n- Sometimes when obtaining an Infant Metroid, the message indicating enough have been found will display incorrectly.\r\n- - I haven't figured the cause of this one yet. You can always confirm if you have enough by checking your inventory screen.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v11/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "5d5ff38afabce6b8d1a796dbd29eda217d8ef3103fe1e09c03d7829bf14c3bbb",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v11",
      "size": 1021243,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v11",
      "title": "Metroid Fusion APWorld v11",
      "version_simple": "11",
      "world_version": "11"
    },
    "MF-v12": {
      "created_at": "2025-09-08T23:55:41Z",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v12/metroidfusion.apworld",
      "hash_sha256": "6b68f2d0be7d0b24fecebecfd362a343e12bcb4b81453dea4336f1b8fbd05acb",
      "size": 1025114,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v12",
      "title": "Metroid Fusion APWorld v12",
      "version_simple": "12",
      "world_version": "12"
    },
    "MF-v12r2": {
      "created_at": "2025-09-08T23:55:41Z",
      "description": "# Metroid Fusion Update\r\n\r\n## Changes:\r\n- Logic fixes and adjustments.\r\n- - Most notably, relaxed most Energy Tank requirements for logical accessibility when using Elevator Shuffle in order to reduce generation failures.\r\n- Changed the Item Classification of Energy Tanks from Progression to Progression/Deprioritized/Skip Balancing.\r\n- - Skip Balancing means progression balancing won't try to move them earlier, making the step more meaningful since they don't unlock as much as major upgrades.\r\n- - Deprioritized means they won't appear on priority locations unless the generation is out of regular progression items.\r\n- - - This is experimental, but I wanted to see if people who commonly play with priority locations have any opinions on the change.\r\n- New option: Simple Wall Jumps In Region Logic.\r\n- - If enabled, simple wall jumps (those that don't require particularly precise timing or positioning) can be required in order to progress.\r\n- YAML Options are now grouped by category for easier navigation.\r\n- Added a game setting, `display_location_found_messages`, located in host.yaml under `metroidfusion_settings`. Defaults to \"true\". If you turn it to \"false\", the messages saying \"New Check\" in the client will no longer be displayed.\r\n- - It's basically inertia that I still have those messages, but I dislike changing existing behavior without at least an intermediate step.\r\n- Fixed a bug where all items were playing the major item acquired jingle.\r\n- Fixed a bug where Open Sector Hub was unplayable.\r\n- Fixed a bug where games were unpatchable on Linux and probably also MacOS.\r\n- - Hopefully. I kind of don't have a non-Windows install to test on.\r\n\r\n\r\n## Known Issues\r\n- Sometimes when obtaining an Infant Metroid, the message indicating enough have been found will display incorrectly.\r\n- - I haven't figured the cause of this one yet. You can always confirm if you have enough by checking your inventory screen.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v12/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "493222485f974cc8f0c24c27cf48bf83d77cf69d5204e660b58b55642584d214",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v12",
      "size": 1025119,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v12r2",
      "title": "Metroid Fusion APWorld v12",
      "version_simple": "12",
      "world_version": "12.post2"
    },
    "MF-v13": {
      "created_at": "2025-09-09T15:16:12Z",
      "description": "# Metroid Fusion Update\r\n\r\n## Changes:\r\n- Fixed a bug where hints were being incorrectly generated.\r\n- Fixed a bug where the APWorld wouldn't load with some Python versions.\r\n\r\n\r\n## Known Issues\r\n- Sometimes when obtaining an Infant Metroid, the message indicating enough have been found will display incorrectly.\r\n- - I haven't figured the cause of this one yet. You can always confirm if you have enough by checking your inventory screen.\r\n- There's still occasional generation failures I haven't knocked out yet, especially in solo seeds. For now, just try again.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v13/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "fdcc1935c9864fa13f618b6e97122c387c814a8bebed09cd925c14e316a98c5f",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v13",
      "size": 903474,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v13",
      "title": "Metroid Fusion APWorld v13",
      "version_simple": "13",
      "world_version": "13"
    },
    "MF-v14": {
      "created_at": "2025-09-11T13:19:19Z",
      "description": "## Changes:\r\n- More logic fixes!\r\n- - Most notably, SA-X now logically requires by default Plasma, Wide, and Super Missiles, alongside the existing requirements of Operations Deck access, enough Infant Metroids, Charge Beam/Missiles, and ten Energy Tanks.\r\n- - - Note that these are logical requirements. The fight itself only requires Infant Metroids, Charge Beam, and Missiles.\r\n- - - Additionally, Space Jump/Hi-Jump to the Ops Room door weren't being checked for before. Oops. They are now.\r\n- - Thanks as always to all the reports on these. Keep 'em coming!\r\n- A huge internal rework of how the logic is organized. This doesn't affect you, but it makes me very happy.\r\n- Moderate options rework.\r\n- - `TrickyShinesparksInRegionLogic` and `SimpleWallJumpsInRegionLogic` have been deprecated. They'll still work, but they'll throw a warning at you during generation and will be fully removed in a future version. Don't worry, because...\r\n- - New options have been added. Introducing `WallJumpTrickDifficulty`, `ShinesparkTrickDifficulty`, and newcomer `CombatDifficulty`.\r\n- - - `WallJumpTrickDifficulty` comes in three settings: None, Beginner, and Advanced. None keeps wall jumps out of logic, Beginner is equivalent to the previous `SimpleWallJumpsInRegionLogic` option, and Advanced can require even more tricky wall jumps in order to logically access places.\r\n- - - `ShinesparkTrickDifficulty` also comes in the same three flavors. None keeps all shinespark tricks that aren't required for vanilla 100% out of logic. Beginner adds in easy tricks like Shinesparking to items in places you wouldn't normally have to, while Advanced can require storing and recharging Shinesparks in tricky places. Advanced is equal to the previous `TrickyShinesparksInRegionLogic` setting.\r\n- - - - As always, contributions and feedback for these settings are welcome. I'm a better programmer than I am a Fusion player, after all\r\n- - - `CombatDifficulty` has three settings: Beginner, Advanced, and Expert. At the moment, these just affect later game boss difficulty, relaxing the logical requirements for better weaponry. At the moment, these don't affect E-Tank requirements for anything but the SA-X, but that'll change in a future version.\r\n- - - - This isn't due to a design decision, but rather a consequence of how my logic is programmed that I'll have to rework and that'll take a bit of effort. I wanted feedback on these options first.\r\n- - Due to the deprecation of the previous options, I highly encourage regenerating a template YAML and migrating your settings for TrickyShinesparks and SimpleWallJumps to the new options. Like I said, a future update will remove these options and you won't get the expected behavior.\r\n- Preliminary support for Universal Tracker has been added. Elevator and Tube Shuffle should now work with it.\r\n- - I say preliminary because I did more or less the bare minimum of testing, so if something doesn't line up with reality, let me know.\r\n- I forgot to increment the internal version on the previous v13 release, so don't be surprised that this one jumps to v14.\r\n\r\n\r\n## Known Issues\r\n- Sometimes when obtaining an Infant Metroid, the message indicating enough have been found will display incorrectly.\r\n- - I haven't figured the cause of this one yet. You can always confirm if you have enough by checking your inventory screen.\r\n- There's still occasional generation failures I haven't knocked out yet, especially in solo seeds. For now, just try again.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v14/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "1b152fa9639c20f8e34a57ae6a7e132ef4e8edccab03b523b9f3ad3a10f520ae",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v14",
      "size": 941428,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v14",
      "title": "Metroid Fusion APWorld v14",
      "version_simple": "14",
      "world_version": "14"
    },
    "MF-v15": {
      "created_at": "2025-09-16T16:23:28Z",
      "description": "## Changes:\r\n- Wouldn't you know it, there's logic fixes and adjustments.\r\n- - The only non-fix change is that the SA-X now logically requires the Varia Suit on Beginner Combat.\r\n- - - Like other logical SA-X requirements, this really only affects minimal accessibility, but Ice Beam into Super Missile hurts a bunch so I figured I'd add it.\r\n- Three new options have been added: `InfantMetroidPlacement`, `PointOfNoReturnsInLogic` and `DeathLink`\r\n- - `InfantMetroidPlacement` has three settings. \r\n- - - Anywhere, the default, is the existing behavior: Infant Metroids can be anywhere in the multiworld (following your local/non-local items settings, of course).\r\n- - - Bosses Encouraged weights the placement of Infant Metroids so there's a higher chance of boss fight locations having them.\r\n- - - Only Bosses means only your local bosses can have Infant Metroids. There's fewer bosses than the max number of Infant Metroids in the pool, so the pool amount will automatically be lowered to compensate if applicable.\r\n- - `PointOfNoReturnsInLogic`, if enabled, will change the logic so you're never required to enter an area without the items to leave it. The default is disabled, the existing behavior.\r\n- - - This heavily restricts the placement of some items due to the structure of the game, so be aware.\r\n- - - This also changes the logic around, and it's almost a certainty I've missed some spots due to that.\r\n- - `DeathLink` is as it works in other games: if enabled, then when you die, everyone else with DeathLink dies, and the reverse is true -- if someone with DeathLink enabled dies, so do you.\r\n- - - I did my best to catch all the edge cases, but there may be some times when you get double-tapped or your deathlink doesn't send/receive. Do report these, of course.\r\n- - - This only works when you're connected and in-game: DeathLinks are not queued up.\r\n- The Unknown Item icon has been replaced with an Archipelago icon.\r\n- The TrickyShinesparksInRegionLogic and SimpleWallJumpsInRegionLogic have been removed. If they're in your YAML, remove them: you'll now get an error in generation if they're present.\r\n\r\n## Known Issues\r\n- Sometimes when obtaining an Infant Metroid, the message indicating enough have been found will display incorrectly.\r\n- - I haven't figured the cause of this one yet. You can always confirm if you have enough by checking your inventory screen.\r\n- There's still occasional generation failures I haven't knocked out yet, especially in solo seeds. For now, just try again.\r\n- I thought I knocked out the beam graphics bug. I appear to have not yet. Like before, it seems to just be graphical, and can be fixed by opening and closing the pause menu.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v15/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "e692bf21d0660f3c9d7c6b42fc98b156cd4d941483ae7a215ca4859a3431e781",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v15",
      "size": 1204474,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v15",
      "title": "Metroid Fusion APWorld v15",
      "version_simple": "15",
      "world_version": "15"
    },
    "MF-v16": {
      "created_at": "2025-10-03T23:14:06Z",
      "description": "# Metroid Fusion Update v16\r\n\r\n## Changes:\r\n- More logic fixes and adjustments, most courtesy of JaggerG\r\n- Multiple new options have been added, and one has been adjusted.\r\n- - `GameMode` now has a `Custom` value, and a new option group has been added, \"Custom Game Mode Options\".\r\n- - - Setting `GameMode` to `Custom` will enable the usage of the Custom Game Mode options, which will allow you to set the following: starting location, starting energy tanks, starting major upgrade count, if the sector hub doors are open, and if the sector navigation room hints are open.\r\n- - - So, for example, if you liked the Open Sector Hub preset but wished it could be tweaked in some way, you can do that.\r\n- - - Currently, `StartingLocation` has four values. There's the expected Docking Bay and Sector Hub, but there's also a setting for the Concourse Save Station for those of you who like to start a little further afield. You can also now start on the Operations Deck, which can get a little wild with elevator shuffle.\r\n- - - - These have all been lightly tested, but I'm sure there's going to be issues with the Ops Deck starting location. I'm planning for more to be added in the future, but one step at a time.\r\n- Your starting inventory is now applied directly by MARS instead of being provided by the client on connection.\r\n- A bug where Deathlink would erroneously fire multiple times has been fixed. Hopefully.\r\n- A second ingame icon for offworld items has been added. Anything Progression classified should now have a blinking yellow up arrow on it.\r\n- A pair of bugs with shiny item tank messages have been fixed.\r\n- Credits have been added to the ending for myself and contributors.\r\n\r\n## Known Issues\r\n- Sometimes when obtaining an Infant Metroid, the message indicating enough have been found will display incorrectly.\r\n- - I haven't figured the cause of this one yet. You can always confirm if you have enough by checking your inventory screen.\r\n- There's still occasional generation failures I haven't knocked out yet, especially in solo seeds. For now, just try again.\r\n- I thought I knocked out the beam graphics bug. I appear to have not yet. Like before, it seems to just be graphical, and can be fixed by opening and closing the pause menu.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v16/metroidfusion.apworld",
      "has_manifest": true,
      "hash_sha256": "ff6659d39f875fdf7ab733eb4ebf6415f9a1c44e828c064d18ed2f250b2d07ca",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v16",
      "size": 755568,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v16",
      "title": "Metroid Fusion APWorld v16",
      "version_simple": "16",
      "world_version": "16"
    },
    "MF-v17": {
      "created_at": "2025-10-04T14:54:16Z",
      "description": "# Metroid Fusion Update v17\r\n\r\n## Changes:\r\n- Just one, but it's a major one: fixed a bug that was causing items to be infinitely received over and over again.\r\n- - Which is bad.\r\n\r\n## Known Issues\r\n- Sometimes when obtaining an Infant Metroid, the message indicating enough have been found will display incorrectly.\r\n- - I haven't figured the cause of this one yet. You can always confirm if you have enough by checking your inventory screen.\r\n- There's still occasional generation failures I haven't knocked out yet, especially in solo seeds. For now, just try again.\r\n- I thought I knocked out the beam graphics bug. I appear to have not yet. Like before, it seems to just be graphical, and can be fixed by opening and closing the pause menu.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v17/metroidfusion.apworld",
      "has_manifest": true,
      "hash_sha256": "eb63965ff09d1f6441dfbda5d7566316b7b03b1d63a7f7ac4a7c3a495088c553",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v17",
      "size": 755585,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v17",
      "title": "Metroid Fusion APWorld v17",
      "version_simple": "17",
      "world_version": "17"
    },
    "MF-v2": {
      "created_at": "2025-04-06T22:39:25Z",
      "description": "## Changes:\r\n- Underscores in player and item names should no longer crash the patcher.\r\n\r\n## SETUP:\r\n- Put in your AP install's custom_worlds folder.\r\n- Run the Archipelago Launcher and use it to generate a template YAML\r\n- Edit the YAML accordingly.\r\n- - Which is to say, change your player name because I don't have any custom world options yet.\r\n- Give your YAML to whoever's generating and they put it in their Players folder and run ArchipelagoGenerate.exe.\r\n- Have that person give you the .apmetfus file corresponding to your player slot.\r\n- Open your .apmetfus file with Archipelago. It should prompt you for your legally acquired Metroid Fusion USA rom. Select it.\r\n- Wait for your game to patch. The Bizhawk Client should open automatically with the Bizhawk Client connector lua running. \r\n- - You may be prompted to select an emulator to open the patched ROM with. You'll want EmuHawk.exe in your Bizhawk install directory.\r\n- Connect the Bizhawk Client to the game server, and enjoy playing.\r\n\r\n## Important Notes\r\n- MARS, the underlying randomizer, is in beta and many features are subject to change in the future.\r\n- Check out [the changes from the vanilla game here](https://github.com/Rosalie-A/Archipelago/blob/metroidfusion/worlds/metroidfusion/rom_changes.md)\r\n- Leave any feedback in the Metroid Fusion thread of the Future Game Design forum on the Archipelago Discord.",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v2/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "814717c111c855ddd4d085e1d829eb0280441dee6e7155c7476ba22c33335f2f",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v2",
      "size": 406905,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v2",
      "title": "Metroid Fusion APWorld v2",
      "version_simple": "2",
      "world_version": "2"
    },
    "MF-v3": {
      "created_at": "2025-06-19T18:26:32Z",
      "description": "## Changes:\r\n- Fixed a number of logic bugs.\r\n- Offworld items for other Metroid games should display an appropriate sprite to the item where possible.\r\n- Item upgrades should now toggle on properly when reloading from a save or warp to start.\r\n- Handling of player and item names should be more robust, resulting in fewer errors when patching.\r\n\r\n## SETUP:\r\n- Put in your AP install's custom_worlds folder.\r\n- Run the Archipelago Launcher and use it to generate a template YAML\r\n- Edit the YAML accordingly.\r\n- - Which is to say, change your player name because I don't have any custom world options yet.\r\n- Give your YAML to whoever's generating and they put it in their Players folder and run ArchipelagoGenerate.exe.\r\n- Have that person give you the .apmetfus file corresponding to your player slot.\r\n- Open your .apmetfus file with Archipelago. It should prompt you for your legally acquired Metroid Fusion USA rom. Select it.\r\n- Wait for your game to patch. The Bizhawk Client should open automatically with the Bizhawk Client connector lua running. \r\n- - You may be prompted to select an emulator to open the patched ROM with. You'll want EmuHawk.exe in your Bizhawk install directory.\r\n- Connect the Bizhawk Client to the game server, and enjoy playing.\r\n\r\n## Important Notes\r\n- MARS, the underlying randomizer, is in beta and many features are subject to change in the future.\r\n- Check out [the changes from the vanilla game here](https://github.com/Rosalie-A/Archipelago/blob/metroidfusion/worlds/metroidfusion/rom_changes.md)\r\n- Leave any feedback in the Metroid Fusion thread of the Future Game Design forum on the Archipelago Discord.",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v3/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "78653b59c7e396a5ace2cacad2d76808f40f0b50cf51bf27e79d1dd8ad67b34f",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v3",
      "size": 411172,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v3",
      "title": "Metroid Fusion APWorld v3",
      "version_simple": "3",
      "world_version": "3"
    },
    "MF-v4": {
      "created_at": "2025-06-21T00:25:24Z",
      "description": "## Changes:\r\n- More logic bugs fixed. Keep the reports coming!\r\n- Added some actual options. Remember to regenerate your template YAML with the launcher.\r\n- - Infant Metroid counts, both amount in pool and amount required. \r\n- - - Your required number of Metroids will be shown to you at the start of the game and on your inventory screen.\r\n- - Palette randomization.\r\n- - Enable hints.\r\n- Hints! Navigation rooms will now provide some location hints.\r\n- - Hints will either be for one of your own items in any world, or any item in your own world.\r\n- - - Hints for your own world will be logged with the server. Due to technical limitations, offworld items can't be logged this way, and onworld hints will only be logged if you're connected at the time of seeing the hint.\r\n- - Right now, all navigation station hints are available from the start. Feedback is welcome on how strong the hints are and how available they are.\r\n- Local missile and power bomb tanks now have a very small chance of being shiny. Enjoy!\r\n- `ShinesparkLcations` has been added as a location group. This is so you can exclude those locations if you find them difficult.\r\n- - Don't use it as a PriorityLocation group. Due to how those get filled, you're likely to get failed generations that way.\r\n\r\n## SETUP:\r\n- Put in your AP install's custom_worlds folder.\r\n- Run the Archipelago Launcher and use it to generate a template YAML\r\n- Edit the YAML accordingly.\r\n- - Which is to say, change your player name because I don't have any custom world options yet.\r\n- Give your YAML to whoever's generating and they put it in their Players folder and run ArchipelagoGenerate.exe.\r\n- Have that person give you the .apmetfus file corresponding to your player slot.\r\n- Open your .apmetfus file with Archipelago. It should prompt you for your legally acquired Metroid Fusion USA rom. Select it.\r\n- Wait for your game to patch. The Bizhawk Client should open automatically with the Bizhawk Client connector lua running. \r\n- - You may be prompted to select an emulator to open the patched ROM with. You'll want EmuHawk.exe in your Bizhawk install directory.\r\n- Connect the Bizhawk Client to the game server, and enjoy playing.\r\n\r\n## Important Notes\r\n- MARS, the underlying randomizer, is in beta and many features are subject to change in the future.\r\n- Check out [the changes from the vanilla game here](https://github.com/Rosalie-A/Archipelago/blob/metroidfusion/worlds/metroidfusion/rom_changes.md)\r\n- Leave any feedback in the Metroid Fusion thread of the Future Game Design forum on the Archipelago Discord.",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v4/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "49c2bd59685e9e1cab8a2dbd582a56e1f33cfb04e61fc6865b74c7160babfffd",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v4",
      "size": 426958,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v4",
      "title": "Metroid Fusion APWorld v4",
      "version_simple": "4",
      "world_version": "4"
    },
    "MF-v5": {
      "created_at": "2025-06-22T16:24:51Z",
      "description": "## Changes:\r\n- Updated MARS\r\n- - The biggest change here is that when hidden blocks are revealed, extendable pillars will now have indicators for their location\r\n- - MARS also now supports custom amounts of ammo for missile and power bomb data. Options for these have been added.\r\n- Logic updates to fix various impossible placements.\r\n- Your starting briefing has been changed a bit.\r\n- - Your required number of infant metroids is given to you.\r\n- - Your starting items will be listed.\r\n- - You will only receive the \"Uplink at Navigation Stations\" message if you have hints enabled.\r\n- More options have been added.\r\n- - You can now customize the amount of ammo given by missile and power bomb tanks and data.\r\n- - Toggles for the Reveal Hidden Blocks and Fast Door Transitions features have been added.\r\n- More location groups have been added.\r\n- - `MajorLocations` has been added as a group. This is every location that isn't a visible tank (so bosses and spots where you step on a pad like data and security rooms). Use this for plando, priority, or exclusion.\r\n- - Locations for every major area -- `MainDeckLocations` and `Sector1Locations` to `Sector6Locations` have been added, for use in plando and exclusions. Probably don't use them as priority locations, you'll likely cause generation failures that way without additional starting items. Same goes for making the Main Deck excluded, for obvious reasons.\r\n- - - All locations are where you'd expect they'd be based on their name, except for `Main Deck -- Restricted Airlock`, the one you Shinespark to from Sector 6. This is counted as a Sector 6 location.\r\n- A bug where hints for Sectors 3-6 weren't getting logged on the server has been fixed.\r\n- A bug where a hint for your own item would claim it was in a location in your world when it was in someone else's has been fixed.\r\n- Logging of the current APWorld version used for generation and patching has been implemented.\r\n\r\n## SETUP:\r\n- Put in your AP install's custom_worlds folder.\r\n- Run the Archipelago Launcher and use it to generate a template YAML\r\n- Edit the YAML accordingly.\r\n- Give your YAML to whoever's generating and they put it in their Players folder and run ArchipelagoGenerate.exe.\r\n- Have that person give you the .apmetfus file corresponding to your player slot.\r\n- Open your .apmetfus file with Archipelago. It should prompt you for your legally acquired Metroid Fusion USA rom. Select it.\r\n- Wait for your game to patch. The Bizhawk Client should open automatically with the Bizhawk Client connector lua running. \r\n- - You may be prompted to select an emulator to open the patched ROM with. You'll want EmuHawk.exe in your Bizhawk install directory.\r\n- Connect the Bizhawk Client to the game server, and enjoy playing.\r\n\r\n## Important Notes\r\n- MARS, the underlying randomizer, is in beta and many features are subject to change in the future.\r\n- Check out [the changes from the vanilla game here](https://github.com/Rosalie-A/Archipelago/blob/metroidfusion/worlds/metroidfusion/rom_changes.md)\r\n- Leave any feedback in the Metroid Fusion thread of the Future Game Design forum on the Archipelago Discord.",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v5/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "6f5514ab3336edd04a1b362b23689d29bebccf0fdc774f6fbf072f566d86ad93",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v5",
      "size": 726599,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v5",
      "title": "Metroid Fusion APWorld v5",
      "version_simple": "5",
      "world_version": "5"
    },
    "MF-v6": {
      "created_at": "2025-06-23T20:05:51Z",
      "description": "## Changes:\r\n- Fixed logic error with Mini-Fridge\r\n- Fixed bug where receiving power bombs would cause you to stop receiving items\r\n- Capped power bombs at 99 to avoid glitches.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v6/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "9059d05f4b1f2d7d7170d58cd128f84aaf14e33ec7348f1b0f6bf6cbcfbda25b",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v6",
      "size": 727950,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v6",
      "title": "Metroid Fusion APWorld v6",
      "version_simple": "6",
      "world_version": "6"
    },
    "MF-v7": {
      "created_at": "2025-06-27T23:30:04Z",
      "description": "## Changes:\r\n- Fixed logic errors with the following:\r\n- - Sector 3 Sova Processing now properly requires Level 2 Keycard\r\n- - Sector 4 upper underwater areas now logically require Speed Booster to lower the electrified water.\r\n- - Sector 5 Nightmare area access now requires the ability to fight the underwater pirates\r\n- - Sector 5 Nightmare Nook now properly requires the ability to defeat the eye door.\r\n- - Sector 5 Ripper Road requirements now actually exist.\r\n- - Sector 6 Entrance Lobby now properly requires the ability to destroy the blocking bomb block.\r\n- - Sector 6 Vault now requires the ability to ball jump.\r\n- - Sector 6 Catacombs now properly requires Speed Booster.\r\n- More verbose version logging introduced.\r\n- - The current version will now be logged when generating.\r\n- - Patching the game will log the version the game was generated on and the version being patched with.\r\n- - Connecting the client and playing will log the version generated on, patched with, and the version being played with.\r\n- - If these three versions don't match, unexpected bugs and behaviors may arise, so be sure you stay up to date.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v7/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "2b83edaf2fc3d3efe1c3d4e76a6c17c45abd76e1a73ef81aa6cc8cea4ca344c4",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v7",
      "size": 899128,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v7",
      "title": "Metroid Fusion APWorld v7",
      "version_simple": "7",
      "world_version": "7"
    },
    "MF-v8": {
      "created_at": "2025-06-30T16:05:52Z",
      "description": "## Changes:\r\n- Fixed logic errors with the following:\r\n- - Yakuza access now acccounts for the shot block in the tunnel before the boss.\r\n- - Sector 3 Fiery Storage now logically allows bypassing the enemies in the access way with Gravity Suit.\r\n- - Sector 4 Reservoir Vault now requires either Hi-Jump or Space Jump, instead of just Hi-Jump.\r\n- - The route in the corner of Sector 4 to the right of the Data Room now accounts for the bomb wall.\r\n- - Sector 6 now properly links to the Sector 5-6 tube in logic.\r\n- - The Wave Core-X boss in the Sector 3 Boiler no longer logically requires Charge Beam.\r\n- Bugs with Recharge Rooms were noticed with high values of Missiles and Power Bombs. To address this, Missiles have been capped at 999 and Power Bombs at 99.\r\n- - This is more than you'll ever reasonably need, so I don't think anyone will be too fussed.\r\n- - While this may not directly address all issues caused by recharging and the item reconciliation code colliding, this should at least make it more obvious what's happening, since Fusion otherwise cheerfully overflows the display to low numbers when you're over the visual cap of 999/99.\r\n- The `EarlyProgression` option has been added, with two settings: None, and Normal.\r\n- - Normal is the existing behavior and the default. One of your first two locations (Operations Data Room and Quarantine Bay) are guaranteed to have an item that opens up more locations (Morph Ball or Missile Data).\r\n- - None is a new option that disables this early safety. This may increase generation failures and certainly will increase the chances of being BK'd from the start in larger games.\r\n\r\n## Known Issues\r\n- When receiving Beam items, the graphics may not update properly. This appears to just be a cosmetic issue and is fixed by entering and exiting the pause menu. Let me know if it's something more serious.\r\n- Sometimes when obtaining an Infant Metroid, the message indicating enough have been found will display incorrectly.\r\n- - I haven't figured the cause of this one yet. You can always confirm if you have enough by checking your inventory screen.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v8/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "6e99c90c16739736803081abf6a6191f4e9a88ab17eab5a0f9a71bb23bd01141",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v8",
      "size": 899957,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v8",
      "title": "Metroid Fusion APWorld v8",
      "version_simple": "8",
      "world_version": "8"
    },
    "MF-v9": {
      "created_at": "2025-07-02T19:26:50Z",
      "description": "## Changes:\r\n- Logic fixes and adjustments\r\n- - Typos in a couple of logic definitions were fixed so items you expect to be expected are expected.\r\n- - - Say that three times fast. Or don't, your call.\r\n- - Habitation Deck now properly requires Hi-Jump to climb to the top floor with freezing enemies.\r\n- - Fiery Storage Upper can now require Space Jump.\r\n- - Sector 4 Pump Control now properly requires Level 1 Keycard.\r\n- - XBOX Garage Upper now has proper requirements.\r\n- - Logic now accounts for two-way connections properly.\r\n- Two new options added:\r\n- - `TrickyShinesparksInRegionLogic`\r\n- - - This adds into logic a few connections that require a more difficult or unintuitive shinespark to access. At the moment, this is just the main deck hub to the sector hub and moving into the Sector 1 stabilizer areas, but more are planned to be added.\r\n- - `GameMode`\r\n- - - This affects the starting position of the game. \r\n- - - - Vanilla is the existing behavior\r\n- - - - Open Sector Hub starts you at the sector hub elevator with a random item and an energy tank (overridden by YAML starting inventory), and all sector elevators are accessible. If `EarlyProgression` is enabled, one of four possible items to open up progression will be located at the Sector 2 Security Room.\r\n- The `EarlyProgression` option has a new value, \"Advanced\", which adds in the possibility for the Screw Attack and (if tricky shinesparks are enabled) Speed Booster to the starting items in the vanilla `GameMode`.\r\n- Hints have been adjusted for the Open Sector Hub `GameMode` option\r\n- - In OSH, the Sector 1 through 6 navigation rooms have their hint ability locked behind finding a keycard one level above the one needed to access the sector in vanilla (so Sector 1/2 have their hints enabled with the level 1 keycard, 3/4 with the level 2 keycard, and 5/6 with the level 3 keycard).\r\n- The current sector is now sent to server datastorage.\r\n- - This will allow autotrackers to display the current sector map.\r\n\r\n## Known Issues\r\n- When receiving Beam items, the graphics may not update properly. This appears to just be a cosmetic issue and is fixed by entering and exiting the pause menu. Let me know if it's something more serious.\r\n- Sometimes when obtaining an Infant Metroid, the message indicating enough have been found will display incorrectly.\r\n- - I haven't figured the cause of this one yet. You can always confirm if you have enough by checking your inventory screen.\r\n\r\nSetup guide link: [here](https://github.com/Rosalie-A/Archipelago/wiki/Metroid-Fusion-Setup-Guide)",
      "download_url": "https://github.com/Rosalie-A/Archipelago/releases/download/MF-v9/metroidfusion.apworld",
      "has_manifest": false,
      "hash_sha256": "43c7bc3ef6261b749d72704d53f2d9d86a5e84387fe0f2796d3a1e62fab71996",
      "html_url": "https://github.com/Rosalie-A/Archipelago/releases/tag/MF-v9",
      "size": 904314,
      "source_url": "https://api.github.com/repos/Rosalie-A/Archipelago",
      "tag": "MF-v9",
      "title": "Metroid Fusion APWorld v9",
      "version_simple": "9",
      "world_version": "9"
    }
  }
}
