{
  "description": "Minit is a peculiar little adventure played sixty seconds at a time.",
  "game": "Minit",
  "github": "https://github.com/qwint/APMinit",
  "license": "MIT",
  "manifest_fields": [
    "world_version",
    "minimum_ap_version"
  ],
  "versions": {
    "v0.0.1": {
      "created_at": "2023-10-27T13:54:31Z",
      "description": "many bugs abound, beware",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.0.1/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "9d34eaaf1a9954dc9023acac35a2e263f9fc7019af482a18292156d92ec2addd",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.0.1",
      "prerelease": true,
      "size": 110058,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.0.1",
      "title": "AP Minit Alpha build",
      "version_simple": "0.0.1",
      "world_version": "0.0.1"
    },
    "v0.1.0": {
      "created_at": "2023-11-04T06:11:38Z",
      "description": "Stable alpha version of the game. \r\n\r\n### Changes to vanilla:\r\n* Island Shack currently has an extra lock on it so that you cannot enter if you do not have the items to turn on the teleporter and leave so you cannot softlock yourself. This will go away with the inclusion of a respawn at doghouse feature.\r\n* **There is an extra location available**: you can water the Dolphin NPC south of the Watering Can vanilla location to spawn a heart.\r\n* Regardless of mode both Camera and PressPass will be treated as the same Location, but only PressPass is in the item pool.\r\n* If you have received a remote item from the Archipelago Server, **it does not sync automatically into your inventory**. You are expected to pick up the Archipelago Item that spawns near your current Home to sync your inventory with the server. Local items will automatically be added to your inventory though.\r\n\r\n### Minor bugs:\r\n* Save file percent gets inflated with item syncs.\r\n* Fanfares can sometimes clip you into the terrain stopping movement.\r\n* Non-AP saves can be loaded potentially corrupting your inventory.\r\n* Item and location names are verbose and will be renamed in the future.\r\n* Gameplay after credits hotel residents may visually show up in the hotel even when not saved.\r\n* Hotel backroom coin can be picked up without breaking the pot.\r\n\r\n### Things still to implement\"\r\n* Add a warp back to doghouse to remove the possibility of softlocks.\r\n* Options for:\r\n * Vanilla sword start\r\n * Obscure logic\r\n * Specific goals\r\n * Puzzle-less \r\n * Darkrooms\r\n * Progressive (and reverse progressive) sword\r\n\r\n\r\n",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.1.0/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "9d34eaaf1a9954dc9023acac35a2e263f9fc7019af482a18292156d92ec2addd",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.1.0",
      "size": 110058,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.1.0",
      "title": "AP Minit Stable Alpha",
      "version_simple": "0.1.0",
      "world_version": "0.1.0"
    },
    "v0.2.0": {
      "created_at": "2023-11-05T09:51:55Z",
      "description": "Options are here!\r\nCurrent options are\r\n\r\n- EarlySword: which forces the ItemSword to be in Early Local Items, a good setting for players that want their early game checks to not stop at 1 and/or want an experience a bit closer to Vanilla.\r\n- Darkrooms: which removes FlashLight as a required item from almost all checks even when the room is not visible without it (along with Obscure logic removed all requirements on FlashLight).\r\n- Obscure: which adds extra options for considering a Location in logic and expecting the player to get it - options that are either not something a ordinary player would be expected to know or think to try, or options that are harder to execute (i.e. leaving you with <20 seconds on the clock when executed perfectly)\r\n-  ProgressiveSword: which changes BrokenSword, Sword, and MegaSword to be Progressive items which will grant the relevant sword option in a predetermined order instead of whichever you pick up first. This may be set to forward progressive where MegaSword is the last - an option meant to be paired with Boss Goal - or reverse progressive - an option meant to be paired with Toilet Goal.\r\n- Goal: which sets the win condition for the seed to be either Boss (destroy the Factory machine and beat the Boss), Toilet (find the Broken Sword and flush it down the Factory toilet), or Any\r\n\r\n*while these are all the supported Options in the APWorld, ProgressiveSword does not do anything as of now, and Goal is not enforced by the game yet.\r\n\r\nThis update is also using the Options update for Archipelago, which means that it will not work with v0.4.3 and under. If you need the v0.4.4 prerelease it is accessible in the Archipelago Discord's pins for the #archipelago-dev channel\r\n",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.2.0/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "86a88267d83ea198ea3c493af0b461fab1828e10a02d06eb3f8d80261e30a937",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.2.0",
      "size": 111358,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.2.0",
      "title": "Options Update",
      "version_simple": "0.2.0",
      "world_version": "0.2.0"
    },
    "v0.2.1": {
      "created_at": "2023-11-11T06:00:51Z",
      "description": "Now the Minit client has integration with UniversalTracker!\r\nthis means that as long as you have UniversalTracker installed Minit Client will now also show you the tracker tab that UT adds. There is a specific setup for UT though, so be sure you:\r\n* have the tracker.apworld installed into your libs folder (current version packaged here for convenience) \r\n* have your current game's YAML is your Archipelago/Players file\r\n* have the archipelago generator installed (this should be installed by default with Archipelago 0.4.4+ which is needed for minit post v0.2.0)\r\n\r\nOther changes:\r\n* there is now a respawn at Dog House! press Q on the keyboard to do so in order to unstick yourself if you are locked into a respawn point you can't travel out of. Note: the anti-softlock measures on island shack door are not removed.\r\n* AP Sync no longer grants you items you already have, meaning that the save file percent will no longer inflate, syncing with the apItem pickup will take less time on average and will no longer drop duplicates of item pickups like swords or the watering can.",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.2.1/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "93eb85231454dd8a41a0b485eeeaf96a7371776df0b4ec19ea083d512f94ddde",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.2.1",
      "size": 112357,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.2.1",
      "title": "Tracker update!",
      "version_simple": "0.2.1",
      "world_version": "0.2.1"
    },
    "v0.3.0": {
      "created_at": "2023-11-16T05:17:22Z",
      "description": "deathlink is now avaliable to all Minit players - yes it will count your manual resets :)\r\nThere is a new deathlink setting in the yaml in order to enable this and a deathlink amnesty setting to better tweak how many deaths you send to your friends.\r\n\r\nThere are some strange interactions currently with deathlink where \r\n* sometimes deaths (rightfully earned) get stacked up and sent over time instead of sending as earned\r\n* sometimes item pickups get delayed for a few seconds\r\n* an unknown crash seemingly when receiving a deathlink after dying\r\n* an unconfirmed issue where a location can get marked as sent locally but does not send the message to the client if picking up an item while dying\r\n\r\nBut if you turn deathlink off these should not show up.\r\n\r\nother changes:\r\n* a potential memory leak was cleaned up (which includes a new Generic Tracker apworld for integration)\r\n* gamesaves now keep your sent locations, so loading the same save later will no longer respawn your previously checked locations\r\n* included in the gamesaves update is a new targeting of the save file, this means that you will not be able to load vanilla saves in AP and vice versa going forward but this means that your game settings will reset (once because it loads an empty savefile)\r\n* local collectibles no longer get granted twice (this means no more octopus needs -4 tentacles rip)\r\n* fanfares now stop the clock again, allowing you more flexible routing and doesn't punish you for not mashing out of the fanfare asap",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.3.0/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "96c063745444e4980e0fac28c7c468ce7eae8fc53c8b09c1ba9e2fcaf69a0ae3",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.3.0",
      "size": 117458,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.3.0",
      "title": "Deathlink enabled!",
      "version_simple": "0.3.0",
      "world_version": "0.3.0"
    },
    "v0.4.0": {
      "created_at": "2023-11-23T01:35:53Z",
      "description": "With this update there is now support for an Entrance Rando*\r\n\r\nsome caveats:\r\n* there is no logic related to the randomized map, things could be unreachable, darkrooms may be required, very likely you don't start with an available check, transitions that stop you in your tracks because they plop you into water\r\n* like usual, no promises it has backwards compatibility\r\n* there seems to be some bugs with the game not being sure which layer you should be on? please report if you find any of these\r\n\r\n\r\nBUT, with ER off (a new yaml setting) nothing should be changed\r\nwith ER on, you will get a random map, and be able to traverse it (recommend cheating items in)\r\nthings to note about the ER decisions:\r\n* doors/stairs that move you between layers (i.e. into houses, or into underground sections) are unchanged, i tried randoing these but they were too much headache so they're vanilla again\r\n* the 'overworld' is not randomized, this is to enable things like baiting the sharks into allowing you to swim different locations, and to put the oasis, broken truck, thirsty man into reasonable locations\r\n* some key regions are randomized together: the quicksand, the lighthouse, (really considering making dog house and the tile below it one as well..)\r\n* land and water routes are split up meaning that some otherwise simple transitions become more complicated (i.e. south of dog house is three entrances, right of, left of, and the through the river) but if the water is split by land there is a water route and a land route (i.e. the bridge to lighthouse is one, and any water route west is a second one)",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.4.0/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "78d54d1e1bba9fc9eedbc394bf45da611f0f7b7c294b480ab3b34b10aaedbb0a",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.4.0",
      "size": 141328,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.4.0",
      "title": "Entrance Rando... (kinda!)",
      "version_simple": "0.4.0",
      "world_version": "0.4.0"
    },
    "v0.5.0": {
      "created_at": "2023-11-30T08:28:16Z",
      "description": "It's time for a hodgepodge update, did a lot of work on the ER branch to support the Generic Entrance Rando development, and with it also fixed / improved other things, so you're getting them all.\r\n\r\n**Biggest note:** this now consolidates the Generic ER work being done, the Minit ER work being done (including the shuffled maps with no logic in the first ER update), and the existing randomization work. \r\nDepending on if the Generic ER data is available in your install ER settings will either utilize them or fall back on map shuffle as before, but if you turn ER off they will act the same and not change the workflow\r\n\r\nAs for a real changelog, this pulls in a lot of work done to support Generic Entrance Rando, which includes:\r\n* properly defining two-way static connections and their logic\r\n* updating some missing entrances\r\n* properly defining logic when two different directions of movement need different items (i.e. the box to miner's chest)\r\n* properly defining all unrandomized door entrances for if they are ever added to the rando pool\r\n* reformatted rules text to be inline with styling guidelines\r\n* consolidated static connections\r\n* added framework to define vanilla connections so er_rules and rules can be consolidated in the future\r\n* fixed some invalid coordinates based on testing\r\n\r\nSome refactors happened that should not affect gameplay\r\n* events are handled more generically and some other things like the hotel residents and the bridge being turned on were added as events\r\n* ER will try to be loaded and if it can't will fall back on map shuffling like the last release\r\n* reused region/location setup info is handled in a common method\r\n* flush goal is now handled as an event as well\r\n\r\nAnd general cleanup of comments and TODOs that are not needed\r\n\r\n## And some things people will actually care about\r\n\r\nLogic updates:\r\n* Game gen will now detect a single player game and hint to the item shuffler to put a random choice of swim/wateringCan/Sword to lessen the chance that it runs out of swaps and fails\r\n* ItemGlove now correctly is accessible with just swim\r\n\r\nSome client updates:\r\n* check the goal settings before marking a game as complete\r\n* added proper handling of Progressive Swords (both forwards and reverse)\r\n\r\nSome game updates:\r\n* updates to correct vanilla stairs in certain locations, to reduce the amount of ER-Entrance and DeathPoll calls done when respawning.\r\n* add coin popup when adding coins to inventory and handle progressive sword(s)\r\n* adding progSword handler script that was missed\r\n* updates to support goal locking\r\n* remove debugging logging, leaving only useful log messages\r\n* updating early fixes to despawns so they despawn again but only when already sent\r\nand removed lock on island shack now that die to dog house exists\r\n* potential update to edge case where dying and picking up an item crashes the game\r\n",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.5.0/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "1c724406a1d6ae99d0eef477d5c2dbe67ad66553a71f6d3f468d2e2e1c091409",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.5.0",
      "size": 136198,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.5.0",
      "title": "Progressive Sword, Coin prompts, Goal locking, oh my",
      "version_simple": "0.5.0",
      "world_version": "0.5.0"
    },
    "v0.6.0": {
      "created_at": "2024-02-05T06:40:11Z",
      "description": "Nothing that huge, but the webhost-facing docs were not working or woefully out of date.\r\n\r\nLogic updates\r\n* update to make darkrooms more configurable and remove the dependency on Obscure for harder to navigate rooms (also updated tests and fixed a bug introduced by said update)\r\n* refactored logic to shortcut evaluation more often and to use both the Events made for ER and state.can_reach(Region) when relevant \r\n* set coins to progression_skip_balancing to hopefully run into less swap errors and have less coins filling up early locations.\r\n* various ER support updates including interpret_slot_data for Universal Tracker support of tracking ER (note: it really does not like the 'bad entrances' that get generated when using ER without Generic ER, so uninstall the tracker if you are using that ER for some reason)\r\n  * the Generic ER work referenced is being done at [Generic Entrance Rando - Development](https://discord.com/channels/731205301247803413/1159521365024591985) and currently hosted at [BadMagic's Github](https://github.com/BadMagic100/Archipelago/tree/generic-entrance-rando)\r\n\r\nGame Mod updates:\r\n* updates to game mod to better handle: receiving items while dead, receiving unknown item ids\r\n* added a feature to sync items on every Player respawn (including on save-load) to hopefully smooth out Player experience (this may be reverted if it causes issues, but most should be fixed so it's looking promising) \r\n  * also, this may make the apItem at your current house obsolete, but did not want to remove it yet in case something goes wrong (or i revert the feature altogether)\r\n\r\nMinor updates:\r\n* minor repo cleanup of unneeded files and comments\r\n* various minor docs updates to Options descriptions, Webhost clarity, wording consistency\r\n\r\n\r\n\r\n",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.6.0/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "0bcc71ca23f685cbf4d59b2cdf57eb9584446c4edc295a53f354c901512b69ff",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.6.0",
      "size": 133325,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.6.0",
      "title": "I'm mostly pushing this so the Stripes webhost has actual docs",
      "version_simple": "0.6.0",
      "world_version": "0.6.0"
    },
    "v0.6.1": {
      "created_at": "2024-02-18T20:34:11Z",
      "description": "Major:\r\n* adds start inventory from pool and minHP, and damage boost options\r\n\r\nLogic:\r\n* update temple coin to allow obscure swimming to access the check\r\n* made classification for HeartPiece as well as making flashlight dynamic based on settings\r\n\r\nMinor:\r\n* minor rule optimization\r\n* pulling generic rule utils out to their own file and removing some unnecessary util wrappers\r\n* clean up imports across the apworld\r\n* some minor cleanup in rules.py\r\n* logic refactor now that has_sword is fast\r\n* update count rules to use state.has passing in count\r\n* un-obscure option checking and adding data_version to be set after item/location name rework\r\n* use World instead of MultiWorld for can_create option checking\r\n* updated rules to use a custom collect/remove flag instead of re-evaluating has_sword on every location check\r\n\r\nBugfix:\r\n* fix bugs in ER starting entrance and minhp item filling\r\n* updating doc name *again* to play nice,,\r\n* move er_region_list instantiating to a per-instance level to not leak the multiworld\r\n* update filler item loop to only check locations in current world instead of entire multiworld\r\n* handle errors on interpret_slot_data better and allow create_item to be done with world=none\r\n\r\n\r\nER:\r\n* updates to be in line with latest generic-entrance-rando\r\n* add path hints to locations and spoiler log\r\n* ER Bugfixes and update ER regions to add more darkroom rules where needed\r\n* updated free ER location check to let the game actually know about it and (maybe temporarily) moved it to always instead of just on 1p seeds\r\n* import entrance type from new generic er location\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.6.1/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "1f03856c8782fcd8ebd553d3f611fd01595e45a1b0a33103564dd1cc787589af",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.6.1",
      "size": 129097,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.6.1",
      "title": "Mostly ER fixes (but some new options too!)",
      "version_simple": "0.6.1",
      "world_version": "0.6.1"
    },
    "v0.6.10": {
      "created_at": "2025-10-21T22:02:15Z",
      "description": "fixes a client issues in ER\r\n(and some documentation that's been available on github for a while now)",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.6.10/minit.apworld",
      "has_manifest": true,
      "hash_sha256": "450c1ed20e0e2ef668eaa7abf7c2572f9cc0a6ad4e246d01c7714f255e6b372b",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.6.10",
      "minimum_ap_version": "0.5.0",
      "size": 131853,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.6.10",
      "title": "no longer nice :(",
      "version_simple": "0.6.10",
      "world_version": "0.6.10"
    },
    "v0.6.2": {
      "created_at": "2024-04-22T04:14:34Z",
      "description": "mostly just releasing this so i can get complaints if i messed up my refactors >:)\r\n\r\nupdates:\r\nfixes for python 3.8 compat\r\nER region refactor\r\ngeneral access rule refactor\r\ninternal item refactor\r\nnew cool way to deal with restrictive start fill failures (that doesn't seem to deal with every start with damage boosts on,,)",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.6.2/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "ba99dee8861a06b5dbbe74433f9f8574caa9b46e30b66f308151991593ab38b6",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.6.2",
      "size": 160106,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.6.2",
      "title": "mostly refactors",
      "version_simple": "0.6.2",
      "world_version": "0.6.2"
    },
    "v0.6.3": {
      "created_at": "2024-04-23T05:31:50Z",
      "description": "oops, different logic levels didn't actually work after the refactor, now they should\r\n\r\nalso includes an update to the game mod to remove the 'sync' apitem from near the house because it is obsolete now and was confusing players.",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.6.3/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "aed46909cbb8ad66631aff0bb5571938d9776c26b5642db508cc020d9f7fb85d",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.6.3",
      "size": 160392,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.6.3",
      "title": "bug squashing from refactor",
      "version_simple": "0.6.3",
      "world_version": "0.6.3"
    },
    "v0.6.4": {
      "created_at": "2024-06-23T05:09:29Z",
      "description": "includes updates to most recent version of GER patch\r\nsome refactors for the Client\r\nand added a check for Generation to not allow ER if GER is not found as that combination was only for a proof of concept on entrance shuffling",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.6.4/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "ab182f0f1ed91356368f03792090f8face00161a80f41cf337a0a817ce0dfe63",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.6.4",
      "size": 143405,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.6.4",
      "title": "Generic Entrance Rando updates",
      "version_simple": "0.6.4",
      "world_version": "0.6.4"
    },
    "v0.6.5": {
      "created_at": "2024-11-23T06:10:45Z",
      "description": "**THIS UPDATE WILL ONLY WORK ON 0.5.1+**\r\nbut also there's no world updates so you're not missing out on much\r\n\r\n* The new 0.5.1 launch game from webhost feature is supported!\r\n* updates /Patch to:\r\n   * Save the patched file to a different path so you don't have to keep resetting to vanilla\r\n   * Auto launch the game (partly because with the new patched file location it needs to be launched differently with `minit.exe -game patched_file.win`) \r\n\r\nand some less interesting info\r\n* cleaned up some of the client code\r\n* use the new make_gui method to clean up kivy code in client\r\n* updated deathlink message to be properly formatted",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.6.5/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "2a509e2ad59132dc850eaeb04cf1db25748ea95e7db69abcde696be80dad83ea",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.6.5",
      "size": 133408,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.6.5",
      "title": "Patch upgrade!",
      "version_simple": "0.6.5",
      "world_version": "0.6.5"
    },
    "v0.6.6": {
      "created_at": "2024-11-30T00:53:22Z",
      "description": "fixes a couple of little things:\r\n- use minitGMS2.exe as a backup executable\r\n- move try/catch code to focus the catchable errors\r\n- fix the temporary all caps client in window title lol\r\n- update certain arg handling",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.6.6/minit.apworld",
      "has_manifest": false,
      "hash_sha256": "7ff43407acfc1eedbb4df4113ec3c713ba1d4cc5e2b24a5bbb3464f6f0d4faef",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.6.6",
      "size": 133495,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.6.6",
      "title": "Patch Patch!",
      "version_simple": "0.6.6",
      "world_version": "0.6.6"
    },
    "v0.6.7": {
      "created_at": "2025-03-09T03:49:23Z",
      "description": "fixes the whoopsie that the ER code I had was putting rules on the wrong edge of the randomized entrances, this caused it to have 0 logic for any randomized entrance, which is fixed now",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.6.7/minit.apworld",
      "has_manifest": true,
      "hash_sha256": "e8c49e5b9748393b0cdea483cc18f5daeb4d8b8393d3640c5ca2cd6938cfc6b2",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.6.7",
      "maximum_ap_version": "0.5.0",
      "minimum_ap_version": "0.5.0",
      "size": 145135,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.6.7",
      "title": "ER Has Logic (again) now!",
      "version_simple": "0.6.6",
      "world_version": "0.6.6"
    },
    "v0.6.8": {
      "created_at": "2025-04-05T22:46:51Z",
      "description": "small logic changes to normal logic, but almost entirely ER logic updates thanks to @EzraIII",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.6.8/minit.apworld",
      "has_manifest": true,
      "hash_sha256": "a715e151a347f4a1018b3ab90026e8f1b03ad6ad3417a0b1dd718d358d9a7f4c",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.6.8",
      "maximum_ap_version": "0.5.0",
      "minimum_ap_version": "0.5.0",
      "size": 146923,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.6.8",
      "title": "ER Logic Update",
      "version_simple": "0.6.6",
      "world_version": "0.6.6"
    },
    "v0.6.9": {
      "created_at": "2025-05-26T22:28:49Z",
      "description": "ap0.6.2 prep, mostly refactors for better/up to date code, but also removes an old api call that is removed in ap0.6.2 which would have kept any fanfares from playing",
      "download_url": "https://github.com/qwint/APMinit/releases/download/v0.6.9/minit.apworld",
      "has_manifest": true,
      "hash_sha256": "bfed2366e3b8fa81f4f4f4f3afd2ed129a69a442036e7d5ef36bd16ee4472a29",
      "html_url": "https://github.com/qwint/APMinit/releases/tag/v0.6.9",
      "maximum_ap_version": "0.5.0",
      "minimum_ap_version": "0.5.0",
      "size": 220581,
      "source_url": "https://api.github.com/repos/qwint/APMinit",
      "tag": "v0.6.9",
      "title": "Nice.",
      "version_simple": "0.6.6",
      "world_version": "0.6.6"
    }
  }
}
