{
  "description": "Momodora Moonlit Farewell is a game",
  "game": "Momodora Moonlit Farewell",
  "github": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "AP-v1.0.1": {
      "created_at": "2025-03-30T06:57:02Z",
      "description": "# CHANGELOG\r\n# Newly Added\r\n- Added a setting in the YAML to let world generation consider wheter using the Bell Hover or not.\r\n  - Bell Hover allows you to enter certain areas without having the required skill to enter them (i.e. Demon Frontier without Wall Jump)\r\n- Added a .md file (you can open it with any text editor) with instructions about how to setup the mod and randomizer\r\n# Fixes\r\n- Fixed an issue where you wouldn't receive items that aren't part of the randomization pool (Moonlit Dust or Windmill Key being important examples of this)\r\n- Fixed an issue with world generation where the Awakened Sacred Leaf would be in places unreachable without it",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.0.1/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "8302e91462092ec8ef6a30a9aae0a45818641ce181a3cd13687eacf963eed23f",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.0.1",
      "size": 6741,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.0.1",
      "title": "Archipelago Randomizer v1.0.1",
      "version_simple": "1.0.1",
      "world_version": "1.0.1"
    },
    "AP-v1.5.3": {
      "created_at": "2025-04-01T12:00:40Z",
      "description": "# What's new?\r\n- Updated filler item\r\n- Added new settings to the YAML file\r\n- Added new possible item and location checks\r\n- Fixed some logic for the world generation to hopefully prevent softlocking (possibly not entirely fixed just yet though...)\r\n\r\n# New filler\r\nNow you receive **50 Lunar Crystals** instead of ~~the annoying~~ Blessing of Nothing. This can help with the 4 shop sigil checks.\r\n\r\n# New YAML Settings\r\n\r\n## Randomize Key Items\r\nWith this enabled, three key items are added as location checks and to the randomized item pool. These items are: Gold Moonlit Dust, Silver Moonlit Dust and Windmill Key. The Moonlit Dust is required for getting the Lunar Attunement check, and the Windmill Key is an important item to be able to access the final area. If you have the Windmill Key, you don't need to deliver the Wooden Box to be able to activate the Windmill.\r\n\r\n## Oracle Sigil\r\nWith this setting enabled, the Oracle Sigil is added as a location check and to the randomized item pool. This Sigil is arguibly the hardest to get in the game, but also the best you could have, since it increases crit rate and damage by a great amount. However, in order to get it, you need to free all 30 Lumen Fairies that are all over the map. If you enable this setting, it's very likely one of the last checks you'll have, but it's also possible that you get this Sigil earlier.\r\n\r\n## Final Boss Keys\r\nWith this setting on, it adds 4 progressive keys required to open the door to the final boss. This is usually done by defeating 4 bosses right before this door, but with the setting enabled these bosses will only have their regular location checks but won't help to open the door.\r\n\r\nIf you have this setting on as well as the Oracle Sigil setting, there's a possibility that one of the keys is in the Oracle Sigil check, making completing the game a very long task.\r\n\r\n# New Item and Locations\r\nThe following items and locations are enabled depending on their respective setting in the YAML file.\r\n- Gold Moonlit Dust, Silver Moonlit Dust and Windmill Key (depends on **randomize_key_items**)\r\n  - The Moonlit Dust are used for the Lunar Attunement check\r\n  - The Windmill Key is used to activate the Windmill and allow access to the second half of Meikan Village and the Fount of Rebirth (the final area of the game). If you have this item, you don't need to hand the Wooden Box in order to be able to use it; although handing over the Wooden Box still does count as a check location\r\n- Oracle Sigil (depends on **oracle_sigil**)\r\n  - It's recommended to have this setting off since this is a very hard Sigil to get, given that it requires you to free all 30 Lumen Fairies scattered all over the map. However, if you enable this, you might receive the Oracle Sigil at any point, which is a very powerful Sigil. Ultimately, it's a high risk high reward setting to have enabled\r\n- 4 Progressive final boss keys (depends on **final_boss_keys**)\r\n  - This doesn't have a corresponding location, so it's only the items you can receive\r\n  - When you have all 4 Progressive Final Boss Keys, you can enter the area to fight the final boss without having to fight the 4 bosses before it. \r\n  - **IMPORTANT NOTE**: if you have this setting on and the Oracle Sigil setting on, there's a possibility that the Oracle location check has one of these keys. This would make completing the game a much longer task (it could be funny though).\r\n\r\n# World Generation Logic\r\n- Removed a bubble in the Lun Tree Roots after defeating Viper Archdemon Sorrellia that required wall jump to be able to progress to the Demon Frontier. Now you can use the trampoline and reach Demon Frontier even if you don't have wall jump yet.\r\n- Updated the logic to consider the bell_hover_generation setting whether it's on or off. With the setting on, you might need to get creative to reach certain places, but it's possible (at least from my testing of some mildly extreme areas).\r\n- World generation now considers Gold Moonlit Dust as reachable with wall jump and either double jump or perfect chime (turns out you can't get it with just wall jump, no matter how hard I tried)\r\n  - Fixed an issue where the world wouldn't generate if randomize_key_items was off due to this rule in specific\r\n\r\n# Some issues\r\n## Stuck in Harpy Room\r\n- For some reason, with the open_springleaf_path setting on, the windzones in the fight with the Harpy, and only in this room, are **not** removed (I'm looking into this). If you find yourself in this situation and can't leave the room, go back to the Title Screen and reload your save file. The red barrier that appears to the right of the room will be gone.\r\n  - If you have **wall jump** or **double jump** you can just use those to leave the room. **If you don't**, the only other way I can think of is using [Bell Hover](https://www.youtube.com/watch?v=wEe-bJFBG_Q) for that particular place. This is a handy guide showcasing Bell Hover, and you can use the healing bell it up to 3 times to gain enough height to leave the room.\r\n## Losing a Skill I Already Had\r\n- This can happen when you enter a room where you get this skill, you can return to the title screen and open your save file again, ideally having saved in a room different to where you get the skill. This is an oversight due to how the game handles skills and how I handle receiving them, so until I come up with a proper solution I'm afraid this is the workaround\r\n  - This isn't much of an issue in most skills/rooms, but the room where you get Lunar Attunement can be a bit bothersome since you may go through that room a couple times. Fortunately you don't need Lunar Attunement in the Ashen Hinterlands, at least for the current location checks.\r\n  - I'm considering an alternative to the checks for these locations when you already have the skill so that we don't have to deal with losing it\r\n## Sending a Check When Reloading the Game\r\n- If you open your file when you have a skill but haven't checked it's location yet, the game will send that location as if it was just checked. Also an oversight from my part, but on the bright side, only 5 locations are affected by it so at least you're not sending too much stuff... (hopefully)\r\n\r\nIf any issues are found during playing or playtesting, please do let me know in the discord forum so I can look into them. Ultimately, this is still a work in progress so it's not free of bugs, but I'd argue it's very much completable most of the time.\r\n\r\nAlso, feel free to ask for advice or share what you find! There might be some places that, even with their respective YAML setting, might need some creativity or use of some strats to reach, since considering every possibility of entrance is quite a task, so having information on how to reach certain places can be very useful!",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.5.3/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "d1d30608e90a9d1b9896b2516d831ac3fe9f6c9a47e7da7392ad72dc95d73389",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.5.3",
      "size": 7873,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.5.3",
      "title": "Archipelago Randomizer v1.5.3",
      "version_simple": "1.5.3",
      "world_version": "1.5.3"
    },
    "AP-v1.6.0": {
      "created_at": "2025-04-01T16:03:54Z",
      "description": "What's new?\r\n- Added all Cereza's shop Sigils as location checks (the entire shop is now unlocked from the start)\r\n- Incraesed amount of Lunar Crystals received as filler item from 50 to 100 \r\n- Added Heavenly Lilies as optional checks and progressive damage upgrades to the itempool (each upgrade grants 2 additional damage)\r\n- Updated filler item to now grant 100 Lunar Crystals\r\n- Entering the room where you'd get a skill while having the skill now sends the location check without needing to check the specific location and without removing the skill\r\n  - Entering the Harpy fight while already having the Dash skill will still remove the Dash skill, but you should get it back after picking up the item you get from the Harpy\r\n  - For the Lunar Attunement location check, you need to have Gold Moonlit Dust and Silver Moonlit Dust, and have defeated the Tainted Serpent for the location to be sent",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.6.0/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "a0f7eb911b6527fa50b1eb8905cce57c736b987d860db78d7c5ebe1e85a3a162",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.6.0",
      "size": 8910,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.6.0",
      "title": "Archipelago Randomizer v1.6.0",
      "version_simple": "1.6.0",
      "world_version": "1.6.0"
    },
    "AP-v1.6.1": {
      "created_at": "2025-04-23T02:01:52Z",
      "description": "# Fixes\r\n- Fixed the value used for some Heavenly Lilies to their correct values. Now their checks are properly sent and no longer act as vanilla.\r\n  - Heavenly Lily 2 in Demon Frontier\r\n  - Heavenly Lily 1 in Moonlight Repose\r\n  - Heavenly Lily 3 in Fount of Rebirth\r\n- Modified apworld to consider Heavenly Lilies 2 and 3 in Ashen Hinterlands to be obtainable with only Crescent Moonflower and Spiral Shell (Double Jump and Wall Jump respectively)\r\n\r\n# Install Notes\r\nIf you previously installed the mod, you only need to download the updated **apworld** and the **APMomoMFRandomizer.dll** file. \r\n\r\nIf this is your firts time installing the mod, also download **extra-files.zip** and unzip the files in the Mods folder in the game, next to the APMomoMFRandomizer.dll file.",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.6.1/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "ccc9e0d3748cb0d77610cc0165f9d31a4fb49a4e40566d2e881bbc36366f342c",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.6.1",
      "size": 8902,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.6.1",
      "title": "Archipelago Randomizer v1.6.1",
      "version_simple": "1.6.1",
      "world_version": "1.6.1"
    },
    "AP-v1.6.2": {
      "created_at": "2025-05-01T23:42:04Z",
      "description": "# Fixes\r\n- Updated location of Moon Goddess Lineth from Meikan Village to Meikan Village Windmill in the apworld\r\n  - this area is reachable when you get the Windmill Key, but since she previously was in **Meikan Village**, if the Windmill Key was in the item pool, there was a chance that it would be in her location, which is unreachable without the Windmill Key\r\n- Updated location of Heavenly Lily 3 - Meikan Village from Fount of Rebirth to Meikan Village Windmill\r\n\r\n# Install Notes\r\nf you previously installed the mod, you only need to download the updated apworld.\r\n\r\nIf this is your firts time installing the mod, also download APMomoMFRandomizer.dll and extra-files.zip. Move **APMomoMFRandomizer.dll** into the Mods folder in the game files, and unzip the **extra-files.zip** files into the same folder.",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.6.2/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "0ed6f933a8f027b0ca7678bc53845d42463d1f602a7512e947b30f3ebcaa7796",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.6.2",
      "size": 8861,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.6.2",
      "title": "Archipelago Randomizer v1.6.2",
      "version_simple": "1.6.2",
      "world_version": "1.6.2"
    },
    "AP-v1.6.3": {
      "created_at": "2025-05-04T19:42:29Z",
      "description": "# Fixes\r\n- Removed the door to the entrance of the Black Cat fight in Lun Tree Roots\r\n  - It appeared that if you didn't trigger this door before the bubbles appeared, the door would remain closed and you couldn't progress (maybe some issues with sequence breaking due to randomizer stuff?)\r\n\r\n# Install Notes\r\nThis update only updated the **APMomoMFRandomizer.dll** mod. If you previously installed the mod, you just need to download that file.\r\n\r\nIf this is your first time installing this mod, also download **extra-files.zip** and unzip its contents into the game's Mods folder.",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.6.3/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "0ed6f933a8f027b0ca7678bc53845d42463d1f602a7512e947b30f3ebcaa7796",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.6.3",
      "size": 8861,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.6.3",
      "title": "Archipelago Randomizer v1.6.3",
      "version_simple": "1.6.3",
      "world_version": "1.6.3"
    },
    "AP-v1.7.0": {
      "created_at": "2025-05-14T23:13:13Z",
      "description": "# What's New\r\n- Added new victory condition: the post-game Dora fight\r\n  - Completely optional: if you die while in the credits roll, you can skip the credits. I haven't implemented a function to skip the credits just yet (working on it), but if playing with other people with deathlink on, they could help you with this\r\n- Added new optional location checks and items \r\n  - Dotted berries and progressive health\r\n  - Lun Berries and progressive magic\r\n  - Peaches and progressive stamina regen\r\n  - Progressive lumen fairies - with this setting on, you need 30 Lumen Fairies for the Oracle location check to be available (if the Oracle setting is available)\r\n- Shop now displays the AP Item you're buying, and whether it's for another player or yours\r\n- The mod file is now changed to **APMomodoraMoonlitFarewell.dll**\r\n\r\n# Fixes\r\n- Receiving fast travel no longer sends the fast travel location check; now the check happens in the Demon Frontier entrance where you first encounter Mitchi\r\n- After reloading a save file, a regular skill location check is no longer sent if you already have that skill but haven't checked its location yet\r\n\r\n# Some known issues\r\n- I think I broke the money filler item and ruined the game's economy (you might get a lot of money suddenly, I'm working on that......)\r\n  - Similarly, the 100 Lunar Crystals filler item doesn't seem to work properly on async playthroughs\r\n\r\n# Install notes\r\n## Updating the mod\r\nIf you already have a previous version of the mod, replace the **APMomoMFRandomizer.dll** file with the new **APMomodoraMoonlitFarewell.dll** file in the game's Mods folder, as well as downloading the new **apworld** and YAML\r\n## First time installing\r\nFollow the previous steps, as well as downloading the **extra-files.zip** folder. Extract the contents of this folder in the game's Mods folder, next to **APMomodoraMoonlitFarewell.dll**",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.7.0/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "3a4f4cf5f09cac81fb181980b34212f3ae7db7c4071a8204607404075877745c",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.7.0",
      "size": 10561,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.7.0",
      "title": "Archipelago Randomizer v1.7.0",
      "version_simple": "1.7.0",
      "world_version": "1.7.0"
    },
    "AP-v1.7.1": {
      "created_at": "2025-05-14T23:13:13Z",
      "description": "# Fixes\r\n- Fixed Dotted Berries in Springleaf Path and Demon Frontier not sending the check when picking them up\r\n- Fixed logic with the apworld\r\n\r\n# Install Notes\r\n## Updating\r\nThis is only an update in the **apworld**, so if you already have the mod, just download the apworld\r\n## First TIme Installing\r\nYou can follow the instructions in the [README](https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/blob/Archipelago-Randomizer/README.md) for detailed instructions. However, if you already have MelonLoader installed in the game:\r\n\r\n- Download **APMomodoraMoonlitFarewell.dll** and **extra-files.zip**, and place the dll and the extracted files from the zip in the game's Mods folder.\r\n",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.7.1/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "ce5b25dffb958eaf736b459f97ca68855f4b752b4cc49317a55dbc5bc5517088",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.7.1",
      "size": 10591,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.7.1",
      "title": "Archipelago Randomizer v1.7.1",
      "version_simple": "1.7.1",
      "world_version": "1.7.1"
    },
    "AP-v1.7.2": {
      "created_at": "2025-05-28T03:07:29Z",
      "description": "# Fixes\r\n- Fixed Dotted Berry 1 - Ashen Hinterlands not sending the location check\r\n- Fixed Dotted Berry 2 - Ashen Hinterlands being sent in Fairy Springs\r\n- Added Awakened Sacred Leaf as an option to reach Springleaf Path's Lun Berry in the apworld\r\n- Fixed logic in the apworld to get Lun Berry - Koho Village\r\n\r\n# Other Changes\r\n- Levers in the cave leaving Koho Village are now open, so you can enter Koho Village from Springleaf Path without defeating the Gariser Demon\r\n- The Dotted Berries and the Peach that require money and waiting 10 minutes now (should) start already growing when you first start the save file.\r\n  - This should make it so you can get those locations checks 10 minutes into the run - ideally you won't reach them before, or at least you won't have to wait that long to get those checks\r\n\r\n# Install Notes\r\n## Updating\r\nThis is an update to the **apworld** and the **APMomodoraMoonlitFarewell.dll** file, so if you already have the mod installed, download these two and replace your existing **APMomodoraMoonlitFarewell.dll** file in the game's Mods folder\r\n## First TIme Installing\r\nYou can follow the instructions in the [README](https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/blob/Archipelago-Randomizer/README.md) for detailed instructions. However, if you already have MelonLoader installed in the game:\r\n\r\n- Download **APMomodoraMoonlitFarewell.dll** and **extra-files.zip**, and place the dll and the extracted files from the zip in the game's Mods folder.\r\n",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.7.2/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "756cedf5072579806405e26c444728faabbc50d1b9cf31b6280272e25409278c",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.7.2",
      "size": 10590,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.7.2",
      "title": "Archipelago Randomizer v1.7.2",
      "version_simple": "1.7.2",
      "world_version": "1.7.2"
    },
    "AP-v1.7.3": {
      "created_at": "2025-06-30T01:50:09Z",
      "description": "# Fixes\r\n- Added progressive_magic to exclusion table, now world generation should work with the magic setting disabled\r\n\r\n# Install Notes\r\nThis is an update to the **apworld** only. If you already have the mod, just download momodoramoonlitfarewell.apworld and update the one in your Archipelago folder\r\n# First Time Installing\r\nYou can follow the instructions in the [README](https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/blob/Archipelago-Randomizer/README.md) for detailed instructions. However, if you already have MelonLoader installed in the game:\r\n\r\n- Download **APMomodoraMoonlitFarewell.dll** and **extra-files.zip**, and place the dll and the extracted files from the zip in the game's Mods folder.\r\n",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.7.3/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "58d9a42b7b66f8c0b5c061ab52e7e84f4e0599675ac73cfe8eea603f8b768bd8",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.7.3",
      "size": 10610,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.7.3",
      "title": "Archipelago Randomizer v1.7.3",
      "version_simple": "1.7.3",
      "world_version": "1.7.3"
    },
    "AP-v1.7.4": {
      "created_at": "2025-07-06T23:40:16Z",
      "description": "# Fixes\r\n- Fixed Sacred Anemone location not sending when you already have the Sacred Anemone\r\n- Fixed an issue where, if in the YAML the settings for health, magic, fairies, etc, was off, the game wouldn't update the values properly and would leave them capped at their starting value\r\n# Install Notes\r\n## Updating\r\nThis is an update to the **APMomodoraMoonlitFarewell.dll** file, so if you already have the mod installed, download this one and replace your existing **APMomodoraMoonlitFarewell.dll** file in the game's Mods folder\r\n## First TIme Installing\r\nYou can follow the instructions in the [README](https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/blob/Archipelago-Randomizer/README.md) for detailed instructions. However, if you already have MelonLoader installed in the game:\r\n\r\n- Download **APMomodoraMoonlitFarewell.dll** and **extra-files.zip**, and place the dll and the extracted files from the zip in the game's Mods folder.",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.7.4/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "58d9a42b7b66f8c0b5c061ab52e7e84f4e0599675ac73cfe8eea603f8b768bd8",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.7.4",
      "size": 10610,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.7.4",
      "title": "Archipelago Randomizer v1.7.4",
      "version_simple": "1.7.4",
      "world_version": "1.7.4"
    },
    "AP-v1.7.5": {
      "created_at": "2025-08-12T01:56:11Z",
      "description": "# Fixes\r\n- Fixed logic for locations in Springleaf Path in the apworld\r\n  - Locations that were previously blocked by a wind current are now considered part of a region blocked by a wind current. There shouldn't be problems now where you can't reach a location that you should theoretically be able to without having Sacred Anemone\r\n - Fixed Heavenly Lily 2 - Old Sanctuary considered reachable without Spiral Shell and when the bell hover setting was off, it now considers the correct things to be able to reach it (similarly to the fairy in the same room)\r\n\r\n# Install Notes\r\n## Updating\r\nThis is an update to the **apworld** file, so if you already have the mod installed, you don't need to download the **APMomodoraMoonlitFarewell.dll** file, only the apworld if you're the host, or whoever is hosting the room\r\n\r\n## First TIme Installing\r\nYou can follow the instructions in the [README](https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/blob/Archipelago-Randomizer/README.md) for detailed instructions. However, if you already have MelonLoader installed in the game:\r\n\r\n- Download **APMomodoraMoonlitFarewell.dll** and **extra-files.zip**, and place the dll and the extracted files from the zip in the game's Mods folder.",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.7.5/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "515dbb145f4d8dad8b3b1dec49f46b30d66321af67f779d46a07bbf66a0c6a4a",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.7.5",
      "size": 10648,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.7.5",
      "title": "Archipelago Randomizer v1.7.5",
      "version_simple": "1.7.5",
      "world_version": "1.7.5"
    },
    "AP-v1.7.5.1": {
      "created_at": "2025-08-22T13:22:18Z",
      "description": "# Fixes\r\n- Added logic to make Lumen Fairies classified as progression when the Oracle Sigil setting is on\r\n\r\n# Install Notes\r\n## Updating\r\nThis is an update to the **apworld** file, so if you already have the mod installed, you don't need to download the **APMomodoraMoonlitFarewell.dll** file, only the apworld if you're the host, or whoever is hosting the room\r\n\r\n## First TIme Installing\r\nYou can follow the instructions in the [README](https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/blob/Archipelago-Randomizer/README.md) for detailed instructions. However, if you already have MelonLoader installed in the game:\r\n\r\n- Download **APMomodoraMoonlitFarewell.dll** and **extra-files.zip**, and place the dll and the extracted files from the zip in the game's Mods folder.",
      "download_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/download/AP-v1.7.5.1/momodoramoonlitfarewell.apworld",
      "has_manifest": false,
      "hash_sha256": "3ffaf7ba0770254804ffbc2cddbe63eda73f8fe7eba3d21622a8a1c895030599",
      "html_url": "https://github.com/alditoOt/Momodora-Moonlit-Farewell-Randomizer/releases/tag/AP-v1.7.5.1",
      "size": 10694,
      "source_url": "https://api.github.com/repos/alditoOt/Momodora-Moonlit-Farewell-Randomizer",
      "tag": "AP-v1.7.5.1",
      "title": "Archipelago Randomizer v1.7.5.1",
      "version_simple": "1.7.5.1",
      "world_version": "1.7.5.1"
    }
  }
}
