{
  "description": "",
  "game": "Nine Sols",
  "github": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer",
  "license": "MIT",
  "manifest_fields": [
    "minimum_ap_version",
    "world_version"
  ],
  "versions": {
    "0.1.0": {
      "created_at": "2025-03-10T14:44:37Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\nFirst playable version 🎉\r\n\r\nSince this is the first public release, expect bugs and missing features. In particular:\r\n- there is no boss scaling; story mode is recommended\r\n- for now the only tracker is Universal Tracker",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.1.0/nine_sols.apworld",
      "has_manifest": false,
      "hash_sha256": "1976ecbf1410b8cfaec3363801bbd08e01876030cedc428ecce061c4912728ba",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.1.0",
      "size": 81795,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.1.0",
      "title": "0.1.0",
      "version_simple": "0.1.0",
      "world_version": "0.1.0"
    },
    "0.1.1": {
      "created_at": "2025-03-10T22:51:55Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\nThis should resolve the most severe bugs reported on the day of 0.1.0's release:\r\n- Unbroke the prompt after the Kanghui fight, so \"Prison: Defeat Kanghui\" and most Factory (MR) locations are reachable again.\r\n- Fixed the logic for crossing Lake Yaochi Ruins. Somehow I missed that one of the pagoda roofs breaks after you land on it, and once broken requires an item to get past.\r\n- Fixed \"LYR: Nymph Puzzle Room Near Stele\" and \"W&OS: Climb Elevator Shaft By Root Node\" and \"CTH: Side Room Near Right Exit\" so now they all logically require the nymph.\r\n- Disabled the combat tutorial in the top left corner of AF (Monitoring), since walking into it \"the wrong way\" in rando leads to softlocks.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.1.1/nine_sols.apworld",
      "has_manifest": false,
      "hash_sha256": "b67b6b20303ef36ed3d9dbe607a003b3ca6f4c37aca9dfbdd67c370b406377df",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.1.1",
      "size": 81907,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.1.1",
      "title": "0.1.1",
      "version_simple": "0.1.1",
      "world_version": "0.1.1"
    },
    "0.1.2": {
      "created_at": "2025-03-14T23:55:11Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\nThis should resolve most of the high priority and \"quick win\" issues that came up in the first week of public release:\r\n\r\n- Fixed all known logic and mod bugs that could lead to unbeatable seeds:\r\n\t- Shanhai chip locations can now be checked even if you have the corresponding chip item in your inventory\r\n\t- There's a door in the bottom right corner of Yinglong Canal that prevents you from entering Water & Oxygen Synthesis until you disable the middle waterfall in Greenhouse. Logic was not aware of this, and now it is.\r\n\t- Fixed \"ED (Passages): Hack 2 Statues\" so it logically requires Unbounded Counter for the hammer statue.\r\n- Changed the Jiequan 1 fight in Factory (Great Hall) so that you can simply walk past Jiequan if you don't want to be forced into the Prison sequence yet. Now you have to stand in front of him and press a button to trigger those events.\r\n- Added a \"Show Archipelago Messages In-Game\" client setting that defaults to true, so now you can disable this in the usual F1 menu if you want the game to stop logging AP messages.\r\n- Loading an \"Adventure Completed\" randomizer save after defeating Eigong will now take you back to your last root node save before entering New Kunlun Control Hub (instead of starting a brand new save file). This should make it much easier to continue checking locations after the goal is complete.\r\n- Deleting a save file should now correctly (if vanilla) re-enable the button once it says New Game, and (if AP) hide the Change Connection Information button.\r\n- Cixing's spawn conditions (and the conditions for the 3 sage statues lighting up) have been fixed to depend only on examining the murals in the 3 tombs. For some reason in vanilla they also sometimes maybe depend on having the database entries for the murals, so receiving those AP items was putting them in confusing states.\r\n- Corrected the \"Furnance\" typo in \"Factory (GH): Examine Furnace Monitor\" location name",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.1.2/nine_sols.apworld",
      "has_manifest": false,
      "hash_sha256": "eb309cd4848ec2694a46557057c09a8c81a61288f788abb4c336bfb7627955fb",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.1.2",
      "size": 81984,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.1.2",
      "title": "0.1.2",
      "version_simple": "0.1.2",
      "world_version": "0.1.2"
    },
    "0.1.3": {
      "created_at": "2025-03-17T23:18:25Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Implemented a `skip_soulscape_platforming` yaml option, which makes the randomizer unlock Lady E's boss fight when you find your 4th Sol Seal, instead of her usual soulscape platforming sequence. Note this is a yaml/generation option because it (slightly) affects logic.\r\n- Reimplemented Jiequan 1 camera lock disabling. Hopefully the camera will no longer get confused if you happen to be in Factory (GH) when you unlock Jiequan 1.\r\n- Attempted to mitigate native Unity crashes on receiving items. I'm not expecting much since these kinds of crashes are out of any mod's control, but it's worth a shot.\r\n- \"Factory (U): Below Walkway to Left Exit\" was in the wrong logic region, making it incorrectly logically reachable without air dash to cross the laser blocking the left side of Factory (U).\r\n- In some cases, checking \"FSP: Isolate the Mutant Gene Sequence\" would incorrectly give you the vanilla reward (Super Mutant Buster) in addition to the Archipelago item. Hopefully we got the last of these cases.\r\n- Added a Client/Mod Settings section to the README\r\n- Prevent the base game code from showing the Lady E map marker at incorrect-for-rando times, and from showing a Ruyi map marker for a conversation you may have already perma-missed.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.1.3/nine_sols.apworld",
      "has_manifest": false,
      "hash_sha256": "c821bd3b59cf9e56468d22ff669a75cf4dad9dceef3c4e30fea59955061232ef",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.1.3",
      "size": 83481,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.1.3",
      "title": "0.1.3",
      "version_simple": "0.1.3",
      "world_version": "0.1.3"
    },
    "0.1.4": {
      "created_at": "2025-03-20T22:22:47Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Worked around a native Unity crash when triggering Lady E's soulscape (and possibly also the Jiequan 1 fight?) by moving the important code from the websocket thread to Unity's Update() method. Thanks @GameWyrm and @Chris-Is-Awesome for the \"websocket thread\" theory.\r\n\t- There may or may not be other sources of native crashes we haven't pinned down yet. This is just the one I've been able to consistently reproduce on my machine.\r\n- Fixed \"AF (Elevator): Hack Statue\" so it logically requires Tai-Chi Kick\r\n- Prevented goal from triggering when defeating Eigong in Battle Memories instead of an AP save.\r\n- Disconnect from Archipelago when entering Battle Memories, which should prevent any future bugs involving Battle Memories from having a serious impact.\r\n- Prevented Shuanshuan's book from reappearing on the shelf after you've already picked it up.\r\n- Fixed various bugs when deleting a save slot then immediately creating a new game in the same slot, mostly by doing more thorough cleanup during deletion.\r\n- Applied the progression_skip_balancing flag to progression items that only affect a single location. You're unlikely to notice the impact of this, but it might help generation performance for larger multiworlds.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.1.4/nine_sols.apworld",
      "has_manifest": false,
      "hash_sha256": "6411ad5f4e1535a6437172ff06f464b82cc52575e3b7635f091eba6ac1324f4f",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.1.4",
      "size": 83609,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.1.4",
      "title": "0.1.4",
      "version_simple": "0.1.4",
      "world_version": "0.1.4"
    },
    "0.1.5": {
      "created_at": "2025-04-06T23:59:31Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Unbreak connecting to multiworlds generated with AP 0.6.2. Apparently my test builds and my release builds have been configured to use completely different versions of the Archipelago client library this whole time, and it never caused any problems until AP 0.6.2's release.\r\n- Universal Tracker features:\r\n\t- Yaml-less support. Exactly what it sounds like: You don't need to keep the .yaml around any more to use UT with Nine Sols.\r\n\t- Map Pages. This is effectively a poptracker pack inside of Universal Tracker. Just launch UT as usual, connect to a Nine Sols slot, and you'll see a \"map page\" tab appear. It will wake up on a world map, but as you move around the game it will load different map pages for each area you enter.\r\n- Logic fixes:\r\n\t- \"AF (Depths): Hack 3 Statues\" now logically requires Tai-Chi Kick\r\n\t- \"ED (Passages): Hack 2 Statues\" no longer logically requires Air Dash, since I realized it's really easy with just Cloud Leap\r\n\t- The goal / Eigong fight is now logically placed in Central Hall instead of Four Seasons Pavilion. This doesn't matter yet, but it likely would become a problem once alternate spawns are implemented.\r\n- The white/non-Archipelago on-screen message when checking a location has been removed, since we're pretty sure location checking works and this is just redundant. So now you'll only get the standard Archipelago message.\r\n- Fix `shuffle_sol_seals: false` to generate the same number of items as locations. I don't know of any player workflows this was breaking in practice, but it was a clear bug and an easy fix.\r\n- Fix \"Memoral\" typo in \"Central Hall: Examine Launch Memorial\" location name.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.1.5/nine_sols.apworld",
      "has_manifest": false,
      "hash_sha256": "82a459ec0f5a7b5f54938b1c1b1182844b4132eac94acb3222867f076e4f702c",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.1.5",
      "size": 2926495,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.1.5",
      "title": "0.1.5",
      "version_simple": "0.1.5",
      "world_version": "0.1.5"
    },
    "0.1.6": {
      "created_at": "2025-08-20T01:25:17Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Added `seals_for_eigong`, `seals_for_prison`, and `seals_for_ethereal` options.\r\n- Added location name groups \"Sol Seal Locations\" and \"Sol Fight Rewards\"\r\n- Made BepinExConfigurationManager a hard dependency, so players can access settings simply by pressing F1, instead of having to be told to quit and add another mod first.\r\n- Fixed the `<color='orange'>` bug with in-game warning messages\r\n- Renamed \"Sky Tower: Wall Climb Platform\" to \"Sky Tower: Middle Right Chest\"\r\n- Potentially reduced crashes by moving item receiving code off the websocket thread. It's difficult to prove this works, but anecdotal experience with the Outer Wilds randomizer implies it's the only effective way for mods like this to mitigate native Unity instability.\r\n- Applied the new `deprioritized` flag to the least helpful progression items so they'll be ignored by `priority_locations` (if you're generating with AP 0.6.3 or later), in addition to the `skip_balancing` flag I was already applying. Those items are: (Artifact) Ancient Sheet Music, (Artifact) Legend of the Porky Heroes, Homing Darts, Thunderburst Bomb, Ancient Penglai Ballad, Ji's Hair, and Tianhuo Serum.\r\n- Fixed all known bugs with the Universal Tracker Map Pages:\r\n\t- Added missing \"AF (Elevator): Elevator Shaft\" location\r\n\t- Added missing \"AF (Elevator): Over Electrified Floor\" location\r\n\t- Added missing \"Central Hall: Examine Launch Memorial\" location\r\n\t- Corrected position of \"ED (Sanctum): Defeat Mutated Xipu Below Nobility Hall\" location\r\n- Updated the Universal Tracker section of the README, including screenshots of the Map Pages\r\n- Edited `skip_soulscape_platforming` description to explain its effect on logic\r\n- Tweaked my project configuration and dev/release build processes to reduce manual steps involved in updating the Archipelago MultiClient.Net client library. This *should* prevent any repeats of the issue which broke Nine Sols for everyone when AP 0.6.2 came out (and was hotfixed in 0.1.5).\r\n- I've added [the proposed apworld manifest](https://github.com/ArchipelagoMW/Archipelago/pull/4516) to nine_sols.apworld and used [the proposed apworld build tool](https://github.com/ArchipelagoMW/Archipelago/pull/5340) to create it. This won't benefit players anytime soon, but hopefully it's a step towards a proper core AP toolchain for managing custom apworlds.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.1.6/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "57714a1fa6f5d94b9909ba3bf2098177ceaff443918efbe2afaedfc0686b8abf",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.1.6",
      "minimum_ap_version": "0.5.0",
      "size": 2931818,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.1.6",
      "title": "0.1.6",
      "version_simple": "0.1.6",
      "world_version": "0.1.6"
    },
    "0.1.7": {
      "created_at": "2025-09-25T01:29:41Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Randomizer mod bugs:\r\n\t- Fixed Factory (Great Hall) camera getting stuck and failing to follow Yi around after you had enough Sol Seals to unlock the Jiequan 1 fight and Prison sequence\r\n\t- Fixed Universal Tracker defaulting to only 1 Sol Seal for Prison and Ethereal regardless of Sol Seal options\r\n\t- Fixed post-Lady Ethereal cutscenes giving you the Nymph when you don't have the AP Nymph item\r\n\t- Fixed Ruyi calling you in the FSP to stop you from leaving even if you already opened the door from the outside (after Lady Ethereal, before double jump)\r\n\t- Fixed Azure Bow and Super Mutant Buster failing to appear in the Inventory menu when you have the corresponding AP items\r\n- Logic changes:\r\n\t- CTH: Large Elevator Shaft incorrectly required Cloud Leap and Air Dash no matter what CTH entrances you had access to. Now, if you have the top entrance, nothing else is required, since you can simply fall down from above if you miss it the first time.\r\n\t- AM: Above Left Exit incorrectly required Cloud Leap. Now it only requires Nymph to reach the general area.\r\n\t- Yinglong Canal: Climbing Puzzle Above Farmland Markings now requires nothing at all. Our best guess is that I somehow missed the rope that makes the last jump free.\r\n\t- The connection from the post-Goumang part of Grotto of Scriptures (Entry) to the part with the Root Node now logically requires only one of Charged Strike or Cloud Leap. It used to mistakenly require both.\r\n\t- Added a missing logical connection from \"GoSW - Lower Left Transporter\" to \"GoSW - Cixing Arena\".\r\n\t- Activating the crates at the bottom of Outer Warehouse now logically requires Air Dash and Nymph for the return trip. Previously this logic was only considering the trip *to* the hack point, but Yanlao activates more hazards on the return trip.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.1.7/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "5efb64588df03966d60437727fe8135d2c32c31d59a5ea266823f5eb5e341f00",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.1.7",
      "minimum_ap_version": "0.5.0",
      "size": 2895159,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.1.7",
      "title": "0.1.7",
      "version_simple": "0.1.7",
      "world_version": "0.1.7"
    },
    "0.2.0": {
      "created_at": "2025-10-09T18:47:13Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\nThis is a collection of small features, some as preparation for the next big feature (alternate spawns), and some just because they're quick wins:\r\n- **Boss Scaling**: A new mod setting (i.e. in the F1 menu) that edits the health and damage of bosses based on what order you encounter them in each slot. For now it only affects pre-Eigong bosses that have a Battle Memories version, and uses their Battle Memories stats as a guide for how much to scale them. I expect this to be important for alt spawns, and for the scaling math to get tweaked after player feedback.\r\n- **Random Jade Costs**: New `randomize_jade_costs`, `jade_cost_min`, and `jade_cost_max` .yaml options to randomize the computing power cost of all 28 jades.\r\n- **Missing Poison**: Somehow no one noticed that I forgot to create an AP item for the \"Molted Tianma Hide\" poison. Now I've done that.\r\n- **Shennong Re-implementation**: Previously, the randomizer would completely skip Shennong's \"sick\" state, which made it impossible to get the first health upgrade. Now Shennong will become sick after you have a poison to give him, so that you can get all health upgrades from him without blocking any other FSP events on poisons.\r\n- **Loading Screen Tips**: The vanilla game's tips have been replaced with randomizer tips. For now there are only four tips, but the infrastructure is in place to let us easily add more.\r\n- Internal implementation of Wall Climb, Grapple and Ledge Grab items. For now, these items will always be in your start inventory, so they won't affect the player experience yet unless you fiddle with the mod's debug tools. Actually shuffling these items will require alt spawns (since the default spawn forces you to use two of them almost immediately), as well as updating all of the logic to use them.\r\n- Moved death link code off the websocket thread. Experience from both of my randomizer mods implies that avoiding the websocket thread helps reduces crashes, and this was the last part of the Nine Sols mod which still used the thread more than it had to.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.2.0/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "51eee8c6552e86448a823c4668001501aac619376eaf8a574a53ed593248956b",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.2.0",
      "minimum_ap_version": "0.5.0",
      "size": 2897173,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.2.0",
      "title": "0.2.0",
      "version_simple": "0.2.0",
      "world_version": "0.2.0"
    },
    "0.2.1": {
      "created_at": "2025-10-12T02:04:43Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Fixed negative Boss Scaling values. Using Battle Memories stats as a guide produced reasonable results for bosses encountered _later_ than the vanilla game, but early encounters would sometimes end up scaled all the way into negative values. So I've changed the scaling logic to give \"early\" bosses stats between zero and vanilla, while \"late\" bosses continue to get stats between vanilla and Battle Memories.\r\n- The \"Archipelago Randomizer\" text on loading screen tips was getting inconsistently word wrapped, so I've tried explicitly disabling word wrapping there.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.2.1/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "adc67a4e325830bde42de92e09e933e70607dcb8dbfe405d7d09e220795ee17d",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.2.1",
      "minimum_ap_version": "0.5.0",
      "size": 2897175,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.2.1",
      "title": "0.2.1",
      "version_simple": "0.2.1",
      "world_version": "0.2.1"
    },
    "0.3.0": {
      "created_at": "2025-10-30T22:40:11Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- `first_root_node` option, a.k.a. \"alternate spawns\". For now there are 10 choices, including the familiar default of AFM. Most of the other root nodes were left out because they would be \"overly restrictive starts\" (i.e. few if any locations would be checkable with no items, especially when Grapple, Ledge Grab and Wall Climb are all shuffled).\r\n\t- The upper half of AFM is unreachable from below, so the AFM root node will now be automatically unlocked whenever you first enter AFM. This solution should work even in a future version with entrance randomization.\r\n\t- The two smaller elevators in AFE become impassable barriers when AFE is entered from below, so those will be automatically unlocked whenever you first enter AFE if you enter from below instead of above. Again, this should work with future entrance randomization.\r\n\t- In the vanilla game, the large spike ball you release in GoS (East) lands in GoS (Entry), breaking open some paths and blocking others. This has now been prevented, since it's not compatible with randomizer logic and risked making a lot of Grotto spawns unbeatable.\r\n- `shuffle_grapple`, `shuffle_wall_climb` and `shuffle_ledge_grab` options. This includes a complete do-over of the logic to account for the new Grapple, Wall Climb and Ledge Grab items produced by these options.\r\n\t- This also made the requirements to enter Prison significantly more complicated, so I've changed the Jiequan 1 fight trigger again. Now Jiequan will always be standing menacingly in FGH, but walking up to him and pressing the button will tell you exactly what Prison requirements you're missing. After you have them all, he'll let you trigger the fight as usual.\r\n- The maximum value for `seals_for_ethereal` has been lowered from 8 to 7, because we discovered `seals_for_ethereal: 8` and `shuffle_sol_seals: false` (which implies putting 1 of the 8 seals behind ethereal) is an impossible combination of options to generate with. No one could think of a reason you'd actually want `seals_for_ethereal: 8`, so disallowing it was the simplest solution.\r\n- Corrected the loading tip about reaching Eigong to say Tiandao Research *Institute*, not Center.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.3.0/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "1293d5881b471f2667c59450fceeeec86d6affb2eac3568d6f715857c52eec31",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.3.0",
      "minimum_ap_version": "0.5.0",
      "size": 2911365,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.3.0",
      "title": "0.3.0",
      "version_simple": "0.3.0",
      "world_version": "0.3.0"
    },
    "0.3.1": {
      "created_at": "2025-11-01T10:02:02Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Fixed the Cortex Center connections forgetting there's a giant one-way door you need the Nymph to unlock.\r\n- Fixed the connection logic from W&OS - Center to Root Node expecting you to use Charged Strike as a pseudo-dash. Somehow this part of my trick logic notes snuck into the vanilla logic.\r\n- Fixed the FSP tree climb logic not realizing there's a ledge you need either Ledge Grab or Cloud Leap for.\r\n- Similarly, fixed the CTH side room logic not realizing there's a ledge you need either Ledge Grab or Cloud Leap for.\r\n  - It was also pointed out this room has an easy Cloud Leap-only solution, so added that to logic too.\r\n",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.3.1/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "afac3f11d5b9bceeff146190f9d6ae51d5c994d85272d924712bacae7b55c16d",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.3.1",
      "minimum_ap_version": "0.5.0",
      "size": 2911632,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.3.1",
      "title": "0.3.1",
      "version_simple": "0.3.1",
      "world_version": "0.3.1"
    },
    "0.3.2": {
      "created_at": "2025-11-07T13:08:06Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Logic fixes:\r\n\t- The connection logic from Cortex Center to Factory (Great Hall) is now aware there's a jump at the start of F(GH) which needs either Ledge Grab or Cloud Leap.\r\n\t- Adding a missing logical connection from Grotto (West)'s root node to its upper right exit. This means Grotto (East) locations which are easily reached from a Grotto (West) spawn will now be in logic for those spawns.\r\n\t- Added Ledge Grab as a requirement for the ED Living Area bottom right corner jump.\r\n\t- Added Ledge Grab or Cloud Leap requirement to Lady E soulscape platforming (if you don't skip it).\r\n- New `jade_cost_plando` option\r\n- Randomized jade costs are now written to the spoiler log\r\n- Fixed boss scaling trying to scale Goumang and Jiequan after they were defeated\r\n- Added downpatching to the installation instructions. Sadly it's now required to use mods, and it's unclear how long we'll have to keep doing it.\r\n- Most importantly, the loading tip that mentions Tianhuo Research Institute now correctly says \"Tianhuo\" instead of \"Tiandao\".",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.3.2/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "7b7b8aac78043d71ac9c5ab2f5b99d22daf07ccf6cda4b33f089b2110d24cd87",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.3.2",
      "minimum_ap_version": "0.5.0",
      "size": 2912478,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.3.2",
      "title": "0.3.2",
      "version_simple": "0.3.2",
      "world_version": "0.3.2"
    },
    "0.3.3": {
      "created_at": "2025-11-13T11:32:23Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n\r\n- Seven new values for the `first_root_node` option. Compared to the 0.3.0 nodes, these either force a boss fight immediately, or have significantly more restrictive/same-y starts.\r\n\t- `agrarian_hall`\r\n\t- `radiant_pagoda`\r\n\t- `apeman_facility_depths`\r\n\t- `central_transport_hub`\r\n\t- `factory_underground`\r\n\t- `inner_warehouse`\r\n\t- `power_reservoir_west`\r\n- Logic fixes:\r\n\t- \"GoS (East): Guarded By Phantom Ninja\" logic has been fixed to require Cloud Leap even if you start from an upper Grotto spawn.\r\n\t- Two jumps in upper AFE (just after the upper node, and onto the pagoda roof with hidden chests) were in logic with just Air Dash. These have been fixed to also require Ledge Grab.\r\n\t- \"CTH: Hack 2 Statues\" logic has been fixed to actually require getting to the 2nd statue.\r\n\t- \"TRC: Behind Mutant Barrier\" logic has been rewritten, so it's no longer incorrectly sharing logic with the TRC locations one level below it.\r\n\t- \"ED (Living Area): Above Right Elevator\" logic now requires climbing up the building to the Right Elevator first.\r\n- New clientside mod settings:\r\n\t- Added a \"Flowerless Death Link\" mod setting (on by default), so you can prevent death link deaths from taking away your jin or experience.\r\n\t- Added a \"Archipelago Server Messages: Filter By Player\" mod setting (off by default), so you can hide all the messages not relevant to your slot.\r\n\t- Added a \"Force True Eigong\" mod setting (off by default), so you can fight her 3rd phase without doing all the usual sidequests.\r\n- Miscellaneous:\r\n\t- Adding more loading screen tips, rewrote the README's \"What This Mod Changes\" section, moved much of that section into yet more loading tips, and added a complete list of loading tips to that README section (for those whose load times are too fast to read them in-game).\r\n\t- Death links received mid-dialogue will now be ignored to avoid softlocking.\r\n\t- Fixed randomized jade costs \"bleeding\" into Battle Memories mode.\r\n\t- Possibly fixed the \"double Delete button\" issue on the save menu. I can't reproduce this bug myself, so instead I'm delaying the part where we change the \"Delete\" text to \"Change Connection Info\", which I'm hoping will prevent whatever failure people are experiencing.\r\n\t- Cloud Leap now has the skip_balancing flag. This prevents Archipelago's progression balancing step from moving Cloud Leap earlier in the multiworld, which we're hoping will reduce the frequency of seeds that effectively end with an early Cloud Leap.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.3.3/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "a43c55bed16025c4a282f6ebff378d95738fde95bb629f10008b9eeca2a58ca0",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.3.3",
      "minimum_ap_version": "0.5.0",
      "size": 2913545,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.3.3",
      "title": "0.3.3",
      "version_simple": "0.3.3",
      "world_version": "0.3.3"
    },
    "0.3.4": {
      "created_at": "2025-11-23T16:47:42Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Added an experimental hack for **current patch compatibility**. For technical reasons, this hack should get (almost) all of your Nine Sols mods working on current patch, as long as the Archipelago Randomizer is one of those mods. If this seems stable for us, then I'll try to update NineSolsAPI later.\r\n\t- The mods I expect to still have issues on current patch even with these hacks are: PromisedEigong, BossChallengeMod, DebugModPlus, Multiplayer and CutsceneSkip. I'll patch CutsceneSkip soon, but in the meantime expect CutsceneSkip to fail to display \"Press ... to skip\" messages on current patch.\r\n- Fixed randomized jade costs being reset to vanilla after quitting to menu and reloading the same save slot. This bug was introduced in 0.3.3 when I tried to prevent jade costs \"bleeding\" into Battle Memories mode. I've now completely reimplemented how the mod applies jade costs in a way that should properly fix both bugs.\r\n- Loading screen tips are now properly random. Turns out the vanilla game will only select one of the first three tips, so the others can only be seen by scrolling to them (on a slow enough machine that you have time to scroll).\r\n\t- Added a loading tip that you can fight Jiequan before or after Prison.\r\n- Jiequan will no longer be standing menacingly in Factory (Great Hall) after sending you to Prison.\r\n- Walking into Apeman Facility (Monitoring) from (Elevator) will now always display a message about the AF(M) node being auto-unlocked, instead of just the first time.\r\n- Logic fixes:\r\n\t- \"OW: Enemy Gauntlet Room\" now logically requires Charged Strike because the final enemy is a shielded beetle\r\n\t- Climbing the right side of Factory (PA) no longer logically requires Air Dash, since I realized you can circle around Wuqiang's arena to skip the jump I thought needed it\r\n- Updated the Archipelago.MultiClient.Net library from v6.6.1 to v6.7.0. This should have no impact on players.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.3.4/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "c4e4cbae7bc931925479ec3504341129794f4631c64ea58f6622632d1ec18ba4",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.3.4",
      "minimum_ap_version": "0.5.0",
      "size": 2914291,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.3.4",
      "title": "0.3.4",
      "version_simple": "0.3.4",
      "world_version": "0.3.4"
    },
    "0.3.5": {
      "created_at": "2025-11-24T14:15:25Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\nThis should fix jade cost application, hopefully for the last time.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.3.5/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "2f23eca451e1f56583fe69f9da4e55e64c2829104ecfddb301c4ff5eff1513a4",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.3.5",
      "minimum_ap_version": "0.5.0",
      "size": 2914291,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.3.5",
      "title": "0.3.5",
      "version_simple": "0.3.5",
      "world_version": "0.3.5"
    },
    "0.3.6": {
      "created_at": "2025-11-29T17:12:52Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Probably fixed the \"Archipelago Connection Info\" popup showing unreadable black text with no background instead of the intended white text on a solid gray background.\r\n- Logic fixes:\r\n\t- \"Factory (U): Below Walkway to Left Exit\" now logically requires Cloud Leap or Ledge Grab to get over the first \"box\" after the laser\r\n\t- Spawning at Radiant Pagoda and simply walking outside to talk to the Shanhai 9000 is now in logic\r\n- Bumped the documented minimum AP version from 0.5.0 to 0.6.4, because we realized that the actual minimum version has been a lot higher than 0.5.0 ever since I started using `origin_region_name`.\r\n- Removed the \"current patch compatibility hacks\" added in 0.3.4, now that those fixes have been properly implemented and released in NineSolsAPI v1.3.0.\r\n",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.3.6/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "aed2adbed8ae4f6bac81bfbfddd5846133707a566a735d7b4b0b3c162f948cd4",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.3.6",
      "minimum_ap_version": "0.6.4",
      "size": 2914203,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.3.6",
      "title": "0.3.6",
      "version_simple": "0.3.6",
      "world_version": "0.3.6"
    },
    "0.4.0": {
      "created_at": "2025-12-12T23:30:37Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- **Trick logic**: New `logic_difficulty` option with values `vanilla`, `medium` and `ledge_storage`. The `medium` level includes talisman dashes, bow hover, unintended barrier breaks and more. See the option description in the .yaml for lists and descriptions of the tricks in each logic difficulty, and a video tutorial for the ledge storage tricks.\r\n\t- The Swift Runner skill will be automatically unlocked on slots with medium or higher logic\r\n\t- Kuafu shop items that cost Dark Steel will sometimes be \"blocked\" on slots with medium or higher logic to ensure you can't \"miss\" Cloud Piercer S\r\n\t- Universal Tracker support now includes \"glitched logic\", a.k.a. yellow squares. When you play on `vanilla`/default logic, UT will show yellow squares for `medium` logic, and when you play on `medium` logic, UT will show yellow squares for `ledge_storage` logic.\r\n- Logic fixes:\r\n\t- In lower AF (Elevator), going left to right (e.g. from AFD spawn) now correctly requires Ledge Grab to get onto the moving box.\r\n\t- In lower AF (Depths), the logic thought you needed Air Dash AND Tai-Chi Kick to cross the final red floor before the nymph hack point without Cloud Leap. This \"AND\" has been changed to \"OR\".\r\n\t- In Outer Warehouse, returning from the hack in the bottom left corner required Tai-Chi Kick to get over red floors with TCK targets. This has been changed to Tai-Chi Kick OR Ledge Grab.\r\n\t- Back in 0.3.4, I wrote \"\"OW: Enemy Gauntlet Room\" now logically requires Charged Strike because the final enemy is a shielded beetle\". This fix was applied incorrectly, causing the logic to believe that Charged Strike all by itself was enough for OW: Enemy Gauntlet Room. This fix has now been fixed.\r\n\t- Upper Sky Tower logic was never updated after the addition of Ledge Grab. Now the final part of the climb requires (Air Dash or Ledge Grab) in addition to Cloud Leap and Wall Climb.\r\n- Other fixes:\r\n\t- Yinglong Canal spawn no longer causes a duplicate Grapple item to be generated.\r\n\t- Multiple slots with jade cost rando now each generate their own jade costs instead of accidentally sharing costs.",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.4.0/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "65378d9ff62b407c89ebd6783227eae681361a47f38ebbba00e50dc7789d3875",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.4.0",
      "minimum_ap_version": "0.6.4",
      "size": 2919850,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.4.0",
      "title": "0.4.0",
      "version_simple": "0.4.0",
      "world_version": "0.4.0"
    },
    "0.4.1": {
      "created_at": "2025-12-15T13:19:19Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Added an **in-game AP console** to the pause menu, with a scrollable message backlog and AP command execution.\r\n- Fixed the logical connection from lower AFE to AFD. In 0.4.0 one of the critical connections for reaching AFD from AFE was accidentally broken, causing AFD (and other areas) to often be incorrectly out of logic.\r\n- Fixed using Universal Tracker on a pre-0.4.0 slot.\r\n",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.4.1/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "2ef0ac2aa44106300e90440597c6b165c5facfb3a85d674890ea1390cc0d790e",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.4.1",
      "minimum_ap_version": "0.6.4",
      "size": 2920015,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.4.1",
      "title": "0.4.1",
      "version_simple": "0.4.1",
      "world_version": "0.4.1"
    },
    "0.4.2": {
      "created_at": "2025-12-23T02:44:54Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- New options for how Kuafu's and Chiyou's FSP shops get unlocked. See the new option descriptions in the example .yaml file for details.\r\n\t- `shop_unlocks: sol_seals` unlocks the 3 shops (Kuafu, Chiyou, and Kuafu's extra inventory) at certain numbers of sol seals, as specified by more new options.\r\n\t- `shop_unlocks: unlock_items` unlocks the shops when you find each of 3 \"Progressive Shop Unlock\" items.\r\n- New `prevent_annoying_runbacks` option (default on) logically requires the Nymph for the Ji boss fight and Central Hall's double axe robot room (since they have shortcuts unlocked by nymph hacks).\r\n- Logic fixes:\r\n\t- \"Greenhouse: Defeat Celestial Spectre: Shuigui\" now logically requires Charged Strike to ring the bell (this only became a bug after trick logic made it logically possible to enter Greenhouse with arrows instead of Charged Strike)\r\n\t- On medium logic, going from Factory (Underground) root node to its rightside exits is now in logic with Air Dash and T-dash\r\n\t- The \"Factory (GH): ... in Platform Puzzle Room\" locations now logically require Ledge Grab or Cloud Leap to climb the platforms\r\n\t- In Power Reservoir (West), the big room above the root node is now logically climbable with Wall Climb, Grapple and Tai-Chi Kick. This room's logic also incorrectly had CS-dashes in the vanilla logic.\r\n\t- Medium logic for Tiandao Research Center's upper left corner was missing the T-dash option.\r\n\t- Reaching \"LYR: Above Root Node\" with bow hover is now in medium logic.\r\n- Mod UI fixes:\r\n\t- Fixed the connection info popup, debug tools popup and in-game console sporadically losing their gray backgrounds and turning transparent.\r\n\t- The in-game console's scroll position will now be forced to the bottom every time you pause, instead of just the first time.\r\n",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.4.2/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "588bdcc442bc2e7a7ebd58b02e8a3410897bd20536d7a7602bc0d2df239db1f3",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.4.2",
      "minimum_ap_version": "0.6.4",
      "size": 2923043,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.4.2",
      "title": "0.4.2",
      "version_simple": "0.4.2",
      "world_version": "0.4.2"
    },
    "0.4.3": {
      "created_at": "2025-12-30T05:44:33Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Added prevent_weakened_prison_state option (default off), which does exactly what it sounds like.\r\n\t- This includes changing the logic for entering Prison, so the F(GH) Jiequan fight will give you slightly different messages now.\r\n- shop_unlock bugs:\r\n\t- Fixed the \"Purchase\" button not doing anything in non-FSP Chiyou shops\r\n\t- Fixed Radiant Pagoda doors and vital sanctum being tied to whether Kuafu was in FSP, rather than whether you'd checked the vital sanctum location (in the vanilla game these are the same flag)\r\n- Logic fixes:\r\n\t- Medium logic now allows reaching \"Factory (U): Above Root Node\" from the root node with LG, CL and a T-dash\r\n\t- Ledge Storage logic now allows reaching \"GoS (Entry): Lower Left Caves\" with LG and CL\r\n\t- Medium logic now allows using Charged Strike and T-dash to cross the yellow water next to GoS (Entry)'s lower right exit\r\n- Added item name groups \"Arrows\" and \"Azure Bow\" that both contain the 3 arrow items.\r\n",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.4.3/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "9f88b516e12192dbd354368b8a3e2c3814b71cab291fa39caf7f8d0c40e529b0",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.4.3",
      "minimum_ap_version": "0.6.4",
      "size": 2923964,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.4.3",
      "title": "0.4.3",
      "version_simple": "0.4.3",
      "world_version": "0.4.3"
    },
    "0.4.4": {
      "created_at": "2026-02-15T17:07:30Z",
      "description": "For installation instructions [see the README](https://github.com/Ixrec/NineSolsArchipelagoRandomizer?tab=readme-ov-file#installation).\r\n\r\n- Jade cost randomization now works in all languages, fixing the \"endless loading screen\" problem in previous versions when jade cost rando was combined with a non-English language.\r\n- Added an in-game warning when the .apworld version that generated your slot doesn't match your mod version. There's a mild orange warning when only the patch version differs (since this is usually harmless), and a louder red warning when the major and/or minor versions differ.\r\n- Native crashes on closing the game should be fixed now. This means closing should just work without showing you the \"cat face popup\" and hanging for several seconds.\r\n- Logic changes:\r\n\t- Bugfixes (i.e. missing requirements, potentially unbeatable seeds):\r\n\t\t- Entering Cortex Center from the left exit now logically requires grapple to get anywhere.\r\n\t\t- Hacking Yinglong Canal's one way door from the left exit to the root node now logically requires one of Cloud Leap, Wall Climb or Ledge Grab.\r\n\t\t- \"CTH: Hack 2 Statues\" on ledge storage logic incorrectly had a bow hover into parry vault path for reaching the harder statue which has now been removed. This trick is feasible, but the logic was missing CL to set up LS, and once CL's added it becomes redundant with the medium logic.\r\n\t- Additions (i.e. missing \"paths\") for `logic_difficulty: vanilla`:\r\n\t\t- \"AF (Depths): Under Lower Left Exit\" can now be logically reached by nymph hacking the shortcut door from below, then falling down from above. This matters when you get nymph and AFD leftside access before grapple or cloud leap.\r\n\t- Additions (i.e. missing \"paths\") for higher difficulties (mostly `medium`):\r\n\t\t- Using Cloud Piercer S/X arrows instead of Charged Strike is now also in medium logic for the shield-holding statues in CC, LYR, FU, and FPA.\r\n\t\t- On the left side of Lake Yaochi Ruins, medium logic now includes using Swift Runner in place of Grapple.\r\n\t\t- Crossing the spike pit to the right of \"Factory (U): Find Broken Shanhai 9000\" is now in medium logic with only Cloud Leap (and Swift Runner).\r\n\t\t- In LYR, using bow hover to cross the lake from the right (i.e. the direction where you don't have the usual dragon boat) is now in medium logic, as well as parry hover in LS logic.\r\n\t\t- For the \"CTH - Under Root Node\" to \"CTH - Lower Right Vents\" connection, medium logic is now just Ledge Grab instead of Ledge Grab and Air Dash, because both paths to Under Root Node allow you to get qi for a T-dash on the way.\r\n\t\t- For the \"AFE - Upper Root Node\" to \"AFE - Enter Tutorial Arena\" connection, medium logic now includes Air Dashing onto the roof above the root node and bow hovering from there to the arena.\r\n\t- Cleanup:\r\n\t\t- The upper AF(E) connections have been refactored to explicitly represent the \"tutorial arena\", hopefully reducing confusion over what's expected there.\r\n\t\t- The connection logic for \"PRW - Root Node\" to \"PRW - Guarded Chest\" has been simplified without changing behavior; one of the \"or TCK\" conditions turned out to be redundant.\r\n- Universal Tracker support:\r\n\t- `prevent_weakened_prison_state` is now accounted for by UT.\r\n\t- Moved the map page square for \"Factory (GH): Roof Above Root Node\" onto the correct room.\r\n\t- Cleaned up some dead code (specifically the `interpret_slot_data` stub) that modern versions of UT no longer require.\r\n- Other minor bugfixes:\r\n\t- Shop unlocks on zero sol seals now work immediately, instead of waiting for you to receive an item.\r\n\t- The in-game console was failing to auto-scroll to the bottom / most recent message, but only when you had a *lot* of messages. It should now auto-scroll to the bottom no matter how many messages there are.\r\n\t- The Boss Scaling code now tracks boss encounter order even when it's turned off, so that turning the feature on and off mid-playthrough should just work now.\r\n\t- The True Ending cutscene in Galactic Dock no longer takes away your Nymph\r\n\t- Deleted \"fallback\" code for Wall Climb, Grapple and Ledge Grab that would give you those abilities without the AP item when connected to a slot generated by an apworld that predates those items. This may have been helpful at the time, but nowadays this just creates additional confusion when certain bugs and user errors happen (especially related to the FGH Jiequan/Prison sequence).",
      "download_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/download/0.4.4/nine_sols.apworld",
      "has_manifest": true,
      "hash_sha256": "5938249073f0bd33f484db6812cd820e22605e9e92620e3b4764670c381a5ac4",
      "html_url": "https://github.com/Ixrec/NineSolsArchipelagoRandomizer/releases/tag/0.4.4",
      "minimum_ap_version": "0.6.4",
      "size": 2924934,
      "source_url": "https://api.github.com/repos/Ixrec/NineSolsArchipelagoRandomizer",
      "tag": "0.4.4",
      "title": "0.4.4",
      "version_simple": "0.4.4",
      "world_version": "0.4.4"
    }
  }
}
