{
  "description": "Our Ascent is an incremental roguelite RPG with many layers of metaprogression.",
  "game": "Our Ascent",
  "github": "https://github.com/AzuriCaelum/OurAscentAPWorld",
  "license": null,
  "manifest_fields": [
    "authors",
    "world_version",
    "minimum_ap_version"
  ],
  "versions": {
    "Release": {
      "created_at": "2026-01-06T20:26:57Z",
      "description": "# 0.1.0\r\n\r\n## Compatible With \r\n- Archipelago v0.6.5\r\n- Our Ascent vB.2.1\r\n\r\n## Features\r\n- Equipment and Augments can be acquired as items in the multiworld.\r\n- Unique enemy and boss kills, and Equipment purchases can be sent as checks to the multiworld.\r\n- Option to have a specified amount of random stories from the first five stories in the Glades.\r\n- Goaling is to defeat Fairy Fillia or Fairy Zephyria in every story present in your multiworld.\r\n- All equipment slots are unlocked immediately.\r\n- The ability to lock and automatically spend skill points is granted immediately (though it looks wrong in most stories right now)\r\n- Achievements, and therefore boss points and skill points, are disabled and unavailable. Augments simply are increased when they are received.\r\n- Augments will not take effect until their vanilla prerequisites are met (for chapter 1, this is exclusively having one copy of the prerequisite augment(s))\r\n- Checks will be saved when acquired while disconnected and sent when reconnecting.\r\n\r\n## Known Bugs:\r\n- Many equipment visual/clarity issues; namely that if you are sent items before you buy them, you will no longer be able to see how much they cost.\r\n- Enemies that drop items will drop them whenever defeated until you are sent the item (or with accessories, all copies of the item). \r\n- Similarly, enemies that drop an item you already have will not show the popup in the game (but will still send the check).\r\n- The enemy compendium will show loot still available to acquire incorrectly.\r\n- An extra copy of the starting character will be randomized in the multiworld.",
      "download_url": "https://github.com/AzuriCaelum/OurAscentAPWorld/releases/download/Release/ourascent.apworld",
      "has_manifest": true,
      "hash_sha256": "7b52c6d6fd3c48dfbc706677a03857d419cc4d4c39df88e3f85c8762f5292728",
      "html_url": "https://github.com/AzuriCaelum/OurAscentAPWorld/releases/tag/Release",
      "minimum_ap_version": "0.6.4",
      "size": 26224,
      "source_url": "https://api.github.com/repos/AzuriCaelum/OurAscentAPWorld",
      "tag": "Release",
      "title": "Our Ascent Randomizer - 0.1.0",
      "version_simple": "0.0.1",
      "world_version": "0.0.1"
    }
  }
}
