{
  "description": "Pinball FX3 delivers fast, physics-driven pinball action with meticulously crafted tables inspired by iconic\nfranchises and original designs. With competitive modes, online tournaments, and razor-sharp controls, it turns\nclassic pinball into a modern skill-based challenge.",
  "flags": [],
  "game": "Pinball FX3",
  "github": "https://github.com/SerpentAI/Archipelago",
  "license": null,
  "manifest_fields": [
    "authors",
    "flags",
    "minimum_ap_version",
    "world_version"
  ],
  "versions": {
    "pinballfx3-v1.0.0": {
      "created_at": "2026-01-26T03:27:44Z",
      "description": "_A pinball game / simulation from Zen Studios_\r\n\r\n**Randomizer Features**\r\n* Entire collection of 100 tables (2 Free + 98 DLC) is supported\r\n* Ability to select individual tables to include / exclude from generation\r\n* Ability to customize how many tables to play (10-100)\r\n* Target scores are accurately scaled per table\r\n* Ability to set / randomize difficulty of target scores and stars. By table or globally\r\n* Ability to convert filler items into useful items during generation to help tackling the difficulty\r\n* Scales well for all types of multiworlds: Short / Long Syncs, Asyncs; ~110-4800 checks\r\n* Custom client UI that displays important information and updates in real-time (see screenshot)\r\n* No modding! Only light memory reading that works directly from the client\r\n* Universal Tracker (UT) fully supported (and recommended for guidance). YAML-free!\r\n\r\n**How it works and what to expect**\r\n- A custom campaign of N pinball tables is generated based on your settings\r\n- You are granted a starting table where you are able to complete all target scores and challenge stars \r\n- You progress through the campaign by receiving table unlocks and challenge access items\r\n- You will also gather some shiny quarters along the way. These are needed for both goal types. Either:\r\n  - Collect N shiny quarters to unlock a final table and beat the high tier target score to win\r\n  - Collect N shiny quarters to win\r\n- Target scores have to be achieved in single-player mode\r\n- Since the game hasn't been modified, you won't be prevented from playing anything. That said, locations checks will only be registered when meeting the proper requirements\r\n- Your playthrough will have you jumping between tables more than grinding a single table. Variety!\r\n- You are free to use wizard powers and passive upgrades in any mode\r\n\r\n**Locations**\r\n- Single-Player Score Targets: Low / Mid / High\r\n- Challenge Star Targets: Low / Mid / High (For each of the 3 challenge types)\r\n- Starsanity (Optional. Each star under each target is also a location)\r\n\r\n**Items**\r\n- Table Unlocks\r\n- 1 Ball Challenge Access: Low / Mid / High\r\n- 5 Minute Challenge Access: Low / Mid / High\r\n- Survival Challenge Access: Low / Mid / High\r\n- Shiny Quarters (Macguffins)\r\n- Table-specific useful items to progressively reduce the difficulty: Score Multipliers, Star Requirement Discounts, Target Score Discounts\r\n\r\n**Rapid-Fire Playing Instructions**\r\n- Prerequisite: Install the Pinball FX3 APWorld as you would any other custom APWorld\r\n- Prerequisite: Have a multiworld generated and a room hosted\r\n- Open Pinball FX3\r\n- Reopen the Archipelago Launcher. Find and open the Pinball FX3 Archipelago Client\r\n- Connect to the multiworld room\r\n- Send the `/pinball` command\r\n- You are ready to play! Make sure to check out the Pinball FX3 tab in the client\r\n\r\n**Disclaimers**\r\n- This implementation will ONLY work on the current Steam version of Pinball FX3 (as of January 25 2026). Any other version won't work. Future versions (if any) will need an APWorld update\r\n- You do NOT need all DLC to play, but at least 10 tables are needed to generate. This roughly equates to needing 2-3 DLC packs. They frequently go on sale and you should be able to meet the minimum table requirement fairly cheaply\r\n- While the implementation is meant to work with the Windows executable of the game, Linux _should_ work with both a Windows Archipelago install and the game running under the same Wine prefix. I cannot test this myself and will not provide support for it\r\n- While this implementation has been relatively well-tested, issues could still arise, especially with individual tables (I haven't played all 100 tables while testing). Generation should be flawless and I've been able to play multiple seeds to completion without issues. The custom client tab is more experimental, but issues with it (if any) should not prevent you from checking locations and goaling\r\n- While Pinball FX3 is no longer Zen Studios' main product, it is still technically an online game. As such, to err on the side of caution, this implementation does not modify any game files or write to RAM in any way. This limits what can be achieved randomizer-wise but it makes it safer for your account and EULA-friendly. You can add `-offline` to the game's launch parameters to fully disable online features too. Recommended\r\n- This game is HARD! I will say it again: This game is HARD, especially the upper half of 1 ball challenge stars. Make sure you are comfortable with your table selection before committing to a multiworld with other players. You could be expected to get 11 stars on any table. You also likely won't be able to rely on useful items for your starting table",
      "download_url": "https://github.com/SerpentAI/Archipelago/releases/download/pinballfx3-v1.0.0/pinball_fx3.apworld",
      "has_manifest": true,
      "hash_sha256": "2f0f1e8f0cdbd19ea605eb903ac4931e15f4309a2b694342b1e2839511661fa7",
      "html_url": "https://github.com/SerpentAI/Archipelago/releases/tag/pinballfx3-v1.0.0",
      "minimum_ap_version": "0.6.5",
      "size": 1986967,
      "source_url": "https://api.github.com/repos/SerpentAI/Archipelago",
      "tag": "pinballfx3-v1.0.0",
      "title": "Pinball FX3 - 1.0.0",
      "version_simple": "1.0.0",
      "world_version": "1.0.0"
    },
    "pinballfx3-v1.1.0": {
      "created_at": "2026-01-28T03:19:20Z",
      "description": "The main goal for this release was to offer players more customization options around how difficult a seed turns out, the initial release sometimes leading to extremely challenging location checks.\r\n\r\n**Feature:** Added `progressive_challenge_access` option. `true` by default\r\n```\r\n    If enabled, Challenge Access items will unlock Challenge tiers in a progressive manner, meaning you will gain\r\n    access to Low -> Mid -> High-Tier sequentially for each Challenge type. This should smooth the difficulty curve,\r\n    allowing you to collect some useful items by the time you reach High-Tier Challenges.\r\n    \r\n    For a more challenging / chaotic experience, disable this option. Expect to possibly have to obtain High-Tier\r\n    Challenge stars very early on, before Low or Mid-Tier stars and sometimes without any useful items helping you out.\r\n```\r\n**Feature:** Added `exclude_high_tier_target_scores ` option. `true` by default\r\n```\r\n    If enabled, locations for High-Tier Target Scores will not be created when generating the multiworld.\r\n    If your goal includes a final table, the Target Score will shift to the Mid-Tier Target Score instead.\r\n\r\n    Disabling this option will add more locations, but will also place additional player skill expectations on you.\r\n```\r\n**Feature:** Added `exclude_high_tier_challenge_stars` option. `exclude_all` by default\r\n```\r\n    Determines whether High-Tier Challenge Stars are excluded from the multiworld and under what conditions.\r\n\r\n    Exclude All: No High-Tier Challenge Star locations will be created.\r\n    Exclude Only 1 Ball: High-Tier Challenge Star locations for 1-Ball challenges will not be created.\r\n    Do Not Exclude: All High-Tier Challenge Star locations will be created.\r\n\r\n    Including High-Tier Challenge Stars will add more locations, but will also place additional player skill\r\n    expectations on you.\r\n```\r\n\r\n**Improvement:** Allow as low as 6 pinball tables when generating (Less DLC purchases required!)\r\n**Improvement:** Reduced the size of images in the `Pinball Tables` section of the custom client tab so more can be seen at once\r\n**Improvement:** Persist base score ratios by table in slot data; display them in spoiler log and in the custom tab of the client\r\n\r\n**Tweak:** Boosted `Score Multiplier` and `Target Score Discount` useful items to each contribute 5% additively (up from 3%) so their impact can be felt when stacking multiple copies for a given table\r\n\r\n**Fix:** Corrected an issue where the scroll view in the custom client tab would stop scrolling before the end of the content\r\n\r\n**Link to the original release, with README: [Here](https://github.com/SerpentAI/Archipelago/releases/tag/pinballfx3-v1.0.0)**\r\n\r\n<img width=\"786\" height=\"678\" alt=\"image\" src=\"https://github.com/user-attachments/assets/a1f80f47-39db-424b-938e-b95b9be5c98f\" />",
      "download_url": "https://github.com/SerpentAI/Archipelago/releases/download/pinballfx3-v1.1.0/pinball_fx3.apworld",
      "has_manifest": true,
      "hash_sha256": "5d918c0bf58ecdc231087996b9bfd70c4f7c8f06b4feb75c41445c425c7a9a66",
      "html_url": "https://github.com/SerpentAI/Archipelago/releases/tag/pinballfx3-v1.1.0",
      "minimum_ap_version": "0.6.5",
      "size": 1989293,
      "source_url": "https://api.github.com/repos/SerpentAI/Archipelago",
      "tag": "pinballfx3-v1.1.0",
      "title": "Pinball FX3 - 1.1.0: The \"F is for Fun, not Frustration\" Update",
      "version_simple": "1.1.0",
      "world_version": "1.1.0"
    },
    "pinballfx3-v1.1.1": {
      "created_at": "2026-02-10T11:31:11Z",
      "download_url": "https://github.com/SerpentAI/Archipelago/releases/download/pinballfx3-v1.1.1/pinball_fx3.apworld",
      "has_manifest": true,
      "hash_sha256": "1d5a574828b975d05bf2afdbce40a49d43e8cd8562b90cd605c2423ea2a594e5",
      "minimum_ap_version": "0.6.5",
      "size": 1989155,
      "source_url": "https://api.github.com/repos/SerpentAI/Archipelago",
      "tag": "pinballfx3-v1.1.1",
      "title": "Pinball FX3 - 1.1.1",
      "version_simple": "1.1.1",
      "world_version": "1.1.1"
    },
    "pinballfx3-v1.1.1r2": {
      "created_at": "2026-02-10T11:31:11Z",
      "description": "This is a minor bugfix / improvement release.\r\n\r\n**Improvement:** Removed the need to use the `/pinball` command. The client will now automatically detect the Pinball FX3 process as needed\r\n**Improvement:** Any further client or game controller crashes will now spam their tracebacks in the Archipelago tab of the client to make it simpler to report issues\r\n\r\n**Fix:** Addressed a silent client crash where it would try to act on an invalid challenge type value in memory\r\n**Fix:** Corrected the options YAML still stating 10 pinball tables being required, when the minimum has been changed to 6\r\n\r\n**Link to the previous release:** [Here](https://github.com/SerpentAI/Archipelago/releases/tag/pinballfx3-v1.1.0)\r\n**Link to the original release, with README:** [Here](https://github.com/SerpentAI/Archipelago/releases/tag/pinballfx3-v1.0.0)",
      "download_url": "https://github.com/SerpentAI/Archipelago/releases/download/pinballfx3-v1.1.1/pinball_fx3.apworld",
      "has_manifest": true,
      "hash_sha256": "e6d511938441e37f4aad8c0e557ee4aadece6d5306739ad51ecfbef647e8ca69",
      "html_url": "https://github.com/SerpentAI/Archipelago/releases/tag/pinballfx3-v1.1.1",
      "minimum_ap_version": "0.6.5",
      "size": 1989240,
      "source_url": "https://api.github.com/repos/SerpentAI/Archipelago",
      "tag": "pinballfx3-v1.1.1r2",
      "title": "Pinball FX3 - 1.1.1",
      "version_simple": "1.1.1",
      "world_version": "1.1.1.post2"
    }
  }
}
