{
  "description": "Insert description of the world/game here.",
  "flags": [
    "after_dark"
  ],
  "game": "Rimworld",
  "github": "https://github.com/PhantomOfAres/ArchipelagoRimworld",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "v0.1.0-alpha": {
      "created_at": "2025-03-30T18:18:50Z",
      "description": "[Randomizer Info](https://github.com/PhantomOfAres/ArchipelagoRimworld/blob/main/worlds/rimworld/docs/en_RimWorld.md)\r\n[Setup Instructions](https://github.com/PhantomOfAres/ArchipelagoRimworld/blob/main/worlds/rimworld/docs/setup_en.md)\r\n\r\n## Changes\r\n- First true playable!\r\n- Support for research and craftable item locations\r\n- Support for research items\r\n- A temporary filler item for item/location count mismatches\r\n- Configurability for numbers of locations and expansion enabling/disabling",
      "download_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/download/v0.1.0-alpha/rimworld.apworld",
      "has_manifest": false,
      "hash_sha256": "35bde95d3718c7ba721bde92a5fb4f9888ce2990b535a4eae0282b29b6066e88",
      "html_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/tag/v0.1.0-alpha",
      "size": 46339,
      "source_url": "https://api.github.com/repos/PhantomOfAres/ArchipelagoRimworld",
      "tag": "v0.1.0-alpha",
      "title": "v0.1.0-alpha",
      "version_simple": "0.1.0",
      "world_version": "0.1.0a0"
    },
    "v0.1.1-alpha": {
      "created_at": "2025-04-01T19:35:48Z",
      "description": "## Changes\r\nFixed an issue with the tribal/crashlanded StartingResearchLevels throwing an error on generation.",
      "download_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/download/v0.1.1-alpha/rimworld.apworld",
      "has_manifest": false,
      "hash_sha256": "3ba447cb176816f18ce0554f558300dc37c6fede0bdf17f826f6ccdc5c74918c",
      "html_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/tag/v0.1.1-alpha",
      "size": 46335,
      "source_url": "https://api.github.com/repos/PhantomOfAres/ArchipelagoRimworld",
      "tag": "v0.1.1-alpha",
      "title": "v0.1.1-alpha",
      "version_simple": "0.1.1",
      "world_version": "0.1.1a0"
    },
    "v0.2.0-alpha": {
      "created_at": "2025-04-15T05:50:07Z",
      "description": "### New Features\r\nBetter filler items\r\n- Raids - Vanilla enemy raids. For now, it's just the one type of raid, but I'll look to expand this in the future. These fire on an in-game timer, which should guarantee you don't get more than a raid every day-ish, but they will send as soon as you get the item.\r\n- Ship chunk drops - For now, the only \"good\" type of filler item. All filler that isn't a raid is a ship chunk drop.\r\n- RaidTrapCount - New yaml option that allows the player to guarantee a certain number of enemy raids.\r\n- PercentFillerAsTraps - New yaml option - specifies what percentage of \"random filler\" is traps. If you have more locations than items, the rest of the item pool will be filled randomly, and this percentage of those items will be raids. RaidTrapCount is guaranteed first, so if you need 110 items and RaidTrapCount is 10 and PercentFillerAsTraps is 20, you'll have ~ 30 traps in your pool.\r\n\r\nBetter progression logic\r\n- Fixed the requirements for item crafts that have electric and non-electric benches - they will no longer require electricity to be considered in-logic\r\n- Items that require components or advanced components will require Fabrication and Advanced Fabrication.\r\n- Added \"AnyElectricity\" requirement, which simply requires you to have access to any generator, not just \"Electricity.\" So a seed might generate Solar Panels early and allow you to craft at electricity-requiring benches\r\n- Note: This means power conduit will be in logic less. I'd like to test it out and see how it feels. I may introduce a yaml option to force conduit to always be available.\r\n\r\nAdded sorting functionality for crafting checks\r\n\r\n### Bug Fixes\r\n- If Biotech and Royalty are off, all crafting recipes should render (Cape was causing issues.)\r\n- Uncraftable modded items should no longer be exported in the data XML (Removed all recipes without a valid crafting spot.)\r\n- Start_inventory should no longer throw errors\r\n- Better connection failure handling - Errors are surfaced to the user, and the freeze on reconnect should be gone.\r\n- Load button should reappear when returning to the main menu in the same session\r\n- Excluded uncraftable items from the data export (items that require specific ideos or start conditions.)\r\n\r\n### Known Issues\r\n- Craft Location sort doesn't update until you restart the game - Craft locations need to be reworked so I can improve their UI generally. This will be fixed in a later update.\r\n- Disconnect can cause duplicated research - Workaround: Save the game, restart the client, reconnect.",
      "download_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/download/v0.2.0-alpha/rimworld.apworld",
      "has_manifest": false,
      "hash_sha256": "f784de3cf1250b37a760276477e8e1a039b67907434dfb28edc18eb007b34405",
      "html_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/tag/v0.2.0-alpha",
      "size": 48455,
      "source_url": "https://api.github.com/repos/PhantomOfAres/ArchipelagoRimworld",
      "tag": "v0.2.0-alpha",
      "title": "v0.2.0-alpha",
      "version_simple": "0.2.0",
      "world_version": "0.2.0a0"
    },
    "v0.3.0-alpha": {
      "created_at": "2025-05-29T22:41:39Z",
      "description": "### New Features\r\n\r\nMonument Victory Condition\r\n- Added a new victory condition!\r\n- This victory condition is aimed at making randomizers more customizable, especially by length, and accommodating people who aren't interested in dealing with the challenge (or length) of the vanilla victory conditions\r\n- The first requirement will add a number of \"Archipelago Sculptures\" to the pool. At least one of these structures must be added to a room for it to count as \"A monument.\" The number of statues required is yaml-configurable (MonumentStatueCount.)\r\n- The second requirement will require the player to place a randomized number of structures in the monument room. This will add some random progression items to your world, since they will likely require technology (ie, a chair will require complex furniture, or a fabrication bench will require fabrication.) The number of buildings is also yaml-configurable (MonumentOtherBuildingRequirementCount.)\r\n- The third requirement is a general wealth requirement. Make your monument pretty! Build some stuff that will increase your raid points! Or don't! It's also yaml-configurable! (MonumentWealthRequirement)\r\n\r\nBetter messaging\r\n- Added an in-game notification for important server messages (notably, disconnects, item sends and receives.)\r\n- Added crafting recipes to the spoiler log.\r\n- Added the victory type to the scenario description when starting a new game - if you have your victory type randomized, you can check the scenario description to figure out which you're doing.\r\n\r\n### Bug fixes\r\n- Playing the game while disconnected will no longer freeze the game. Locations found while disconnected will be queued and sent the next time the player's game is loaded while connected. (Note: You must return to the main menu to reconnect.)\r\n- Fixed a bug with research items that have the same name as craftable items (like Pemmican) causing trouble receiving.\r\n- Starting a new game will complete previously-completed research\r\n- When the user has more items in their pool than locations, more (basic research) locations will be added to the pool.\r\n- Increased the minimum number of basic research locations (to 10, for now) to prevent the user from accidentally making impossible yamls.\r\n\r\n### Known Issues\r\n- Craft Location sort doesn't update until you restart the game - Craft locations need to be reworked so I can improve their UI generally. This will be fixed in a later update\r\n- I've seen issues with disconnects where the game fails to reconnect after returning to the main menu and connecting. If you see this behavior, I would appreciate a report in the After Dark Discord, but it can be worked around by restarting your client.",
      "download_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/download/v0.3.0-alpha/rimworld.apworld",
      "has_manifest": false,
      "hash_sha256": "d8bab3982643e4c8e186d087d6c74af77896ebd893fe9eba781550d42c1d43a4",
      "html_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/tag/v0.3.0-alpha",
      "size": 56386,
      "source_url": "https://api.github.com/repos/PhantomOfAres/ArchipelagoRimworld",
      "tag": "v0.3.0-alpha",
      "title": "v0.3.0-alpha",
      "version_simple": "0.3.0",
      "world_version": "0.3.0a0"
    },
    "v0.3.2-alpha": {
      "created_at": "2025-06-16T17:41:15Z",
      "description": "### Bugfixes\r\nFixed the filler locations not rendering in the UI - requires a client update.",
      "download_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/download/v0.3.2-alpha/rimworld.apworld",
      "has_manifest": false,
      "hash_sha256": "4d3864ee49331c483491c1e0804e54e55f9004cdb8c826d4bb4fe18d95ef63ad",
      "html_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/tag/v0.3.2-alpha",
      "size": 58015,
      "source_url": "https://api.github.com/repos/PhantomOfAres/ArchipelagoRimworld",
      "tag": "v0.3.2-alpha",
      "title": "v0.3.2",
      "version_simple": "0.3.2",
      "world_version": "0.3.2"
    },
    "v0.4.0-alpha": {
      "created_at": "2025-07-15T18:26:21Z",
      "description": "### Features\r\n\r\nOdyssey Compatibility V1! Odyssey items and technology can now be randomized into the pool, into crafting recipes, and into monument victory win conditions. Note: The logic here may be weird, items may be unreachable, there may be weirdness with new features and items. Use at your own risk! I plan on adding more logic here in the future, and an initial pass looking at the data and test seems to work fine, but for now, this is a data pass, and there may be dragons. The **OdysseyEnabled** yaml flag will enable/disable the DLC.\r\n\r\nColonist item checks! You can now shuffle colonists into the item pool! The **ColonistItemCount** yaml flag will allow you to tune this count (default 5)\r\n\r\nColonist items can be named after players in the pool! If enabled, colonists sent from the server will be named after players in your multiworld. _Please don't make me regret this feature._ Be cool, don't make people uncomfortable, make sure if you're sharing stories from your game with other players, they are receiving that information in fun. The **PlayerNamesAsColonistItems** yaml flag will enable this feature.\r\n\r\n### Bugfixes\r\n\r\nPasswords now function correctly. (Whoops!)",
      "download_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/download/v0.4.0-alpha/rimworld.apworld",
      "has_manifest": false,
      "hash_sha256": "18d55a263298a57f4c27b25907625922130d89b199ffe09f4dfd37330caa7af8",
      "html_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/tag/v0.4.0-alpha",
      "size": 59618,
      "source_url": "https://api.github.com/repos/PhantomOfAres/ArchipelagoRimworld",
      "tag": "v0.4.0-alpha",
      "title": "v0.4.0 Alpha Release!",
      "version_simple": "0.4.0",
      "world_version": "0.4.0"
    },
    "v0.4.2-alpha": {
      "created_at": "2025-08-11T02:45:24Z",
      "description": "### Features\r\n\r\nNew yaml option: BonusResearchItems, which allows the user to be sent bonus copies of items when research is sent to the user. -1 will send all items, anything above 0 will send X randomly-selected items (potentially including duplicates.)\r\n\r\n### Bugfixes\r\n\r\nFixing overaggressive removal of \"Building\" from Monument item selection. This fixes (Kid) Outfit Stands from breaking monuments (and maybe some others)\r\n",
      "download_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/download/v0.4.2-alpha/rimworld.apworld",
      "has_manifest": false,
      "hash_sha256": "d395161ad0d0f279156ab68e683175bab167e87f90fac154fa3bb1267833b271",
      "html_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/tag/v0.4.2-alpha",
      "size": 60116,
      "source_url": "https://api.github.com/repos/PhantomOfAres/ArchipelagoRimworld",
      "tag": "v0.4.2-alpha",
      "title": "v0.4.2 Release!",
      "version_simple": "0.4.2",
      "world_version": "0.4.2"
    },
    "v0.4.3-alpha": {
      "created_at": "2025-11-21T23:17:26Z",
      "description": "### New Functionality\r\n\r\n- Adding the new manifest for version 7+ of Archipelago (future-proofing.)\r\n\r\n### Bugfixes\r\n\r\n- Fixing an issue where the first \"extra basic research\" was not being created properly on the server, causing nullrefs on the client.\r\n- Fixing an issue where locations sent from the server (like when a game is collected upon release) would cause all prerequisites to be completed and sent. The client will now break those prerequisites instead.\r\n- Fixing some potential nullrefs that shouldn't happen, but... you know, development.",
      "download_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/download/v0.4.3-alpha/rimworld.apworld",
      "has_manifest": true,
      "hash_sha256": "3ffd166f655e9ad096cbda3ba914ff795f22849becac26e063776d1f745755ca",
      "html_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/tag/v0.4.3-alpha",
      "size": 27365,
      "source_url": "https://api.github.com/repos/PhantomOfAres/ArchipelagoRimworld",
      "tag": "v0.4.3-alpha",
      "title": "v0.4.3 Release!",
      "version_simple": "0.4.3",
      "world_version": "0.4.3a0"
    },
    "v0.5.0-alpha": {
      "created_at": "2026-01-29T04:46:28Z",
      "description": "## v0.5.0 - New Locations!\r\n\r\n### New Functionality\r\n\r\n- Raid Locations: Every raid will spawn with one enemy having a special Raid Location Item. Kill (or capture) them and use the item to send the location. These locations include some combat logic, which will help ensure you get combat-relevant technology in order to progress.\r\n- Trade Locations: Every trader (caravan, orbital, or settlement) will have a special Trade Location Item to buy (base cost 100 silver, modified by any appropriate trade cost multipliers.) Buy it, use the item, and it will send a trade location.\r\n- More useful filler items: All craftable items can now be dropped as filler! Enjoy your go-juice and assault rifles and human leather raining from the sky.\r\n- ExtraMonumentStatueCount: Allows the monument victory to include some number of extra sculptures, which will make it easier to reach go mode.\r\n- Universal Tracker support: Fixing locations that were behaving badly in UT, as well as allowing UT to track the recipes for Craft Locations (so you know what items you need to send from the tracker!)\r\n\r\n### Bugfixes\r\n\r\n- Fixed the issue where child vacsuits would be required if you enabled Odyssey but not Biotech - child vacsuits (and a couple of other potentially problematic multi-DLC items) will now never be required for craft locations.\r\n- When the secret trap item feature was enabled, you could still tell an item was a trap by reading its description. That has been fixed.\r\n- Watermills will no longer be required in the monument (which, while not impossible, was... inconvenient.)\r\n- Items that require the mechanitor to summon mech raids for the various chips should now appropriately require you to have all tiers of mechtech leading up to them\r\n- Fixed the random number generation so it appropriately uses the seeded version in the multiworld.\r\n- Fixed overaggressive string removal of extra context I added for AP items, resulting in not being able to find research that included the string \"Research\" (mostly from mods)",
      "download_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/download/v0.5.0-alpha/rimworld.apworld",
      "has_manifest": true,
      "hash_sha256": "e77cdf798035effca127201d4df3eac27333251565111b437ff745f7fbb2132d",
      "html_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/tag/v0.5.0-alpha",
      "size": 64560,
      "source_url": "https://api.github.com/repos/PhantomOfAres/ArchipelagoRimworld",
      "tag": "v0.5.0-alpha",
      "title": "v0.5.0 Release!",
      "version_simple": "0.5.0",
      "world_version": "0.5.0a0"
    },
    "v0.5.2-bugfix": {
      "created_at": "2026-02-27T00:55:51Z",
      "description": "## Bugfixes\r\n\r\nRemoved vacskin glands and blood warmers from the item defs, to prevent more awkward multi-DLC issues.",
      "download_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/download/v0.5.2-bugfix/rimworld.apworld",
      "has_manifest": true,
      "hash_sha256": "d65f9fbcee6029aa668a7fa066b5c343e17082f6c173704deaafb31320544e8f",
      "html_url": "https://github.com/PhantomOfAres/ArchipelagoRimworld/releases/tag/v0.5.2-bugfix",
      "size": 64516,
      "source_url": "https://api.github.com/repos/PhantomOfAres/ArchipelagoRimworld",
      "tag": "v0.5.2-bugfix",
      "title": "v0.5.2-bugfix release",
      "version_simple": "0.5.2",
      "world_version": "0.5.2b0"
    }
  }
}
