{
  "description": "ToeJam & Earl",
  "game": "ToeJam and Earl",
  "github": "https://github.com/IgnisUmbrae/TJE-Archipelago",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "v0.1.2": {
      "created_at": "2024-09-04T19:55:19Z",
      "description": "- Added progressive keys and redid yaml key options (see below)\r\n- If the last ship piece is set to be on level 25, the other 9 must be collected before the level 24 elevator will open, even if elevator keys are not enabled \r\n  - If elevator keys are enabled and level 24 has a key, *both* the 9 ship pieces *and* the relevant key are required\r\n- Promotion presents can no longer be rewards for receiving a promotion\r\n- Rank checks should now trigger correctly when caused by a single map square reveal after either an Un-Fall/Up-Warp or falling down a level\r\n- Made points and rank logic more lenient so tedious uncovering of map tiles is far less likely to be necessary\r\n- The client no longer performs checks or attempts to spawn items once the goal has been reached\r\n\r\nNew yaml key options are:\r\n\r\n- ``key_type`` can be either ``progressive`` or ``static``. Progressive keys unlock the next elevator each time; static keys are always for elevators on specific floors.\r\n- For progressive keys **only**: \r\n  - ``prog_key_count`` is the number of progressive keys added to the game (default 23, one for each lockable level 2–24). \r\n  - Can be more than 23 for smoother progression. Special values: ``full`` for 23 keys and ``extra`` for 30.\r\n  - Can be set to less than 23 and the AP will attempt to evenly space the locked levels but this is **not recommended** as the list of locked levels is not currently displayed anywhere. Will be changed in the next update to allow the same regular spacing as static keys (see below).\r\n- For static keys **only**:\r\n  - ``static_key_gap`` (previously ``elevator_key_gap``) is the interval between levels with locked elevators. For example, setting this to 3 will lock the elevators on levels 3, 6, 9, 12, 15, 18, 21 and 24.",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.1.2/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "8b36128453994a28fb0a89359c649beada933c9ebc19b232776f7b2b857e72d6",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.1.2",
      "size": 28219,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.1.2",
      "title": "Toejam & Earl AP World v0.1.2",
      "version_simple": "0.1.2",
      "world_version": "0.1.2"
    },
    "v0.1.3": {
      "created_at": "2024-09-06T15:48:50Z",
      "description": "# Hotfixes\r\n\r\n- **HOTFIX 1: fix key-receiving routines**\r\n- **HOTFIX 2: fix generation of some trapless seeds**\r\n- **HOTIIX 3: now you can generate *without* map revealers, whoops**\r\n\r\n# New features & major changes\r\n\r\n- New item: Progressive Map Reveal. Collecting one uncovers* the map (with the telephone glass effect) for the five levels (1–5, 6–10, and so on). Add ``map_reveals: yes`` to your YAML to enable.\r\n- Reworked how elevator key levels are decided.\r\n  - Now both static and progressive keys use a single option called ``key_gap``, which works the same as \"static_key_gap\" used to. For example, setting this to 3 locks elevators on levels 3, 6, 9, 12, 15, 18, 21 and 24.\r\n  - \"prog_key_count\" has been removed.\r\n- The game now saves your progress on transition to a new level, so it's now safe to perform a hard reset (CTRL+ALT+R) as a shortcut back to Level 1. Please note these **extremely important points**:\r\n  - Safe places to reset:\r\n    - Once the elevator starts slowing down.\r\n    - Once the level has loaded.\r\n  - Soft resets are also fine, but rebooting the core is very likely to cause the client to error and die.\r\n  - After you spawn back into Level 1 from the main menu, there is a delay of a handful of frames before the data is loaded in. This is to avoid clashes with the game's own level generation and crashing the game.\r\n  - Max HP is not currently saved/loaded because the game stores this information in a weird way. Your life bar will return to normal on death, however. This will be addressed in a future version.\r\n\r\n\\* What's *actually* uncovered is only the centre of the map, minus a one-tile border around the outside. This is because the game cannot render an entire map of glass tiles due to a limitation somewhere, either in the code or with the Mega Drive itself.\r\n\r\n# Bug fixes\r\n\r\n- Items should no longer spawn when jumping with Super Hitops\r\n- Up-Warping is no longer possible on Level 25 (so you won't see glitched Earth Funkotron, sorry!)\r\n- Un-Falling/Up-Warping should no longer remotely collect ship pieces",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.1.3/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "52001193a6779f07f284b287c6fa91ff7ff6065d422625ff30abc1b4dc74ab39",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.1.3",
      "size": 30594,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.1.3",
      "title": "Toejam & Earl AP World v0.1.3 HOTFIX3",
      "version_simple": "0.1.3",
      "world_version": "0.1.3"
    },
    "v0.1.4": {
      "created_at": "2024-09-19T14:54:50Z",
      "description": "# Major changes\r\n\r\n## New features\r\n\r\n- Game over options are now implemented\r\n  - ``game_overs: disable`` will give the player infinite lives and remove all Extra Life presents from the item pool.\r\n  - ``game_overs: drop_down`` will force the player to drop down one level, after which they respawn with 3 lives.\r\n  - ``game_overs: reset`` will send the player back to Level 1, as in the base game.\r\n- Added two instant-activation traps:\r\n  - Sleep trap, which immediately puts TJ to sleep. Add ``trap_sleep: yes`` to your YAML to enable.\r\n  - Cupid trap, which scrambles your controls but in a far more evil way than in the base game: this effect can disable some directions, map multiple buttons onto the same direction, and force you to press the A button. Add ``trap_cupid: yes`` to your YAML to enable.\r\n  \r\n## YAML and options\r\n\r\n- The \"final_ship_piece\" YAML option has been removed (it may return in a future version). The final ship piece is now always on Level 25, and the final elevator will always require the other 9 ship pieces before it'll open. \r\n- Other option changes and renamings:\r\n  - \"include_traps\" has been removed and split into two separate options: ``trap_food`` (yes/no) and ``trap_presents`` (yes/no).\r\n  - \"max_major_rank\" is now called ``max_rank_check``.\r\n\r\n## Misc gameplay\r\n\r\n- Up-Warps no longer work on Level 24. The elevator must be used instead, to ensure the ending triggers correctly\r\n- The ship piece display screen now shows how many \"big AP items\" are outstanding (\"big AP item\" means a ship piece overworld location, which may or may not be a ship piece for your world)\r\n\r\n## Save data\r\n\r\n- Progress is now saved in the following places, in addition to during level transitions:\r\n  - Just before a game over\r\n  - When the game is paused\r\n- Life bar size is now correctly saved and reloaded (but note that the HUD won't indicate the correct rank until it's refreshed, e.g. by opening the inventory)\r\n\r\n## Generation\r\n\r\n- Trap options are now honoured at every stage of generation\r\n- The first four presents on Level 1 now follow the base game's own restrictions (they cannot be Icarus Wings, Innertube, Rocket Skates, Mystery, Randomizer or Total Bummer)\r\n\r\n## Internals\r\n\r\n- Quadrupled the tick rate of the game watcher loop to alleviate issues with the game state updating too slowly\r\n- Item and ship item triggering has been completely redone in the most robust way possible, so should never again trigger erroneously\r\n- Ship item triggering and ship piece collecting logic has been rewritten in assembly and moved into the ROM for robustness\r\n\r\n# Minor changes and bug fixes\r\n\r\n- Queued items no longer endlessly try to spawn if you've already finished the game\r\n- Elevators now correctly unlock if you receive a key (or the penultimate ship piece) and the elevator is currently on screen\r\n- Moved ship piece initialization into ROM so it will no longer fail to trigger\r\n- Receiving a 25th elevator key no longer crashes the client\r\n- TJ's swimming state is now tracked correctly\r\n- Fixed some debug messages being displayed even if the debug flag is disabled\r\n- Fixed several minor issues with rank checks\r\n- Fixed several minor fill issues\r\n- Fixed occasional issue with TJ dying upon reloading save data",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.1.4/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "53e2bd021a6b044e74d4c557f5fc0c608ac4453713b32f064a4f9e54a4caeff4",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.1.4",
      "size": 32908,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.1.4",
      "title": "Toejam & Earl AP World v0.1.4",
      "version_simple": "0.1.4",
      "world_version": "0.1.4"
    },
    "v0.1.4a": {
      "created_at": "2024-09-21T02:08:45Z",
      "description": "# Major changes\r\n\r\n## New features\r\n\r\n- New difficulty/QoL options:\r\n  - ``sleep_when_idle`` (yes/no): whether TJ falls asleep when idle. School books and sleep traps will still work. Defaults to ``yes``, as in the base game.\r\n  - ``free_earthling_services`` (yes/no): whether friendly Earthling services are free. Defaults to ``no``.\r\n  - ``walk_speed`` (50–150): Faster/slower walk speed, as a percentage of the base game speed. Defaults to ``100``.\r\n  - ``present_timers`` (50–150): Longer/shorter-lasting action presents (Super Hitops etc), as a percentage of the base game time. Defaults to ``100``.\r\n  \r\n # Bug fixes\r\n \r\n - Generation now works correctly if you remove all instant-activation traps",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.1.4a/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "756bcbc69a8ee1d484d852d71d1632cae08f6a7b84b4e784a272b3a0ba0e2c65",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.1.4a",
      "size": 34532,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.1.4a",
      "title": "Toejam & Earl AP World v0.1.4a",
      "version_simple": "0.1.4",
      "world_version": "0.1.4a0"
    },
    "v0.2.0": {
      "created_at": "2024-10-02T13:25:44Z",
      "description": "# Major changes\r\n\r\n## New features\r\n\r\n- Earl is now playable! Specify which character you want to play in your YAML via the ``character`` option (either ``toejam`` or ``earl``). Two-player support is in the pipeline.\r\n- Trap presents now automatically open when received, for maximum chaos. Local trap presents will go into your inventory. Note that this relies entirely on the game's own internal logic to determine when it's possible to do so; you will still receive points even if the opening fails for some reason (e.g. opening a School Book while flying with Icarus Wings). Change this behaviour via the ``auto_trap_presents`` YAML option:\r\n  - ``none`` in your YAML will disable this feature.\r\n  - ``no_randomizer`` (the default) will auto-open all trap presents except Randomizers.\r\n  - ``all`` will auto-open all trap presents *including Randomizers*, but this is **not recommended at present** as this can occasionally softlock the game. See the Known Issues section below.\r\n- Added extra level randomization, accessible via the ``map_rando`` YAML option.\r\n  - ``base`` is the vanilla experience.\r\n  - ``base_shuffle`` randomizes the order of the level types (big lake, big desert, \"stringy islands\", etc.).\r\n  - ``base_random`` randomizes both the order and number of each level type.\r\n  - ``full_random`` randomizes all level generation parameters for every level. This occasionally produces some odd levels.\r\n  - ``mapsanity`` is the same as full_random, but in addition every level is regenerated every time you visit it. If you fall off, that level is basically gone forever, but this can also be helpful for rerolling levels to collect otherwise inaccessible items.\r\n- You can now control the maximum and minimum number of items per level via the ``min_items`` (4–28) and ``max_items`` (4–28) YAML options. The number of items will increase by 1 per level as in the base game, unless the two numbers are set equal. Forcing too many items in early levels is likely to result in them overlapping.\r\n- Added a new QoL feature that forces the game to immediately load the next level as soon as it's finished generating. Add ``fast_loads: yes`` to your YAML to enable.\r\n- Added sound effect randomization, accessible via the ``sound_rando`` YAML option.\r\n  - ``none`` will disable this \"feature\".\r\n  - ``most`` will randomize the majority of the sounds, excluding the drum samples used in the music (clap, kick, record scratch and snare).\r\n  - ``all`` will also randomize the four drum samples. This will partially randomize the music.\r\n- Added four new instant-activation traps:\r\n  - Burp traps, which exist solely to annoy you (and stop you sneaking up on Santa). Add ``trap_burp: yes`` to your YAML to enable.\r\n  - Rocket Skates traps, which immediately give you rocket skates. Add ``trap_skates: yes`` to your YAML to enable.\r\n  - Earthling traps, which spawn a random Earthling. Add ``trap_earthling: yes`` to your YAML to enable.\r\n  - Randomizer traps, which force-randomize all your presents. Add ``trap_randomizer: yes`` to your YAML to enable, if you are mad.\r\n\r\n## Gameplay changes\r\n\r\n- The five trap presents (Rain Cloud, Total Bummer, Randomizer, Earthling and School Book) have been removed from logic. You'll still receive in-game points for opening them, but accessibility will be determined under the assumption that you won't open any of them.\r\n- The number of instant-activation traps is now calculated based on the total number of locations (between 3% and 6% thereof)\r\n- Sleep traps now make you read a School Book\r\n- Cupid traps now activate via ROM code so you'll now see the hearts above your head\r\n- Up-Warp presents are now significantly less common, to balance their extreme utility (base Un-Fall presents are unaffected)\r\n\r\n# Minor changes\r\n\r\n## Bug fixes\r\n\r\n- Mailboxes now correctly refer to \"Up-Warp\" instead of \"Un-Fall\" when playing with that item enabled\r\n- Roads now correctly give the 25% speed boost when playing with non-default movement speed\r\n- Items no longer spawn when you're in an elevator and have just arrived at a new floor\r\n- Items no longer spawn while idling with an innertube\r\n- Fixed issue with too many presents being pushed as precollected\r\n\r\n## Internal changes\r\n\r\n- The alias for 100% base walking speed and present timers has been changed from \"normal\" to ``base`` for consistency\r\n- Auto-opening trap presents are now handled as part of the trap queue instead of the present queue\r\n- The client now takes all the info it needs directly out of the ROM so it can fully initialize as soon as a connection to BizHawk has been established\r\n- BizHawk now receives a message when saving/loading data\r\n- Starting present identification has been redone in assembly and moved into the ROM so it won't fail any more\r\n- Reduced the artificial delay on present/edible spawning\r\n\r\n# Known issues\r\n\r\n- Auto-opening Randomizers may occasionally softlock the game. For this reason ``auto_trap_presents`` defaults to ``no_randomizer`` and Randomizer traps must be manually enabled. The cause is under investigation, but if you run into this issue, please send me a RAM dump from BizHawk.",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.2.0/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "89dde03e729a52a730943380dae2752d838b16e5b443642bb96c8b4f3d40cb59",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.2.0",
      "size": 40407,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.2.0",
      "title": "Toejam & Earl AP World v0.2.0",
      "version_simple": "0.2.0",
      "world_version": "0.2.0"
    },
    "v0.2.1": {
      "created_at": "2024-10-05T17:27:31Z",
      "description": "# Major changes\r\n\r\n- Item appearances have been completely overhauled:\r\n  - Local presents, edibles and bucks now appear as the correct item\r\n  - Remote items will appear as the AP logo; an up arrow indicates a progression item (thanks, DrKelexo!)\r\n  - Local elevator keys and map reveals now have their own sprites (thanks, DrKelexo!)\r\n  - Local ship pieces that happen to spawn as ground items now have their own sprite (thanks, DrKelexo!)\r\n\r\n# Minor changes/bugfixes\r\n\r\n- Auto-opening trap presents now queue correctly and won't overwrite each other\r\n- Food no longer spawns on the starting islands, to match the base game\r\n- Local presents now auto-identify when picked up",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.2.1/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "3bff9c96808eb67d374ce69e64237676a03122c88bceba1f6fc916ad2a4b1ca5",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.2.1",
      "size": 43348,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.2.1",
      "title": "Toejam & Earl AP World v0.2.1",
      "version_simple": "0.2.1",
      "world_version": "0.2.1"
    },
    "v0.2.2": {
      "created_at": "2024-10-06T07:21:47Z",
      "description": "# Gameplay changes\r\n\r\n- Up-Warps now work on Level 24 if and only if you have 9 ship pieces\r\n- Moles no longer steal Promotion presents if rank checks are enabled\r\n- Updated the elevator keycard sprite to have a purple arrow for better visibility against desert (thanks, DrKelexo!)\r\n\r\n# Minor changes\r\n\r\n- Another player can no longer join mid-game if singleplayer mode is chosen in the YAML\r\n- Disabled the cheat code for safety's sake",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.2.2/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "dafd9b5ca58da5617361595700f2429e4da0c2a531cca07cec4c93bf590c6453",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.2.2",
      "size": 43718,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.2.2",
      "title": "Toejam & Earl AP World v0.2.2",
      "version_simple": "0.2.2",
      "world_version": "0.2.2"
    },
    "v0.2.2a": {
      "created_at": "2024-10-08T09:36:17Z",
      "description": "# Bugfixes\r\n\r\n- Fix a critical bug with spawning remote items",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.2.2a/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "698c9c97e77f8d89fb6007ed4eab0617e3d7137e336382bff1f57855422dbc5d",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.2.2a",
      "size": 44278,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.2.2a",
      "title": "Toejam & Earl AP World v0.2.2a",
      "version_simple": "0.2.2",
      "world_version": "0.2.2a0"
    },
    "v0.2.3": {
      "created_at": "2024-10-13T12:53:48Z",
      "description": "# New features\r\n\r\n- \"restrict_prog_items\" has been removed. Instead, you can now prevent the game from creating tiny islands out in space by using the ``islandless`` YAML option. Highly recommended to ensure item accessibility and seed completability. Defaults to ``yes``.\r\n- You can now play with an expanded inventory (64 slots, 4× the base size), accessible via the ``expanded_inventory`` YAML option. Defaults to ``yes``.\r\n\r\n# Minor changes/bugfixes\r\n\r\n- Fixed an issue where the game would freeze when caught by a Mole\r\n- Fixed an issue with presents in initial inventory not auto-identifying when playing as Earl\r\n- Rocket Skates traps no longer spawn on Level 1",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.2.3/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "7b7e2ca561889b07b2703a80feaaa5d77fdad58e3f76cf707e37e6939391f4e0",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.2.3",
      "size": 44502,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.2.3",
      "title": "Toejam & Earl AP World v0.2.3",
      "version_simple": "0.2.3",
      "world_version": "0.2.3"
    },
    "v0.2.4": {
      "created_at": "2024-10-18T11:12:10Z",
      "description": "- TJ/E will now say a couple of helpful lines of dialogue when you collect or receive an important item, telling you one of four things: which ship piece you've just collected, which elevator a key has just unlocked, which levels a map item has just revealed, or which trap has just activated.\r\n- Replaced the ship piece level generation algorithm on the AP side with a new one that follows the same procedure as the game. Note that this is a *copy of the high-level logic* rather than byte-for-byte, meaning that while the possible outputs are the same, the exact distribution will be slightly different. Either way it will match the base game far better.",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.2.4/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "a0b9d15bee20b78f3e05d41558f0373415958d3f4bf24bb7396f0778b732e7c2",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.2.4",
      "size": 44842,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.2.4",
      "title": "Toejam & Earl AP World v0.2.4",
      "version_simple": "0.2.4",
      "world_version": "0.2.4"
    },
    "v0.2.4a": {
      "created_at": "2024-10-22T09:37:26Z",
      "description": "# Bugfixes\r\n\r\n- Fixed an issue that made AP sprites invisible\r\n- Fixed crashes caused by ``/send``ing an item",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.2.4a/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "0f82675925c95ae39aefbb6978026c31ffbbbc13fd38c1aa97d7495f74f01d98",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.2.4a",
      "size": 44921,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.2.4a",
      "title": "Toejam & Earl AP World v0.2.4a",
      "version_simple": "0.2.4",
      "world_version": "0.2.4a0"
    },
    "v0.2.4b": {
      "created_at": "2024-10-25T03:41:56Z",
      "description": "# Bugfixes/minor changes\r\n- Removed the Rocket Skates blast-off sound effect from sound rando\r\n- The last ship piece will no longer magically appear earlier than level 25\r\n- Reworded some of the option explanations for clarity",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.2.4b/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "cf24ee38198dcf8c6b81311fcced432cfda660637476cff6114189e22ee4cc7b",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.2.4b",
      "size": 45022,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.2.4b",
      "title": "Toejam & Earl AP World v0.2.4b",
      "version_simple": "0.2.4",
      "world_version": "0.2.4b0"
    },
    "v0.2.4c": {
      "created_at": "2024-11-13T13:14:36Z",
      "description": "# Minor changes\r\n\r\n- Add poptracker compatibility via slot data\r\n\r\n# Bugfixes\r\n\r\n- A cupid trap no longer automatically activates at the start of the game",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.2.4c/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "c2a78f136eeb650673f0093dc470761446e46f1ec096a310c7a2a9df362f2ee9",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.2.4c",
      "size": 45169,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.2.4c",
      "title": "Toejam & Earl AP World v0.2.4c",
      "version_simple": "0.2.4",
      "world_version": "0.2.4rc0"
    },
    "v0.3.0": {
      "created_at": "2024-12-31T16:13:27Z",
      "description": "# Changes\r\n## Removed features\r\n\r\n- Static keys have been removed, as has the \"key_type\" option (see next section)\r\n- The messy local saving and loading routines have been completely removed in anticipation of proper async-friendly saving and loading, to be added soon™\r\n\r\n## YAML options\r\n\r\n- ``elevator_keys`` (yes/no) now controls whether progressive elevator keys are on or off. \"key_type\" has been removed.\r\n- Several options have been renamed for clarity:\r\n  - \"trap_food\" → ``bad_food``\r\n  - \"trap_presents\" → ``bad_presents``\r\n  - \"auto_trap_presents\" → ``auto_bad_presents``\r\n- New option: ``last_level`` (11–25), which lets you play shorter games! In such games:\r\n  - Ship pieces will be distributed in a way that mimics the vanilla game's behaviour\r\n  - Up-Warp usage restrictions will obey the chosen last level\r\n  - ⚠ Earthlings will not be modified in any way. This will be addressed in a future version.\r\n  - ⚠ Attempting to generate with high ``max_rank_check`` and low ``last_level`` may result in a fill error due to unplaceable items.\r\n  - ⚠ You may receive a \"Location Accessibility requirements not fulfilled\" warning if rank checks are enabled and ``last_level`` is low. This will not cause any issues with completability, but the items behind the higher rank checks will in all likelihood be inaccessible.\r\n- New option: ``local_map_reveals`` (yes/no), which places map reveals locally and balances placement so that they never appear too late to be useful (assuming you've collected all of them up to that point). For example, if a map reveal would uncover levels 1–4, it is guaranteed to appear on one of those levels. Recommended for solo worlds.\r\n\r\n## Items and presents\r\n\r\n- Ground items are now received directly (i.e. without creating sprites on the ground) — no more sprite glitches, hooray!\r\n- Presents are now always received directly into the inventory to avoid issues with sprite limits and despawning\r\n  - Presents received when the inventory is full will wait in a queue until you've freed up space\r\n\r\n## Elevator keys\r\n\r\n- Elevator keys are now implemented purely in ROM code\r\n- Elevators will no longer appear stuck open but in a locked state\r\n\r\n## Map reveals\r\n\r\n- Map reveals are now implemented purely in ROM code\r\n- Map reveals will now uncover the next ⅕ of levels; the exact number depends on ``last_level`` and a small amount of randomness\r\n- In shorter games with ``last_level`` < 25, map reveal dialogue will now be modified to explain exactly which maps have been revealed\r\n- Collecting too many map reveals no longer explodes the entire game\r\n\r\n## Minor changes, bug fixes\r\n\r\n- The ``sound_rando: all`` setting no longer bleeds over from one YAML into the others\r\n- Generating from multiple TJ&E YAMLs with expanded inventory enabled no longer causes an error\r\n- The artificial delay on the edible spawn queue has been reduced to 1 tick (0.125s)\r\n- Items will no longer mysteriously respawn if you fall down from then return to your highest floor reached\r\n- Vanilla dialogue when collecting ship pieces has been removed to prevent it overriding more useful information\r\n- Added an extra failsafe to prevent ship pieces from being awarded en masse when the game is soft or hard reset",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.3.0/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "19d6e2164f3e719a9ce2133aa57c67b7f8ec3f26dc57f63e12b94e6458bbddba",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.3.0",
      "size": 43946,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.3.0",
      "title": "Toejam & Earl AP World v0.3.0",
      "version_simple": "0.3.0",
      "world_version": "0.3.0"
    },
    "v0.3.1": {
      "created_at": "2024-12-31T22:30:06Z",
      "description": "# Changes\r\n\r\n- Exact inventory cursor position (i.e. row, column and scroll location) is now properly stored and restored, even after using a mailbox",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.3.1/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "ae2b0548223a0f7eb7588fd81e936710a8f40ae88b7b27d7ddcca07c69ddcf2b",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.3.1",
      "size": 44006,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.3.1",
      "title": "Toejam & Earl AP World v0.3.1",
      "version_simple": "0.3.1",
      "world_version": "0.3.1"
    },
    "v0.3.2": {
      "created_at": "2025-01-05T00:21:38Z",
      "description": "# Changes\r\n\r\n## Logic and generation\r\n\r\n- Points available from presents are now factored directly into accessibility logic. Bad presents are still assumed to be worth zero points, i.e. the player will never open them.\r\n- Logic-tracking rank events have been removed in favour of an equivalent method using collection states. This should improve fill speed somewhat as well as remove some fluff from the spoiler log.\r\n- Extra Promotion presents are no longer forcibly added during generation to help prevent fill issues\r\n- Assumptions about points from map exploration have been made slightly more lenient\r\n\r\n## Ranks\r\n\r\n- If rank checks are enabled and a Mole steals a present, you will still receive the 2 points as if you'd opened it, in order to keep game logic in lockstep with AP logic\r\n- When playing with modified ``last_level``, ``min_items`` and/or ``max_items``, rank point requirements are now rescaled to help ensure accessibility. Three rescaling modes are available:\r\n  - ``rank_rescaling: funk_lord`` (the default) rescales the rank point thresholds so that you can reach Funk Lord towards the end of the game.\r\n  - ``rank_rescaling: max_check`` rescales the rank point thresholds so that you can reach your chosen ``max_rank_check`` towards the end of the game. Higher ranks are not guaranteed to be reachable.\r\n  - ``rank_rescaling: none`` disables all rescaling, but this is extremely likely to lead to fill errors if ``max_rank_check`` is high and ``last_level`` is low.\r\n\r\n## Ending\r\n\r\n- The goal is now to reach Funkotron, rather than simply collect the tenth and final ship piece\r\n- Fixed an issue where it was possible to acquire multiples of the same ship piece and thereby trigger the ending early. In particular, this means that you can now safely ``!getitem`` a ship piece if something goes wrong.",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.3.2/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "95845058c6f2ba268c1744cc61741c5a4bb8ff6d5ebc00c454693c37e0ea8a08",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.3.2",
      "size": 45900,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.3.2",
      "title": "Toejam & Earl AP World v0.3.2",
      "version_simple": "0.3.2",
      "world_version": "0.3.2"
    },
    "v0.4.0": {
      "created_at": "2026-01-27T13:06:09Z",
      "description": "# Major additions\r\n- Patching now uses the newer AP settings API to simplify setup, including automatically prompting you to locate your ROM\r\n- Added deathlink support\r\n- Added server-side saves to support asyncs\r\n- Items are now awarded in strict order of receipt, resolving issues with elevator keys and other crucial items going missing on big releases. However, this does mean that it is quite slow, as the function in ROM that awards items runs only every 4 frames.\r\n- Presents that spawn when you have a full inventory now fall on the ground if possible (note that the in-game limit is 32; past this limit new ones will overwrite old ones)\r\n- Traps are now all controlled by a single option called `trap_weights`, where you can specify the relative frequency of each type of trap (see example.yaml for usage example). The previous separate trap options have all been removed.\r\n- New YAML option: `trap_percentage`, which specifies the % of the item pool that will be traps (max 10%)\r\n- REV00 is now supported. If you wish to use a REV00 ROM, you must add `game_version: rev00` to your YAML.\r\n\r\n# Minor additions\r\n\r\n- Added location groups for each of the 25 levels, plus one group for ranks and one for ship items\r\n\r\n# Bugfixes\r\n\r\n- Fixed a bug that prevented the auto-opening of Randomizer presents even when the appropriate option was set\r\n- Fixed a bug that caused non-local items from other TJ&E instances to also be collected locally\r\n- Fixed a bug when using ``game_over: drop_down`` that prevented the player from moving if they lost their last life in an elevator or other control-locked scenario\r\n- Reduced the frequency of fill errors with a number of other worlds\r\n",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.4.0/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "36f9e844b310b2a5847fecc84b103ade36c87733481c4d833119b6afaae38aba",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.4.0",
      "size": 61225,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.4.0",
      "title": "Toejam & Earl AP World v0.4.0",
      "version_simple": "0.4.0",
      "world_version": "0.4.0"
    },
    "v0.4.0a": {
      "created_at": "2026-01-28T01:59:55Z",
      "description": "- Fixed a generation failure with `map_rando: base_shuffle`",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.4.0a/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "a4d112c84dda451fd7c14061777ac299ccb0daac59b7b1355ea58214745fb640",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.4.0a",
      "size": 61228,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.4.0a",
      "title": "Toejam & Earl AP World v0.4.0a",
      "version_simple": "0.4.0",
      "world_version": "0.4.0a0"
    },
    "v0.4.0b": {
      "created_at": "2026-01-28T01:59:55Z",
      "description": "- Fixed death link always being enabled",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.4.0b/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "05507710eddea6d117f3cbbf767e1574cb74418051726018ff2d63f2555295eb",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.4.0b",
      "size": 61229,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.4.0b",
      "title": "Toejam & Earl AP World v0.4.0b",
      "version_simple": "0.4.0",
      "world_version": "0.4.0b0"
    },
    "v0.4.1": {
      "created_at": "2026-02-02T12:00:59Z",
      "description": "- Added checks for reaching each level. Add `reach_level_checks: yes` to your YAML to enable.\r\n- Added Earthling randomization, accessible via the `earthling_rando` YAML option\r\n- Items will no longer fail to be received while travelling in an elevator\r\n- Fixed a couple of bugs that prevented items being received in certain circumstances\r\n- Rank checks now only add checks up to the maximum rank chosen (instead of always adding 8 and making the upper ones filler)\r\n- Extra Promotions will now be strategically added if the available points are clearly insufficient to reach the required rank check (greatly reduces generation failures for worlds with fewer items and/or levels)",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.4.1/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "4275ee38ef6045eabf8aae8182a0f88a0c09e567e8be4794fdc5b08616941a80",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.4.1",
      "size": 64076,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.4.1",
      "title": "Toejam & Earl AP World v0.4.1",
      "version_simple": "0.4.1",
      "world_version": "0.4.1"
    },
    "v0.4.2": {
      "created_at": "2026-02-20T13:18:53Z",
      "description": "## New additions\r\n\r\n- The \"browse for ROM file\" dialog now supports more common extensions (.smd, .md and .bin)\r\n- New YAML option: `earthling_rando_niceness` (value between 1 and 10), which makes \"normal\" placements of randomized Earthlings more likely when using `earthling_rando: nice_random`\r\n- New YAML option: `local_ship_pieces`, which lets you force ship pieces to be completely vanilla, all local or all remote\r\n- Ship pieces now have a \"Ship Piece:\" prefix for easier searching\r\n\r\n## Bugfixes\r\n\r\n- Fixed an issue where nondefault values of `last_level` would cause the ship piece requirement for the final elevator to be ignored\r\n- `earthling_rando: nice_random` now uses the world RNG\r\n- Added extra code to perfectly track ship item triggering; these locations will no longer accidentally trigger on reset\r\n\r\n## Misc\r\n\r\n- Cleaned up all assembly code used for the base patch and extracted it for easy future modification and documentation\r\n- \"Ship item\" locations have been renamed to \"Big item\" locations to differentiate them from actual ship pieces and reflect the fact that they may contain anything at all",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.4.2/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "d617b75da0d2c3ab51cf4a5d082bdf999d567f03f68743a5029b59019fcd6432",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.4.2",
      "size": 77671,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.4.2",
      "title": "Toejam & Earl AP World v0.4.2",
      "version_simple": "0.4.2",
      "world_version": "0.4.2"
    },
    "v0.4.2a": {
      "created_at": "2026-02-21T04:15:07Z",
      "description": "- Fix critical dialog error when collecting ship pieces",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.4.2a/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "70eca2edfa99ac1bd0dea8df717585000344a1b526a7a3359b0362ebf0c8d5bb",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.4.2a",
      "size": 77687,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.4.2a",
      "title": "Toejam & Earl AP World v0.4.2a",
      "version_simple": "0.4.2",
      "world_version": "0.4.2a0"
    },
    "v0.4.2b": {
      "created_at": "2026-02-23T18:02:46Z",
      "description": "- Fixed a freeze that could occur when collecting ship pieces with `max_level` set to less than 25\r\n- Fixed a race condition in how the item queue handles local and remote collection that may have been the cause of some items going missing\r\n- Modified the \"jammin\" text on ship piece collection to match the vanilla game",
      "download_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/download/v0.4.2b/tje.apworld",
      "has_manifest": false,
      "hash_sha256": "3f3f744c569d236f01892b2b7a0f45a6906c5859f1570317de7009d4fe522890",
      "html_url": "https://github.com/IgnisUmbrae/TJE-Archipelago/releases/tag/v0.4.2b",
      "size": 77652,
      "source_url": "https://api.github.com/repos/IgnisUmbrae/TJE-Archipelago",
      "tag": "v0.4.2b",
      "title": "Toejam & Earl AP World v0.4.2b",
      "version_simple": "0.4.2",
      "world_version": "0.4.2b0"
    }
  }
}
