{
  "description": "Tyrian is a PC SHMUP originally released in 1995, and then re-released as Tyrian 2000 in 1999. Follow space pilot\nTrent Hawkins in the year 20,031 as he flies through the galaxy to defend it from the evil corporation, Microsol.\nThis randomizer supports both versions of the game.",
  "game": "Tyrian",
  "github": "https://github.com/KScl/TyrianArchipelago",
  "license": "zlib",
  "manifest_fields": [
    "authors",
    "minimum_ap_version",
    "world_version"
  ],
  "versions": {
    "v0.4.5-alpha3": {
      "created_at": "2024-04-07T03:57:02Z",
      "description": "Episode 1 can be completed 100%, other episodes are in varying states of completion.",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v0.4.5-alpha3/tyrian.apworld",
      "has_manifest": false,
      "hash_sha256": "8e96f2e7e2f81e2b781a22a6c5a2af43caaba3876b743f3af10d779ae11bd5cf",
      "html_url": "https://github.com/KScl/TyrianArchipelago/releases/tag/v0.4.5-alpha3",
      "prerelease": true,
      "size": 41546,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v0.4.5-alpha3",
      "title": "v0.4.5-alpha3",
      "version_simple": "0.4.5",
      "world_version": "0.4.5a3"
    },
    "v0.4.5-alpha4": {
      "created_at": "2024-04-21T19:56:38Z",
      "description": "## v0.4.5-alpha4\r\n\r\nMajor things:\r\n- Episode 2 logic is in a playable state\r\n- Many improvements to logic; now fully takes generator status into account\r\n  - Can't start with weapons your generator and logic difficulty can't support you firing\r\n- New options:\r\n  - Shop Mode: Shops Only\r\n    - Pre-fills all checks in levels with Credits items for your own world, leaving the item pool reserved entirely for shops.\r\n  - Logic Difficulty: No Logic\r\n    - Removes all in-level logic rules. Assumes that as long as you have the level unlocked, you can beat it and access every location in it.\r\n\r\nMinor things:\r\n- Bug fixes:\r\n  - Fixed Lightning Left/Right twiddles having incorrect inputs\r\n  - Fixed Episode 5 location/shop desync (#1)\r\n  - Fixed inconsistent and problematic generator behavior if a nonprogressive generator was placed in start_inventory in an otherwise progressive items world\r\n  - Save games for local (.aptyrian) games now get a save game name of \"local\" instead of ... nothing\r\n- Added ALttP credits texts for the majority of Tyrian items\r\n- Changed text colors of useful/progression items around a bit\r\n  - Progression + Useful item classification now explicitly supported (displays as green)\r\n- As per above, Level items are now classified as Progression + Useful to distinguish them\r\n- Rear weapon mode now persists in savegames and can be toggled when upgrading rear weapon (Press `/`, or click the weapon mode lights on the left side)\r\n- Archipelago Radar, in most cases, now highlights the entire enemy that contains a check, instead of a single tile of it\r\n- Extremely long item names in the shop are now truncated with an ellipsis instead of terminating abruptly\r\n\r\nWhat's still missing:\r\n- Logic:\r\n  - Most logic for Episode 3\r\n  - All logic for Episodes 4 and 5\r\n- Options:\r\n  - Boss Weaknesses: On\r\n    - Fully accounted for in logic, but client doesn't respect it\r\n  - Twiddles: Chaos\r\n    - Not yet implemented (errors on generation)\r\n  - Show Twiddle Inputs: On\r\n    - Not respected by the client (\"Ship Info\" isn't implemented at all yet)\r\n- Other things:\r\n  - Rebinding inputs still isn't possible from in game yet",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v0.4.5-alpha4/tyrian.apworld",
      "has_manifest": false,
      "hash_sha256": "4ae257754439118786d2b790e0eb96c5d25ee1d774f4624e8a2335f55f73aa55",
      "html_url": "https://github.com/KScl/TyrianArchipelago/releases/tag/v0.4.5-alpha4",
      "prerelease": true,
      "size": 58829,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v0.4.5-alpha4",
      "title": "v0.4.5-alpha4",
      "version_simple": "0.4.5",
      "world_version": "0.4.5a4"
    },
    "v0.80.0": {
      "created_at": "2024-07-31T00:29:58Z",
      "description": "## v0.80.0\r\n\r\nPrimary changes in this version are the introduction of Data Cube Hunt mode, and proper support for Episode 3.\r\n\r\nVersion numbering was changed, and is no longer tied to the version of Archipelago used.\r\n\r\n### Major changes\r\n- Episode 3 (Mission: Suicide) is now playable\r\n- Logic rewritten significantly, for faster generation times\r\n- New APWorld options:\r\n  - Data Cube Hunt (`data_cube_hunt`)\r\n    - Collect a set amount of cubes to unlock your goal levels!\r\n    - Works best with only one episode marked as `goal`, with the rest `on`.\r\n    - You can require anywhere from 1 to 99 data cubes to reach your goal. (`data_cubes_required`)\r\n    - You can have anywhere from 1 to 200 data cubes total in your game (`data_cubes_total`), or...\r\n    - ... you can specify the number of data cubes that should be present, as a percentage of the required amount. (`data_cubes_total_percent`)\r\n  - Logic: Boss Time-out (`logic_boss_timeout`)\r\n    - This used to be controlled by Logic Difficulty, but it has been split out into its own option.\r\n    - If true, timing out bosses that can be timed out is expected of the player in logic.\r\n  - Local Level Percentage (`local_level_percent`)\r\n    - Sets some percentage of randomly chosen levels to be local to your own world.\r\n    - May reduce the likelihood of BK mode due to not being sent any levels, but may also result in less interaction with other worlds. \r\n\r\n### Minor changes\r\n- Bug fixes:\r\n  - Fixed a crash when firing a Flying Punch\r\n  - Fixed Easy difficulty getting 175% enemy health instead of the intended, vanilla 75%\r\n  - Fixed player names with aliases getting cut off in the shop\r\n  - Fixed AP items hiding behind destroyed ground enemies sometimes\r\n  - Fixed two locations in SAVARA II (Episode 1) accidentally being swapped with each other\r\n- You can now paste (CTRL+V) into input fields like the chat box and server name\r\n- Sidekicks that use ammo now have their ammo amounts displayed in the upgrade menu\r\n- Expert logic difficulty plays a little nicer early on than it used to\r\n",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v0.80.0/tyrian.apworld",
      "has_manifest": false,
      "hash_sha256": "8565122658bf9a541ea49907078d1ab5e6f2c66999aa29f07c3aea4f3c39d260",
      "html_url": "https://github.com/KScl/TyrianArchipelago/releases/tag/v0.80.0",
      "prerelease": true,
      "size": 66328,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v0.80.0",
      "title": "v0.80.0",
      "version_simple": "0.80.0",
      "world_version": "0.80.0"
    },
    "v0.80.1": {
      "created_at": "2024-08-01T20:48:44Z",
      "description": "## v0.80.1\r\n\r\nThis is a minor release intended to make APTyrian a bit more user-friendly, and tweak logic a little bit to be nicer in the early game.\r\n\r\nMinor changes:\r\n- There is now some rudimentary version checking of the level patch file, to make sure it stays in sync with the executable. If you try to start APTyrian with the patch file (`patch.jsonc`) of a previous version, it will display an error dialog telling you that it needs to be updated.\r\n- Common errors, like not finding Tyrian's data files, now display an error dialog before closing, instead of just closing silently.\r\n- Some weapons have been excluded from consideration at certain points in logic, when using them is deemed infeasible for that location in particular.\r\n- Some tweaks to Episode 2's logic in particular to stop being thrown into MARKERS and MISTAKES too early.",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v0.80.1/tyrian.apworld",
      "has_manifest": false,
      "hash_sha256": "16b6d40c440033e9099f16a60f2c328548f80111f74e621cc5335de63f26e9c8",
      "html_url": "https://github.com/KScl/TyrianArchipelago/releases/tag/v0.80.1",
      "prerelease": true,
      "size": 66784,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v0.80.1",
      "title": "v0.80.1",
      "version_simple": "0.80.1",
      "world_version": "0.80.1"
    },
    "v0.80.2": {
      "created_at": "2024-08-09T01:11:47Z",
      "description": "## v0.80.2\r\n\r\nThis is another minor release to work around some vanilla issues and fix some bugs.\r\n\r\nMinor changes:\r\n- Added a failsafe for an AP Item attempting to spawn and failing to do so. The location it would've checked is sent out for free in that case.\r\n- Fixed Beginner logic difficulty failing to generate because of an older location name not being updated.\r\n- All pertaining to one specific location in IXMUCANE (Episode 3):\r\n  - Fixed an enemy conflict that caused the item to spawn erratically, sometimes nowhere near the enemy that was actually destroyed\r\n  - Fixed the item remaining fixed in place on the screen, in whatever position it spawned in\r\n  - Fixed a missing rule for this location that led to it being expected earlier than intended",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v0.80.2/tyrian.apworld",
      "has_manifest": false,
      "hash_sha256": "2a1c9c9326bccfe04d4f92e58d6bfd3edee232afc249be1919bdb6adc1f659b6",
      "html_url": "https://github.com/KScl/TyrianArchipelago/releases/tag/v0.80.2",
      "size": 66915,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v0.80.2",
      "title": "v0.80.2",
      "version_simple": "0.80.2",
      "world_version": "0.80.2"
    },
    "v0.99.1": {
      "created_at": "2025-03-28T19:56:32Z",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v0.99.1/tyrian.apworld",
      "hash_sha256": "8df0f3c232b1166537dce67c00f795adfaf503e38fe46dc694b614c8008025a0",
      "size": 83366,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v0.99.1",
      "title": "v0.99.1 (Testing release)",
      "version_simple": "0.99.1",
      "world_version": "0.99.1"
    },
    "v1.0.0": {
      "created_at": "2025-04-01T20:00:53Z",
      "description": "Welcome to 1.0, Archipelago Tyrian.\r\n\r\nWith this release, I consider Tyrian as an APWorld to be in **beta**. Every single level in the game is now playable, and the vast majority of things that were on my to-do list are now present, including some stuff that was sorely needed; for example, the ability to re-map inputs while in game.\r\n\r\nDue to the great number of changes made between this version and the last stable version (v0.80.2), v1.0.0 is _not compatible_ with games generated for a prior version.\r\n\r\n## Changelog\r\nMajor changes:\r\n- Episodes 4 and 5 now have logic, item placements, etc. This means that the entire game can now be randomized.\r\n- Keyboard and joystick inputs can now be configured in-game.\r\n- Improved joystick controls in general, especially for menu navigation.\r\n- Connecting to a server with a password is now supported.\r\n- The Jukebox can now be accessed in the middle of a game, and now displays messages from Archipelago while in it.\r\n- The three bonus games (Zinglon's Ale, Zinglon's Squadrons, and Zinglon's Revenge) can now be played; they do not unlock anything or send any items, but they can serve as a way to pass the time in BK mode.\r\n  - Optionally, access to these bonus games can be locked behind items in the multiworld.\r\n- Levels can now be removed from the item pool, which automatically removes their locations too; consider this a more advanced method of excluding a level that you don't want to play.\r\n\r\n<details>\r\n<summary>Minor changes / added polish:</summary>\r\n<ul>\r\n<li>Archipelago Radar is no longer an option at generation time, and can instead be toggled in the options menu in-game.\r\n<li>All options have been organized into groups.\r\n<li>Maximum power level is now shown in the weapon select / upgrade menu, as locks over the power bar.\r\n<li>Archipelago's \"race mode\" is now supported. (Cheats are disabled if race mode is on)\r\n<li>Websocket compression is now supported, removing a warning from Archipelago version 0.6.0 onward.\r\n<li>Tyrian 2000's weapons now use consistent (and no longer ear-piercing) sound effects.\r\n<li>The planet display when choosing the next level to play and/or shop at now smoothly moves to the planet the level is at, instead of instantly snapping there.\r\n<li>Post-game results screen improvements:\r\n<ul>\r\n<li>The number of times you exit the level early (via quitting from the menu, without dying) is now tracked and displayed.\r\n<li>Time does not start being tracked until a level is entered for the first time. This makes the times displayed a more accurate representation of how long the game was played, ignoring setup time.\r\n<li>Locally collected checks are now tracked and distinguished separately from same slot co-op / collected checks.\r\n<li>As a result of the above change, games with auto-release turned on now properly show the number of checks that you made; previously, they would always show full completion.\r\n</ul>\r\n</ul>\r\n</details>\r\n<details>\r\n<summary>Bug fixes:</summary>\r\n<ul>\r\n<li>Updated to the latest version of OpenTyrian, fixing a few bugs that were present upstream.\r\n<li>Fixed a vanilla bug where player shots could have their damage underflow if destroying multiple enemies at the same time.\r\n<li>Fixed items in the shop with underscores in their names sometimes not showing up properly.\r\n<li>DeathLink:\r\n<ul>\r\n<li>Fixed the string clean-up / unicode character parsing code not being run on DeathLink messages. Unicode characters in them that exist in Tyrian's font (e.g., \"é\") should now display in game.\r\n<li>Empty DeathLink messages are now treated properly, and a more generic message will be displayed instead.\r\n</ul>\r\n<li>Error messages that show up while connecting to a server are now properly contained in the message box, instead of being allowed to run outside of the bounds of the screen.\r\n<li>Fixed patched level events sometimes containing stale data. This manifested in a lot of random, difficult to reproduce bugs that changed depending on what order levels were played in.\r\n<li>Fixed the generic item names in Shop Mode: Hidden not showing up correctly.\r\n</ul>\r\n</details>",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v1.0.0/tyrian.apworld",
      "has_manifest": false,
      "hash_sha256": "a2711fdf6a0c571b96ed246715df6160fd0aa575f85592206dada08bedafc0d9",
      "html_url": "https://github.com/KScl/TyrianArchipelago/releases/tag/v1.0.0",
      "size": 83927,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v1.0.0",
      "title": "v1.0.0",
      "version_simple": "1.0.0",
      "world_version": "1.0.0"
    },
    "v1.0.1": {
      "created_at": "2025-04-09T04:13:53Z",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v1.0.1/tyrian.apworld",
      "hash_sha256": "a2711fdf6a0c571b96ed246715df6160fd0aa575f85592206dada08bedafc0d9",
      "size": 83927,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v1.0.1",
      "title": "v1.0.1",
      "version_simple": "1.0.1",
      "world_version": "1.0.1"
    },
    "v1.0.1r2": {
      "created_at": "2025-04-09T04:13:53Z",
      "description": "This is an extremely minor bug fix release. The ~~APWorld is unchanged~~ APWorld changed only subtly to fix a single bug, and non-Windows users probably don't even need to bother updating, as the changes almost entirely affect Windows.\r\n\r\n## Changelog\r\n\r\n- Fixed the game name in player join messages not being properly sanitized.\r\n- Updated the version of SDL2 that Windows releases ship with, from `2.30.0` to `2.32.0`.\r\n  - Should fix audio popping issues.\r\n- Fixed a generation crash when another world has unconnected entrances.\r\n",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v1.0.1/tyrian.apworld",
      "has_manifest": false,
      "hash_sha256": "8a2015d005b9c521c6b291e395ad929ae120dc12556ad08de67b492724e7b1a6",
      "html_url": "https://github.com/KScl/TyrianArchipelago/releases/tag/v1.0.1",
      "size": 83945,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v1.0.1r2",
      "title": "v1.0.1",
      "version_simple": "1.0.1",
      "world_version": "1.0.1.post2"
    },
    "v1.0.2": {
      "created_at": "2025-07-07T20:05:30Z",
      "description": "Minor release, compatible with games generated with previous 1.0.x versions.\r\n\r\n## Changelog\r\n\r\n- Fixed the firing behavior of sidekicks with charge levels (the Charge Cannon and Zica Supercharger). Their behavior now depends on which version of the game you are using:\r\n  - In Tyrian 2.1, these sidekicks auto-fire when the main fire button is held down, as before.\r\n  - In Tyrian 2000, these sidekicks do not auto-fire and require their own sidekick button to be pressed to fire them.\r\n- Fixed item names in shops not being properly sanitized.\r\n- Fixed \"hidden\" shops listing the first item as \"Archipelago Item 0\".\r\n- Added a visual indicator in the menu when Solar Shields have been acquired.\r\n- Rebalanced the \"balanced\" weapon upgrade cost option.\r\n- Late-game shops were made a bit cheaper.\r\n- A few other minor tweaks to logic.",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v1.0.2/tyrian.apworld",
      "has_manifest": false,
      "hash_sha256": "de596a4e6fa0616befaa81cb7be8711dbcee2d010d95cc388c68ffcff8ed1dbb",
      "html_url": "https://github.com/KScl/TyrianArchipelago/releases/tag/v1.0.2",
      "size": 83964,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v1.0.2",
      "title": "v1.0.2",
      "version_simple": "1.0.2",
      "world_version": "1.0.2"
    },
    "v1.0.3": {
      "created_at": "2025-10-14T19:12:14Z",
      "description": "Minor release, compatible with games generated with previous 1.0.x versions.\r\n\r\n## Changelog\r\n\r\n- Fixed the boss location in TYRIAN X not being sent out when playing with 2.1 data files\r\n- Fixed DeathLink events being sent and received during bonus games\r\n- The last good server address and slot name are now saved in the config file, and thus persist across sessions\r\n- A lot of general maintenance to the APWorld due to the change in supported Python versions\r\n- Added a manifest to the APWorld\r\n- Where possible, some damage logic calculations are now cached, to lower generation times\r\n",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v1.0.3/tyrian.apworld",
      "has_manifest": true,
      "hash_sha256": "2851d3a122ebc6339dadfbbf9e46d7addd28ead242ae0d9271c6607c9d2b6ca4",
      "html_url": "https://github.com/KScl/TyrianArchipelago/releases/tag/v1.0.3",
      "minimum_ap_version": "0.6.3",
      "size": 84363,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v1.0.3",
      "title": "v1.0.3",
      "version_simple": "1.0.3",
      "world_version": "1.0.3"
    },
    "v1.0.4": {
      "created_at": "2025-12-31T17:53:02Z",
      "description": "Minor release, as always, compatible with games generated with previous 1.0.x versions.\r\n\r\n## Changelog\r\n\r\n- Fixed two potential DeathLink messages being concatenated together.\r\n- Added some information to slot data for potential trackers / later Universal Tracker handling.\r\n- Twiddles are now only considered for logic in Master logic difficulty.\r\n- Data Cubes are now deprioritized (won't appear on priority locations).\r\n- A few more guardrails were added to logic, including a few additional ways to handle some situations that only occur on extremely high game difficulty settings. This should make the world fuzz reliably, finally. \r\n- The _clockwise_ rotating orb wheel in LAVA EXIT has had its location name fixed.",
      "download_url": "https://github.com/KScl/TyrianArchipelago/releases/download/v1.0.4/tyrian.apworld",
      "has_manifest": true,
      "hash_sha256": "af41d5c99c0d9c8355c7871caa0a66423abdf24a02180af9ce2a6c73ca8b5000",
      "html_url": "https://github.com/KScl/TyrianArchipelago/releases/tag/v1.0.4",
      "minimum_ap_version": "0.6.3",
      "size": 84591,
      "source_url": "https://api.github.com/repos/KScl/TyrianArchipelago",
      "tag": "v1.0.4",
      "title": "v1.0.4",
      "version_simple": "1.0.4",
      "world_version": "1.0.4"
    }
  }
}
