{
  "game": "",
  "github": "https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "Alpha_1.1": {
      "created_at": "2025-12-22T13:51:28Z",
      "description": "This is only a .1 update but its still pretty chonky in size. \r\n\r\nNotable changes-\r\n\r\nCUSTOM GOOSE COLOURS ARE FIXED! \r\n- In game press the C key on your keyboard to change the gooses colour between a selection of colours including rainbow. \r\n- Goose model village figure now correctly tracked and included in the locations when pickups are included. \r\n- Garden and Hub boots have individual IDs\r\n- Souls for NPCs and pickups as an enableable option with basic logic applied. There are undoubtedly going to be some things I missed, so please let me know.  \r\n- The model village church has about 30+ checks applied to the tower as a last hurrah for your seed. Each peck at the sandstone will be a location now.\r\n-Updated Client appearance to match in game. Toggle this with F1 once the new mod is installed. \r\n- Along with this is a new souls tracker (F2) and a server log (F3)\r\n-New warp functions tied to number keys\r\n1= Garden\r\n2= High Street\r\n3= Back Gardens\r\n4= Pub\r\n5= Model village\r\nH= Hub\r\n\r\nThese are only usable if you have that area unlocked and are not holding any items in your beak. \r\n\r\nI am aware of a bug with Picnic basket and topsoil items and their souls. Yet to find a solution I am happy with so for the time being ignore them if you don't have their soul items.\r\n\r\n\r\n",
      "download_url": "https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/releases/download/Alpha_1.1/untitled_goose_game.apworld",
      "failed_to_load": "Choice option 'random' cannot be manually assigned.",
      "has_manifest": false,
      "hash_sha256": "dd3f0c7e02961dfb822dc361efbd7504f85483e6bb0203f3fc46a3d31491c023",
      "html_url": "https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/releases/tag/Alpha_1.1",
      "size": 63229,
      "source_url": "https://api.github.com/repos/PixelShake92/Untitled-Goose-Game-Archipelago",
      "tag": "Alpha_1.1",
      "title": "Alpha Version 1.1",
      "version_simple": "1.1",
      "world_version": "1.1"
    },
    "Alpha_2.0": {
      "created_at": "2026-01-18T09:08:15Z",
      "description": "This is a massive new release entirely possible as soon as it is due to the phenomenal contributions by Mia. On my end, I got item highlight tracking working, showing that items that are unchecked locations in the mutliworld will slowly change from RGB colours. This makes it much easier to see and track what has and hasn't been done. The updated features are listed below. \r\n\r\n\r\n**Summary**,\r\nNew yaml options including new goals & less traps,\r\nMany logic fixes,\r\nFixed several bugged props & souls,\r\nUI QoL including in-game highlighting of unchecked props,\r\n\r\n**Options & YAML Settings,**\r\nThere are now 7 goals to choose between! Victory is always when the bell is brought home, but there are new ways to spawn it:,\r\nonly_steal = Simply reach the bell and steal it!,\r\nfind_bell = The Golden Bell is somewhere in the multiworld! Find it before you can steal it,\r\nall_main_tasks = Complete all four area task lists to spawn the Golden Bell,\r\nonly_speedrun_tasks = Complete all 'To Do (Quickly!!)' tasks to spawn the Golden Bell,\r\nall_tasks_no_speedrun = Complete all four area task lists as well as the 'To Do (As Well)' task lists to spawn the Golden Bell,\r\nall_tasks = Complete all task lists to spawn the Golden Bell,\r\nfour_final_tasks = Complete the final task of each of the four area task lists to spawn the Golden Bell,\r\nAdded a setting to logically require all NPC souls for completion (can result in more available NPCs for the final sequence),\r\nAdded options to customize locations (more on that below),\r\nAdded lots of traps and filler items customization, and you can now have less traps!,\r\nAdded clarification for which settings are incompatible with others, and YAML validation (generation will throw an error if attempting to use incompatible settings),\r\n\r\n**Items & Souls,**\r\nThe Golden Bell Soul is now always an item even when prop souls are disabled. It is always locked to new goal-specific locations except when the goal is to find it somewhere randomly in the pool,\r\nCook Soul is now progression; she is required for spawning the Delivery Box,\r\nRemoved souls tied to NPCs (eg. Slippers spawn with the Tidy Neighbour),\r\nRemoved souls that spawn from events (eg. Vase Pieces spawn when the Vase is broken),\r\nRemoved some other souls (eg. Boards to the Back Gardens and the Fence Bolt to the starting gate),\r\nRemoved Coin Soul to add the new filler item: Coins! These disappear on reset, so collect as many as you can before you do!,\r\nGrouped some souls together (eg. Mini Street Bench Soul & Mini Bench Soul),\r\nProp souls which only unlock a single check have been changed from progression to progression_deprioritized,\r\nRenamed Right Strap Soul to Bra Soul and fixed the bra's physics,\r\nRemoved Rose Box Soul until its physics can be fixed,\r\nMostly fixed the drawer physics (if it breaks, reset from the pause menu to fix it),\r\nFixed the picnic basket handles being unattached to the basket,\r\nFixed some instances of souls giving incorrect items (eg. the Picnic Basket Soul would also spawn the shopping basket),\r\n\r\n**Locations & Logic,**\r\nAdded a new item pickup location for the pint bottle found in the Hub and the garden fork found in High Street,\r\nAdded milestone locations (All Garden Tasks Complete, All Speedrun Tasks Complete, etc, which can be enabled in the YAML settings),\r\nPecking the model church can now be 0 checks, 2 checks, or 35 checks depending on YAML settings,\r\nFixed some bugs where completing some tasks would reward the wrong locations,\r\nCompletely overhauled the logic, fixing many bugs and adding new logical paths to completing some tasks (eg. you may need to lure the TV Shop Owner out using the walkie talkies if you can't trap the boy in the phone booth),\r\n\r\n**UI & Quality of Life,**\r\nProp highlighting! When a prop has an unchecked pickup or drag location associated with it, it will change colours (customizeable in the settings),\r\nAdded a warp to the starting area (needed because it was possible to soft-lock yourself by teleporting somewhere before unlocking the start gate),\r\nAdded teleport info to the F1 tab of the UI,\r\nExpanded upon the F2 tab of the UI to attempt to better state where to find certain props\r\n\r\nAgain a massive thankyou to Mia for their work to get this released as polished as it is.\r\n\r\n## What's Changed\r\n* Logic changes with souls & a few extra things by @MiaSchemes in https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/pull/2\r\n* Fix Delivery Box logic bug by @MiaSchemes in https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/pull/3\r\n\r\n## New Contributors\r\n* @MiaSchemes made their first contribution in https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/pull/2\r\n\r\n**Full Changelog**: https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/compare/Alpha_1.1...Alpha_2.0",
      "download_url": "https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/releases/download/Alpha_2.0/untitled_goose_game.apworld",
      "failed_to_load": "Choice option 'random' cannot be manually assigned.",
      "has_manifest": false,
      "hash_sha256": "47bb9f3e4f12d8c981c5c9732d28e9e4ede9405627ce229f6da14f5152dc0a5d",
      "html_url": "https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/releases/tag/Alpha_2.0",
      "size": 32105,
      "source_url": "https://api.github.com/repos/PixelShake92/Untitled-Goose-Game-Archipelago",
      "tag": "Alpha_2.0",
      "title": "Alpha Version 2.0 (Yes it deserves a 2.0 title now)",
      "version_simple": "2.0",
      "world_version": "2.0"
    },
    "Alpha_2.1": {
      "created_at": "2026-01-28T06:05:42Z",
      "download_url": "https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/releases/download/Alpha_2.1/untitled_goose_game.apworld",
      "has_manifest": false,
      "hash_sha256": "43067de88ed58d91a7d2bbf371e40a8e5d78b60c7864ddbff992b14e8e2a727f",
      "size": 43354,
      "source_url": "https://api.github.com/repos/PixelShake92/Untitled-Goose-Game-Archipelago",
      "tag": "Alpha_2.1",
      "title": "Alpha 2.1",
      "version_simple": "2.1",
      "world_version": "2.1"
    },
    "Alpha_2.1r2": {
      "created_at": "2026-01-28T06:05:42Z",
      "description": "# Alpha Version 2.1 + Deathlink Bugfix\r\n\r\n## Summary\r\n\r\nMany prop-related bug fixes, logic fixes, a complete naming overhaul (Carrot Soul → Carrots, Bow Soul → Ribbons, etc), new item groups, and new YAML options including an option to enable a brand new list of tasks!\r\n\r\n---\r\n\r\n## 🎮 Quality of Life & UI Changes\r\n\r\n- Updated the README and setup guide\r\n- Updated the F1 UI menu with the new hotkeys\r\n- Added a new UI menu, accessible via F4, which displays the list of brand new tasks added to the game (if enabled)\r\n- Teleporting to the back gardens now teleports you outside of the yards until you've broken through the boards to get in\r\n- Teleporting to the pub now teleports you outside of the pub until you've entered it once\r\n- Teleporting to high street (only when you're on the final task) now teleports you directly into the garage so that you can lure the market lady to open it (in case she's bugged)\r\n\r\n---\r\n\r\n## 💀 DeathLink!\r\n\r\n- Drop all held items and warp to the hub when sent a DeathLink\r\n- Send a DeathLink to your friends when you get shooed away by anyone, even the intro gate!\r\n\r\n---\r\n\r\n## 🐛 Bug Fixes\r\n\r\n- Many props which previously bugged out (Drawer, Duck Statue, etc) now do so far less frequently, and a reset should now always fix them\r\n- Most props which didn't spawn in correctly (eg. Umbrellas) have been fixed\r\n- Tasks which required multiple items (eg. the picnic or going shopping) now properly logically require all of them\r\n- Many other logic fixes\r\n- The well interaction location now functions properly\r\n- Darts no longer highlight incorrectly based on the dartboard\r\n- Because the fertilizers all share a mesh, they now all stay highlighted until all of them have been dragged at least once\r\n\r\n---\r\n\r\n## 📦 Item Changes\r\n\r\n- Removed the word \"Soul\" from prop names\r\n- Renamed props to be closer to their in-game names (eg. Bows are now called Ribbons)\r\n- Quoits are now split into Green Quoits and Red Quoits\r\n- Cabbages are now in the item pool\r\n- The football is now in the item pool\r\n- The rope to close the garage door is now in the item pool\r\n- The rose box is once again in the item pool\r\n- The miniature goose is no longer tied to the Miniature People item and is now shuffled into the pool on its own\r\n\r\n### New Item Groups\r\n\r\n`Area Unlocks` | `NPC Souls` | `Grouped Props` | `Start or Hub Props` | `Garden One-Off Props` | `Garden Props` | `High Street One-Off Props` | `High Street Props` | `Back Gardens One-Off Props` | `Back Gardens Props` | `Pub One-Off Props` | `Pub Props` | `Model Village One-Off Props` | `Model Village Props` | `Fillers` | `Traps` | `Main Task Progression Props`\r\n\r\n---\r\n\r\n## ⚙️ Location & YAML Option Changes\r\n\r\n- Renamed many locations to suit their in-game names or new prop names\r\n- Renamed the \"Include Prop Souls\" option to \"Include Props\"\r\n- Added an option to enable the brand new list of tasks, which are all listed in the YAML and can be seen in-game by pressing F4",
      "download_url": "https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/releases/download/Alpha_2.1/untitled_goose_game.apworld",
      "failed_to_load": "Choice option 'random' cannot be manually assigned.",
      "has_manifest": false,
      "hash_sha256": "8689abf6f22c859118afb1fbfa96fac1ff46747f57e7eb608df300333485d623",
      "html_url": "https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/releases/tag/Alpha_2.1",
      "size": 43370,
      "source_url": "https://api.github.com/repos/PixelShake92/Untitled-Goose-Game-Archipelago",
      "tag": "Alpha_2.1r2",
      "title": "Alpha 2.1",
      "version_simple": "2.1",
      "world_version": "2.1.post2"
    },
    "playable": {
      "created_at": "2025-12-14T08:36:07Z",
      "description": "This is the first release for Untitled Goose Game in Archipelago. There is a lot to cover so let's go over some things. \r\n\r\nWhat's in:\r\n\r\nFull randomizer integration with Archipelago multiworld\r\n5 area access items (Garden, High Street, Back Gardens, Pub, Model Village)\r\nAll goals, pickups, drag locations, and interactions as checks (~280 locations)\r\nTraps: Tired Goose, Suspicious Goose, Butterbeak, Confused Feet\r\nProgressive items: Speedy Feet, Mega Honk, Silent Steps, A Goose Day\r\nConfigurable starting area\r\n\r\nWhat's not:\r\n\r\nDeathlink (I have a system in place its just not fully integrated so won't work)\r\nNo in-game server log (couldn't get it working properly, will revisit)\r\n\r\nKnown issues:\r\n\r\nGroundskeeper sometimes won't hammer the garden gate - logic accounts for this\r\nReconnecting mid-game may require F9 to resync gates \r\nGoose colour changes when picking up items or entering water. Eventually the Goose just becomes a black void. This is only an issue if you change colour by pressing C on the keyboard.  \r\n\r\n\r\nRequirements:\r\n\r\nBepInEx 5.x\r\nArchipelago 0.5.0+\r\n\r\nReport bugs on GitHub or the AP Discord Channel. \r\n\r\n\r\n🪿 🪿 🪿 ",
      "download_url": "https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/releases/download/playable/untitled_goose_game.apworld",
      "failed_to_load": "Choice option 'random' cannot be manually assigned.",
      "has_manifest": false,
      "hash_sha256": "fb4b9cff73bd07f655c010fdb3e191db0728ebf5002a1cc014cfd526eced51c6",
      "html_url": "https://github.com/PixelShake92/Untitled-Goose-Game-Archipelago/releases/tag/playable",
      "size": 12189,
      "source_url": "https://api.github.com/repos/PixelShake92/Untitled-Goose-Game-Archipelago",
      "tag": "playable",
      "title": "Alpha Version 1.0",
      "version_simple": "1.0",
      "world_version": "1.0"
    }
  }
}
