{
  "description": "Assemble your party of adventurers, delve dungeons, defeat monsters, collect loot, and travel to the distant past to defeat the Dread Sorcerer Ephemeris.",
  "game": "Vespadian",
  "github": "https://github.com/Quinn-Patrick/Archipelago-Vespadian",
  "license": null,
  "manifest_fields": [],
  "versions": {
    "V0.1.0": {
      "created_at": "2025-07-19T17:56:11Z",
      "description": "# Initial Release!\r\n## Overview\r\nVespadian is a game I developed during 2021 using a GameMaker codebase that I started in 2018. This APWorld is intended for use with the version of Vespadian attached here. The features are as follows:\r\n\r\n- 212 Locations (All the treasure chests, plus rescuing Ariadne and defeating Ephemeris, which is the goal).\r\n- 331 Items (The 19 progression items plus a few powerful pieces of equipment are guaranteed, the rest are shuffled in at random and are obviously not guaranteed).\r\n- 1 YAML option: Require Lockpicking. If this option is on, all chests behind locked doors will be in logic as soon as you have access to the adventurer's guild to recruit a thief.\r\n- When you get a check from a treasure chest, it will tell you what item you sent and to which game.\r\n\r\n## Generating\r\nSimply install the apworld, configure your YAML, and generate.\r\n\r\n## Joining\r\nDownload vespadian.zip and unzip it wherever you want. Run vespadian.exe, start a new game, create your party, and continue advancing text until you have control of your character. From there, press esc to open the menu, scroll to Archipelago, press enter to select it, and use the options in that menu to set the server, port, slot name, and password if needed. Hit connect and you're good to go. You should see \"Connected to server\" pop up in the bottom left, which is also where you will see checks come in. If nothing appears, then the connection was not successful. The game may hang for a little bit a few seconds after connecting. This is because Vespadian gets a data package from the server that it uses to match item ids from other games to item names, and it takes time to process.\r\n\r\n## Other Notes\r\nThe version of Vespadian used here includes many features and bugfixes that are not present in the non-archipelago version that's been available on my itch.io since 2021, like the Adventurer's Guild to modify your party after starting the game, extra sprites for the player characters to make them more expressive in battle, and the ability to level up all the way to 99 by multiclassing after reaching level 50.\r\n\r\nThis game is extremely obscure, so you won't be able to find any documentation or walkthroughs if you get stuck. There are also a lot of bugs, but it seems generally stable from my testing.",
      "download_url": "https://github.com/Quinn-Patrick/Archipelago-Vespadian/releases/download/V0.1.0/vespadian.apworld",
      "has_manifest": false,
      "hash_sha256": "f1b65650d01a83efa46d2ee911793acc386dfe96da64e9872351bb7a9398e84c",
      "html_url": "https://github.com/Quinn-Patrick/Archipelago-Vespadian/releases/tag/V0.1.0",
      "size": 40825,
      "source_url": "https://api.github.com/repos/Quinn-Patrick/Archipelago-Vespadian",
      "tag": "V0.1.0",
      "title": "Vespadian APWorld 0.1.0",
      "version_simple": "0.1.0",
      "world_version": "0.1.0"
    },
    "V0.1.1": {
      "created_at": "2025-08-02T19:03:31Z",
      "description": "## Fixes\r\n\r\n- Removed print statements.\r\n- Fix an off by one error when populating the item pool.",
      "download_url": "https://github.com/Quinn-Patrick/Archipelago-Vespadian/releases/download/V0.1.1/vespadian.apworld",
      "has_manifest": false,
      "hash_sha256": "46bb003621dd5f2ba426779881f9c1f59055cc32365b318702c9bb116953c02f",
      "html_url": "https://github.com/Quinn-Patrick/Archipelago-Vespadian/releases/tag/V0.1.1",
      "size": 40588,
      "source_url": "https://api.github.com/repos/Quinn-Patrick/Archipelago-Vespadian",
      "tag": "V0.1.1",
      "title": "Vespadian APWorld 0.1.1",
      "version_simple": "0.1.1",
      "world_version": "0.1.1"
    }
  }
}
