{
  "description": "Say howdy to West of Loathing -- a single-player slapstick comedy adventure role-playing game set in the wild west \nof the Kingdom of Loathing universe. Traverse snake-infested gulches, punch skeletons wearing cowboy hats, grapple \nwith demon cows, and investigate a wide variety of disgusting spittoons. Explore a vast open world and encounter a \ncolorful cast of characters, some of whom are good, many of whom are bad, and a few of whom are ugly.",
  "game": "West of Loathing",
  "github": "https://github.com/Lucasvdm/WOLAP",
  "license": "MIT",
  "manifest_fields": [],
  "versions": {
    "v0.1.0-alpha": {
      "created_at": "2025-05-01T23:12:53Z",
      "description": "Initial release.\r\n\r\nIn addition to basic Archipelago functionality, the full list of game changes currently in the mod can be found in the [changelist](./docs/changelist.md).\r\n\r\nReckonin' at Gun Manor DLC is supported.  Many more features and Archipelago options are planned.  There are a few known issues (e.g. the received-item popup pauses on the screen when you open the inventory or settings and such), but feedback of any kind - from bugs, to suggested features and options, to user experience and overall mod/randomization design - is highly encouraged.  I'm especially interested in hearing about the overall spread/pacing of the randomized items and general Archipelago experience for full playthroughs.\r\n\r\nThere is new UI on the main menu to connect to an Archipelago server.  After connecting, please be careful to load the correct save for the connected world.  Most changes to the game's logic won't be applied if you load an unmodded save (saves created while the mod is installed are flagged as modded), and for modded saves previously-found checks won't be sent again, but you currently may still receive any items that have been found for that world that haven't already been marked as received for that save.",
      "download_url": "https://github.com/Lucasvdm/WOLAP/releases/download/v0.1.0-alpha/westofloathing.apworld",
      "has_manifest": false,
      "hash_sha256": "5c0ef740016550d7246a7ca94be0f84bd199c351738c5720581fa0523d2dabf3",
      "html_url": "https://github.com/Lucasvdm/WOLAP/releases/tag/v0.1.0-alpha",
      "prerelease": true,
      "size": 29848,
      "source_url": "https://api.github.com/repos/Lucasvdm/WOLAP",
      "tag": "v0.1.0-alpha",
      "title": "WOLAP v0.1.0",
      "version_simple": "0.1.0",
      "world_version": "0.1.0"
    },
    "v0.1.1-alpha": {
      "created_at": "2025-05-04T20:27:10Z",
      "description": "Small patch to address some issues from initial playtesting and add a few more access rules.\r\n\r\n# APWorld Changes\r\n- Commented out a currently empty Option Group to fix errors when running Archipelago from source\r\n- Added access rules for progressive medical and El Vibrato container loot since these aren't as free to farm as the other types technically are, you need a couple of items\r\n\r\n# Client Mod Changes\r\n- Fixed pocketknife and herbal remedy being granted when found or received\r\n- Fixed P.O. box 441 being re-openable when it shouldn't be, which caused errors\r\n- Fixed Ghostwood temp permit check being repeatable when it shouldn't be, which caused errors.\r\n- Fixed Ghostwood new temp permit dialogue being repeatable when it shouldn't be, and fixed the town hall logic if you don't have a temporary pass and still need to go ask the Department of Requisitions about a pencil.\r\n- Fixed IndexOutOfRange exceptions from progressive Nex-Mex books when disconnecting/reconnecting to Archipelago and going from one modded save to another, which could push the count above 7 (it is now reset/checks the saved count on save load)\r\n- Fixed not being able to ask the Ghostwood Department of Requisitions about getting a pencil if you've already received a full visitor ID from the pool (you now can), and added some different dialogue in that case\r\n\r\nIf you've already installed the mod, the patch can be applied just by overwriting the WOLAP.dll file with the new version.  Applying the new .apworld would involve generating a new multiworld, but isn't necessary if you already have a run in progress.",
      "download_url": "https://github.com/Lucasvdm/WOLAP/releases/download/v0.1.1-alpha/westofloathing.apworld",
      "has_manifest": false,
      "hash_sha256": "07e2d8a267c94f36fc282a1c1762feeb9104d42f92c5c5f858b456a9fea37e20",
      "html_url": "https://github.com/Lucasvdm/WOLAP/releases/tag/v0.1.1-alpha",
      "size": 29936,
      "source_url": "https://api.github.com/repos/Lucasvdm/WOLAP",
      "tag": "v0.1.1-alpha",
      "title": "WOLAP v0.1.1",
      "version_simple": "0.1.1",
      "world_version": "0.1.1"
    },
    "v0.1.2-alpha": {
      "created_at": "2025-05-06T05:09:02Z",
      "description": "# APWorld Changes\r\n- Added a forgotten requirement for lockpicking in the access rules for a couple of locations\r\n  - Breadwood Bunkhouse - Footlocker\r\n  - Fort Cowardice Back Office - Pie Safe\r\n\r\n# Client Mod Changes\r\n- Fixed a breaking bug which prevented progress past Railroad Camp (West), since it wouldn't let you build the bridge (this was probably breaking scripts elsewhere too)\r\n  - This was caused by an error in the way the mod disables permaflag commands to prevent changes to permanent out-of-save progress/unlocks during modded play.  It was accidentally causing scripts to force-close when those commands were run, which meant that in the case of the bridge it never reached the point of updating the quest progress flag.\r\n- Fixed a mistyped rand() command from the vanilla code that was throwing an error\r\n- Added a log message for sent items, both for completeness and to help with future debugging\r\n- Fixed the received items popup freezing while some UI elements were open that paused the game clock (inventory, options menu, dialogue window, map, etc.)\r\n  - It now hides (while still paused) when these windows are open, and reappears and continues when they're closed if there are any more items to show, so you don't miss out on any notifications while it's hidden\r\n  - It also now closes and the popup queue is cleared when returning to the main menu\r\n  - There's a known issue here where it might reappear during dialogue if there's an input popup (e.g. naming your horse during the tutorial-skip script), but it still behaves normally otherwise when the window closes again\r\n\r\nIf you've already installed the mod, the patch can be applied just by overwriting the WOLAP.dll file with the new version.  Applying the new .apworld requires generating a new multiworld.",
      "download_url": "https://github.com/Lucasvdm/WOLAP/releases/download/v0.1.2-alpha/westofloathing.apworld",
      "has_manifest": false,
      "hash_sha256": "69bd770b27a4cc83ba29cd4d1fdc73bb8ab9be459d2ecd06e8ec761065f92dbb",
      "html_url": "https://github.com/Lucasvdm/WOLAP/releases/tag/v0.1.2-alpha",
      "size": 29954,
      "source_url": "https://api.github.com/repos/Lucasvdm/WOLAP",
      "tag": "v0.1.2-alpha",
      "title": "WOLAP v0.1.2",
      "version_simple": "0.1.2",
      "world_version": "0.1.2"
    },
    "v0.1.3-alpha": {
      "created_at": "2025-05-08T22:31:41Z",
      "description": "# APWorld Changes\r\n- Fixed a variety of access rules\r\n  - Added missing access rule for the Holy Relic Quest Completed location, now correctly requires relic items\r\n  - Several Ghostwood locations were missing cumulative item requirements from earlier steps of the quest\r\n  - Added missing access rule for the Chuck's House Cellar items, which all require Chuck's Key to get down there\r\n  - Added missing access rules requiring the El Vibrato Transponder to get to Curious Copse and Curious Abandoned Well, and be eligible for El Vibrato encounters in Region D\r\n  - Added missing access rule for the Gustavson Gulch Cafe Hut, which needs lockpicking.\r\n  - Fixed missing requirements in the access rules for Dave J's Grave and the Dirtwater chef quest completion\r\n- Renamed locations\r\n  - `Gun Manor Pantry - Back Row, Third Rack` > `Gun Manor Pantry - Back Row Third Rack`\r\n  - `Military Cemetery - 2nd Lt., 69th Innuendo Div.` > `Military Cemetery - 2nd Lt. 69th Innuendo Div. (Combat)`\r\n    - Due to the way the game's scripts work the commas in these locations were breaking things, so they had to be removed\r\n    - Added \"(Combat)\" to the 69th Innuendo Div. location to clarify that although there are many Military Cemetery plots in that division, some of them are just treasure drops, and the check/original item only drops from the combat encounters\r\n  - `Fort Cowardice Mess Hall - Spice Rack` > `Fort Cowardice Mess Hall - Spice Rack (Chef Quest)`\r\n  - `Random Encounter (Region A) - Murder Pepper` > `Random Encounter (Region A) - Murder Pepper (Chef Quest)`\r\n  - `The Daveyard - Dave J's Grave` > `The Daveyard - Dave J's Grave (Chef Quest)`\r\n    - Clarifying that these locations are part of the Dirtwater chef's quest and need progression in that quest to be picked up\r\n    - Technically P.O. Box 441 is also (originally) part of this quest, but following the way the game's vanilla logic works (not that it actually mattered in vanilla), it only checks for the key and not the quest progress flag.  So with items being randomized, it's pretty much entirely separate from the rest of the quest.  This may change in the future.\r\n\r\n# Client Mod Changes\r\n- Fixed a crash in the Region D horse skeleton medical loot encounter\r\n- Updated new location names\r\n- Changed plot 69 at the Military Cemetery to be the _right kind_ of 69th Innuendo Division plot (combat, not just treasure), so it can drop the check\r\n  - This is obviously the one that people will remember and try to use for that location, so it's easiest if it just works even if it wouldn't normally be the case in vanilla\r\n- Added a condition requiring the temporary permit before doing the full visitor ID process in Ghostwood, and changed some dialogue that was misleading before.  Previously there were some cases where you were waiting for an item and Town Hall would just tell you that you still need a #3 pencil, even if you have one.  This could be updated in the future to check the player's flags and inventory to give a proper hint about what they need to do/find next, but for now at least it's a bit more generic.\r\n- Added a miss point for the Stripey Hat Gang Killed check (if you arrest them) which was, ironically, missing\r\n- Fixed the Dave J's Grave check accidentally being repeatable\r\n\r\nIf you've already installed the mod, the patch can be applied just by overwriting the WOLAP.dll file with the new version.  Applying the new .apworld requires generating a new multiworld.\r\n\r\nNote that if you only patch the client mod, any updated location names will be mismatched and won't be granted properly, so you'll need to manually release those in Archipelago when you'd normally check them (or whenever you like, I'm not your supervisor).",
      "download_url": "https://github.com/Lucasvdm/WOLAP/releases/download/v0.1.3-alpha/westofloathing.apworld",
      "has_manifest": false,
      "hash_sha256": "c52dbd2e15bebae85c6a9eff03185e5286fa7411d92a4b0d46985c93888e9557",
      "html_url": "https://github.com/Lucasvdm/WOLAP/releases/tag/v0.1.3-alpha",
      "size": 30256,
      "source_url": "https://api.github.com/repos/Lucasvdm/WOLAP",
      "tag": "v0.1.3-alpha",
      "title": "WOLAP v0.1.3",
      "version_simple": "0.1.3",
      "world_version": "0.1.3"
    },
    "v0.1.4-alpha": {
      "created_at": "2025-05-12T23:26:23Z",
      "description": "# APWorld Changes\r\n- Fixed the logic for `Gun Manor Kitchen - Cooked the Chili` access\r\n- Added a logical requirement for the Hedge Wizard's Orb for the 7-leaf crafting check, so you can use the infinite hedge monster farm portal for it (you should always be able to get at least 11 leaves from the existing fights in the hedge maze without it for the first 2 checks)\r\n- Added the clownwort in the Gun Manor Hedge Maze to the logic for resistance checks\r\n- Fixed the logic for `Opened Charred Locket` access (turns out you actually need the charred locket, who'd'a thunk)\r\n- Fixed the logic for `Gun Manor Laboratory - Gunsmithing Tools (Opus)` access\r\n- Added new location `El Vibrato Construction Facility - HOSOM NOAN NOFU`\r\n  - This is the location where you'd normally get the El Vibrato model bridge.  When planning things out initially I wasn't sure if I wanted to randomize that item (it's the only one of the bridge-building solutions that just requires a single item) -- at some point I did put the item in the pool, but I forgot to add the location.  Still not sure about it, but I'll probably turn it into a YAML option of some kind.  Should be working for now.\r\n- Fixed the logic for `El Vibrato Construction Facility - BUGAANZEVE` access\r\n\r\n# Client Mod Changes\r\n- Fixed `Abandoned Pickle Factory Vinegar Room - Coal Cart` being considered missed if you solve the factory puzzle before grabbing that check\r\n- Made it so you have to talk to Grace (the haunted doll at Stearns Ranch) about the goblet and the altar password before you have the option to give the goblet to her\r\n  - This both makes sense logically and also prevents the Blood Altar check from being missable\r\n- Replaced the normal El Vibrato model bridge drop with the new `El Vibrato Construction Facility - HOSOM NOAN NOFU` check\r\n\r\n\r\nIf you've already installed the mod, the patch can be applied just by overwriting the WOLAP.dll file with the new version.  Applying the new .apworld requires generating a new multiworld.\r\n\r\nNote that if you only patch the client mod, any updated location names will be mismatched and won't be granted properly, so you'll need to manually release those in Archipelago when you'd normally check them (or whenever you like, I'm not your supervisor).",
      "download_url": "https://github.com/Lucasvdm/WOLAP/releases/download/v0.1.4-alpha/westofloathing.apworld",
      "has_manifest": false,
      "hash_sha256": "bdafc189c45fbe82148ad08d73022da1b0306b933c1455c4b2f364f9d11e889a",
      "html_url": "https://github.com/Lucasvdm/WOLAP/releases/tag/v0.1.4-alpha",
      "size": 30473,
      "source_url": "https://api.github.com/repos/Lucasvdm/WOLAP",
      "tag": "v0.1.4-alpha",
      "title": "WOLAP v0.1.4",
      "version_simple": "0.1.4",
      "world_version": "0.1.4"
    },
    "v0.1.5-alpha": {
      "created_at": "2025-05-15T23:22:58Z",
      "description": "# APWorld Changes\r\nN/A\r\n\r\n# Client Mod Changes\r\n- Updated the Archipelago.MultiClient.Net library to its latest release version to fix issues with refused connections on Archipelago 0.6.2\r\n\r\nNote that this release also provides an updated **Archipelago.MultiClient.Net.dll**, so you'll need to copy and replace that alongside the WOLAP.dll to apply the patch.",
      "download_url": "https://github.com/Lucasvdm/WOLAP/releases/download/v0.1.5-alpha/westofloathing.apworld",
      "has_manifest": false,
      "hash_sha256": "41fd0a9eec1c48ff1922a24e9fc65f9721d3fdb88858aed78c2e8926deb49e70",
      "html_url": "https://github.com/Lucasvdm/WOLAP/releases/tag/v0.1.5-alpha",
      "size": 30858,
      "source_url": "https://api.github.com/repos/Lucasvdm/WOLAP",
      "tag": "v0.1.5-alpha",
      "title": "WOLAP v0.1.5",
      "version_simple": "0.1.5",
      "world_version": "0.1.5"
    },
    "v0.1.6-alpha": {
      "created_at": "2025-05-29T19:24:06Z",
      "description": "# APWorld Changes\r\n- Removed the Lockpickin' requirement for Silversmith's House locations (although you do need to unlock the door, it doesn't require Lockpickin' -- just a needle)\r\n- Added new location `Fort Cowardice - Cannonball` for where you'd normally pick up the demi-culverin cannonball\r\n\r\n# Client Mod Changes\r\n- Fixed it so you don't get locked out of dirtwater chef quest pickup locations (spice rack, murder pepper encounter, Dave J's grave) if you receive the relevant quest item early and hand it in -- as long as you've made it to the right step of the quest, you should be able to get those checks at any point afterward\r\n- Implemented the new location for the cannonball pickup in Fort Cowardice\r\n- Tweaked the logic for El Vibrato/Perfessor-related pardner dialogue to check if you've met the Perfessor yet\r\n- Fixed it so you don't get locked out of parts of the Breadwood mail quest, including the Postal Way Station and Chuck's House locations, if you receive and use the missing mail or postal code sheet items early\r\n- Fixed Gun Manor showing up in the end credits incorrectly if you never visited\r\n\r\n\r\nIf you've already installed the mod, the patch can be applied just by overwriting the WOLAP.dll file with the new version.  Applying the new .apworld requires generating a new multiworld.\r\n\r\nNote that if you only patch the client mod, any updated location names will be mismatched and won't be granted properly, so you'll need to manually release those in Archipelago when you'd normally check them (or whenever you like, I'm not your supervisor).",
      "download_url": "https://github.com/Lucasvdm/WOLAP/releases/download/v0.1.6-alpha/westofloathing.apworld",
      "has_manifest": false,
      "hash_sha256": "3baf6d853bba3d6ed69809c87f588b11d6c0d2db4336d51754e476cc49d2c8d4",
      "html_url": "https://github.com/Lucasvdm/WOLAP/releases/tag/v0.1.6-alpha",
      "size": 30568,
      "source_url": "https://api.github.com/repos/Lucasvdm/WOLAP",
      "tag": "v0.1.6-alpha",
      "title": "WOLAP v0.1.6",
      "version_simple": "0.1.6",
      "world_version": "0.1.6"
    },
    "v0.2.0-alpha": {
      "created_at": "2025-06-16T23:11:34Z",
      "description": "This update isn't quite as substantial as I'd have liked for the first minor version change, but it's not technically just a patch/bugfix or a location tweak, so.  Version 0.2 it is.\r\n\r\n# APWorld Changes\r\n- Added a new YAML option: `unbreakable_tools`\r\n  - Information about this option has been added to this repo's README, but it basically does what it says on the tin.\r\n\r\n# Client Mod Changes\r\n- Implemented Unbreakable Tools option\r\n- Pickaxes and shovels now become infinitely purchasable from Dirtwater Mercantile when you receive the respective tool from the item pool first\r\n  - As with most other AP-related purchases (shop checks, etc.), this is just set at a flat rate of 1000 meat for now, until I can get a better idea of how to balance these costs\r\n  - This should make it so that even with Unbreakable Tools disabled (default), there are no longer situations where logic is broken because you lose a tool you previously received and you have to cheat one in\r\n- Removed various remaining ways of getting tools such as a pickaxe, shovel, hammer, etc. that weren't already randomized/turned into a check location, to force you to receive those tools from the item pool\r\n- Fixed it so you're not prevented from loading a modded save if you don't own the DLC\r\n- Fixed the flags around the catacomb saints so you can still fight them and get their checks even if you receive and turn in their quest items beforehand\r\n- Fixed the flags for Rufus' gift packages so you can get the checks beyond the first one\r\n\r\n\r\nIf you've already installed the mod, the patch can be applied just by overwriting the WOLAP.dll file with the new version.  Applying the new .apworld requires generating a new multiworld.\r\n\r\nIf you update the client mod and continue with an existing multiworld, Unbreakable Tools will be considered `false` by default and everything should still work, but tools being added to the shop is only triggered when receiving them from the pool so if that's already happened you may still need to work around it.",
      "download_url": "https://github.com/Lucasvdm/WOLAP/releases/download/v0.2.0-alpha/westofloathing.apworld",
      "has_manifest": false,
      "hash_sha256": "ae3aaa15ead20ba4cf9504a8eecfe8616cbacbbd299cf5afbd51f910afb2dc75",
      "html_url": "https://github.com/Lucasvdm/WOLAP/releases/tag/v0.2.0-alpha",
      "size": 30707,
      "source_url": "https://api.github.com/repos/Lucasvdm/WOLAP",
      "tag": "v0.2.0-alpha",
      "title": "WOLAP v0.2.0",
      "version_simple": "0.2.0",
      "world_version": "0.2.0"
    },
    "v0.2.1-alpha": {
      "created_at": "2025-07-16T05:03:53Z",
      "description": "# APWorld Changes\r\nN/A\r\n\r\n# Client Mod Changes\r\n- Made it so you can still enter the Fort Cowardice toilet tent even if you can read the Goblintongue sign and know what you're getting into\r\n- Fixed an issue that screwed up some Ghostwood logic after handing in the final logging permit quest item to the mayor early\r\n- Made it so you can still talk to Halloway about Curly's map (and the second half of it) even if you've put both halves together without reading it\r\n- Made it so you can still murder your live chili if you've already handed in the ghost chili to the hungry ghost\r\n- Fixed Shroomcave sleeping cultist checks dropping when looting the bone pile left after Grutch is summoned at Reboot Hill\r\n- Fixed clown campsite checks being considered missed when losing the campsite fight, and unlocked Danny's Tannery in that case too so that entire area isn't completely missable\r\n  - On top of its own 6 checks, being locked out of the tannery (by losing this fight and destroying or getting kicked out of the circus before learning about it from Barnaby Bob) also prevented you from unlocking Grady's shop, which has a few more checks and other indirect effects.  Overall it was just too harsh, and also kind of a hassle to implement logic-wise.\r\n\r\n\r\nIf you've already installed the mod, the patch can be applied just by overwriting the WOLAP.dll file with the new version.",
      "download_url": "https://github.com/Lucasvdm/WOLAP/releases/download/v0.2.1-alpha/westofloathing.apworld",
      "has_manifest": false,
      "hash_sha256": "ae3aaa15ead20ba4cf9504a8eecfe8616cbacbbd299cf5afbd51f910afb2dc75",
      "html_url": "https://github.com/Lucasvdm/WOLAP/releases/tag/v0.2.1-alpha",
      "size": 30707,
      "source_url": "https://api.github.com/repos/Lucasvdm/WOLAP",
      "tag": "v0.2.1-alpha",
      "title": "WOLAP v0.2.1",
      "version_simple": "0.2.1",
      "world_version": "0.2.1"
    },
    "v0.2.2-alpha": {
      "created_at": "2025-08-14T17:40:26Z",
      "description": "# APWorld Changes\r\n- Fixed an issue with generating a multiworld where there are multiple WOL slots and some have DLC enabled, some don't\r\n- Fixed access rules for places requiring El Vibrato keystones\r\n  - Previously I'd considered the El Vibrato Chamber in Lost Dutch Oven Mine as a possible keystone source, somehow forgetting that you also need a keystone to get in there in the first place...\r\n  - Only valid sources now involve having the El Vibrato Transponder and being able to get to The Perfessor's House or map region D/E (where you can farm them from random encounters)\r\n- Fixed access rules for level 2/3 leatherworkery crafting checks, since you need to be able to get to regions E and G respectively to guarantee you can get all the smoldering and infernal leather you need for those\r\n\r\n# Client Mod Changes\r\n- Fixed an issue with not being able to get the Stole the Slide Whistle check if you already received the slide whistle from the pool and returned it\r\n- Fixed an issue with not being able to do level 2/3 master cookery crafting if you already did all the level 1 crafts\r\n- Made double sure that there's definitely no way you can go to the Boring Springs tutorial now on a modded save, regardless of if you have the permaflag for previously completing the tutorial or not\r\n- Fixed the three portable crafting benches overlapping in your Dirtwater bedroom and rearranged a few other props to fit them\r\n\r\n\r\nIf you've already installed the mod, the patch can be applied just by overwriting the WOLAP.dll file with the new version.  Applying the new .apworld requires generating a new multiworld.",
      "download_url": "https://github.com/Lucasvdm/WOLAP/releases/download/v0.2.2-alpha/westofloathing.apworld",
      "has_manifest": false,
      "hash_sha256": "b84235ea8e9f3b0c01a95b5c3bfff6db623a800ce345a7d29a044835dc3591ea",
      "html_url": "https://github.com/Lucasvdm/WOLAP/releases/tag/v0.2.2-alpha",
      "size": 30924,
      "source_url": "https://api.github.com/repos/Lucasvdm/WOLAP",
      "tag": "v0.2.2-alpha",
      "title": "WOLAP v0.2.2",
      "version_simple": "0.2.2",
      "world_version": "0.2.2"
    },
    "v0.2.3-alpha": {
      "created_at": "2025-09-19T22:51:28Z",
      "description": "# APWorld Changes\r\n- Renamed `Random Encounter (Region E) - 13th Encounter (Mallet)` location to `Random Encounter (Region E) - 13th Cowrrupted Encounter`\r\n- Fixed ghost whiskey requirement for `Random Encounter (Region D) - Drunk Ghost (Give Whiskey)` location\r\n- Fixed shovel requirement for `Military Cemetery - 2nd Lt. 69th Innuendo Div. (Combat)` location\r\n\r\n# Client Mod Changes\r\n- Fixed a couple of checks in Jumbleneck Mine not being sent under some conditions (`Lunchbox` and `Rock Pile By Elevator`)\r\n- Fixed `Alexandria Ranch - Smoldering Book Pile` being inaccessible if you received and handed in the overdue Breadwood book beforehand\r\n- Fixed Gustavson Gulch Theatre Combat if you listen to the play beforehand\r\n  - This was already intended to not be a missable check, but to be changed so you can still fight them after listening in - that should now work\r\n- Fixed the El Vibrato headband being able to be used on a cultist and lost, thereby locking you out of Murray's shop\r\n  - This is now treated the same as other breakable tools such as the shovel and pick, and is affected by the Unbreakable Tools YAML option.  When you receive the headband from the pool you can purchase replacements from Dirtwater Mercantile, and if Unbreakable Tools is enabled you can use it without losing it.\r\n\r\n\r\nIf you've already installed the mod, the patch can be applied just by overwriting the WOLAP.dll file with the new version. Applying the new .apworld requires generating a new multiworld.\r\n\r\nNote that if you only patch the client mod, any updated location names will be mismatched and won't be granted properly, so you'll need to manually release those in Archipelago when you'd normally check them (or whenever you like, I'm not your supervisor).",
      "download_url": "https://github.com/Lucasvdm/WOLAP/releases/download/v0.2.3-alpha/westofloathing.apworld",
      "has_manifest": false,
      "hash_sha256": "067a4eedb88859872bfbfd2fd0b9d8520fa69cfcf697afadfb6b4d288fc61a27",
      "html_url": "https://github.com/Lucasvdm/WOLAP/releases/tag/v0.2.3-alpha",
      "size": 31000,
      "source_url": "https://api.github.com/repos/Lucasvdm/WOLAP",
      "tag": "v0.2.3-alpha",
      "title": "WOLAP v0.2.3",
      "version_simple": "0.2.3",
      "world_version": "0.2.3"
    }
  }
}
